{
  "introHeaderOne": "SECURITY DRIVEN APPLICATIONS",
  "introHeaderTwo": "Modernizing your business by building a digital presence that earns revenue. Consulting with us will leave you confident that your digitization will be a step in the right direction.",
  "music": "Enjoy some music as you explore",
  "bannerMessage":"Check out the Cartisim App if you want to become a programmer",
  "policiesStatement":" We highly value your privacy and respect your data wishes. This website uses cookies and other similar technologies. It is a requirement to accept our Privacy Policy and Terms of Service in order to use Cartisim.io. Please review our policies and select “Accept” to continue.",
  "accept":"Accept",
  "goBack": "Go Back",
  "menuItemOne": "Why Cartisim?",
  "menuItemTwo": "Projects",
  "menuItemThree": "Contact",
  "menuItemFour": "Learn To Code",
  "solutionsTitle": "Solutions",
  "projectTitle":"Projects",
  "projectText":"Here is a list of what we do and what we've done",
  "project1Title":"Cartisim App",
  "project1":"Cartisim App is an intuative application that focuses on serving you video content. The purpose of the application was to instruct people on how to program, but since it's inception has become so much more and continues to grow. It's focus is to bring to you quality video on how to do different tasks along with first class support in order for you to accomplish whatever goal you have in mind. With the increase in features we look forward to the release of Cartisim App.",
  "project2Title":"FCSDKiOS",
  "project2":"FCSDKiOS is a Software Development Kit that makes VoIP and real time communication easy for you in building your own applications. The goal of FCSDK iOS is to deliever a robust experience with simple API useage with a high performance capacity.",
  "project3Title":"CBA Transport Services",
  "project3":"CBATS is a WebSocket Framework built on top of SwiftNIO. The goal of this project was to deliever a NIO Framework that has cross platform capabilities built with Apple's Network.Framework networking layer via NIO Transport Services for first class experience and performance.",
  "solutionSubheadingOne": "Absorption",
  "solutionsTextOne": "Have a project and a set budget? The reality is that great apps are an investment. Once your project requirements are defined, we can use the absorption package and incrementally reach your goal. We will keep it simple. Here's the breakdown:",
  "solutionsListOneA":"40 hour budget increments",
  "solutionsListOneB":"Understanding your project inside and out",
  "solutionsListOneC":"Build what you want when you can",
  "solutionsListOneD":"MVP- Design, Develop, Ship",
  "solutionSubheadingTwo": "Custom",
  "solutionsTextTwo": "A valuable product is so much more than code that works. It’s simple reusable code that is horizontally scaleable. A Custom build gives you just that. We will discuss in detail the requirements and plan the project from the ground up, just like an architect designs a beautiful building. After all is said and done, we will deliver the product to the specifications as laid out in your requirements.",
  "solutionsListTwoA":"Guidance of product development every step of the project build",
  "solutionsListTwoB":"Understanding your project inside and out",
  "solutionsListTwoC":"App planning for long term usage and growth",
  "solutionsListTwoD":"UI/UX Consultation",
  "solutionsListTwoE":"Approach",
  "solutionsListTwoF":"UI Design",
  "solutionsListTwoG":"Design Architecture",
  "solutionsListTwoH":"Best use case development",
  "solutionsListTwoI":"Discussion of project maintenance and app growth",
  "solutionSubheadingThree": "Custom Maintenance",
  "solutionsTextThree": "Grab the pro team for tailored projects to your demand. When you have the pro team package, you are paying for so much more than a product. You are working with a team of professionals that not only build your project properly, but also take care of it as it grows. Take a look at what pros do.",
  "solutionsListThreeA":"Guidance of product development every step of the project build",
  "solutionsListThreeB":"Understanding your project inside and out",
  "solutionsListThreeC":"App planning for long term usage and growth",
  "solutionsListThreeD":"UI/UX Consultation",
  "solutionsListThreeE":"Approach",
  "solutionsListThreeF":"UI Design",
  "solutionsListThreeG":"Design Architecture",
  "solutionsListThreeH":"Best use case development",
  "whatIsTitle": "Why Cartisim?",
  "whatIsText": "Cartisim (Car-tee-seem) means \"cards\" in Hebrew. You may ask yourself, \"Where and why did you come up with this name?\" That’s a great question. My wife and I have been traveling the world for a few years now, and during our travels, we have spent some time in the Middle East. During that time, we started learning a few different languages, and since the conception of my business I decided that everything is like a card. Why is that? Cards can introduce you to who you need to know in order to make a connection that you need. Whether it is a business card, website, or application, it’s the medium in which you get your desired result. Hence, the name Cartisim mean card(s); we introduce you to whatever means you need with the technology we build, like this application. Cartisim Development has been built as a company to meet your needs and demands when it comes to how you introduce yourself to the world via technology.",
  "whatIsSmallText": "(We are not affiliated or related to Cartisim Corporation (based in New York) in any way)",
  "nf": "404 Not Found",
  "businessOverviewTitle": "Let's build your project",
  "businessOverviewOne": "Perhaps you simply want a beautiful application built that adds value to your business. Consult with us to learn what would best fit your needs.",
  "businessOverviewTwo": "There is a lot that goes into building a proper application. You should be able to understand what you are getting in return for your investment. What you need and deserve is clear communication and simple easy workflow that you can follow.",
  "businessOverviewThree": "Here are some of the services and benefits of working with Cartisim on all projects",
  "businessItemOne" : "A portfolio containing your project's scope",
  "businessItemTwo": "Video conferencing that shows your project progress",
  "businessItemThree" : "A quality code base that adds value now and for the future",
  "businessItemFour": "Ownership over your project resources",
  "businessReasonsTitle": "Feel free to contact us so we can set up a free video conference call up to 30 minutes and we can discuss some common questions related to development.",
  "applicationTitle": "Take a look at what we do",
  "applicationListItemOne": "Security",
  "applicationListItemTwo": "Quality",
  "applicationListItemThree": "Beauty",
  "applicationListItemFour": "Efficiency",
  "applicationListItemFive": "Performance",
  "whyUs": "Why Us?",
  "banner": "",
  "privacy": "Privacy",
  "privacyTitle": "Privacy Policy",
  "privacyStatement": "At Cartisim, we value deeply everyone’s right to have their data kept safe. Our policy explains to you what we do with your information so you can make an educated decision on whether or not you wish to accept our policy. Please take your time to read our policy carefully.",
  "privacyParagraph": "Your Privacy is important. We keep all of your information confidential to the best of our ability. Any emails that are sent by the enquirer to us, whether via email contact form, or newsletter form, will be used to contact the individual for conversation between the enquirer and the enquired. If you volunteer your email by any of these methods, your email may be used for business deals via newsletters. You may opt out at any time if you no longer wish to receive these opportunities. Any forms you submit and information you have entered in for any reason shall be kept strictly for transactional purposes of the single instance. We will not keep any information from one transaction for future transactions.",
  "privacySubheading": "Cookies/Similar Tech",
  "privacyParagraphTwo": "Cookies are used to make browsers and websites functional. This section will break down cookies used on our website, what they do, and why they are beneficial. Cookies may or may not be used to remember your personal preferences that you have chosen, if you have visited this website before. For example, perhaps you chose to download a particular link. We may use cookies to remember that for future reference. We do not use cookies for advertising or to gather your information for these purposes.",
  "privacySubheadingTwo": "Needed Cookies",
  "privacyParagraphThree": "You may ask for a particular service or wish to interact with our website in a certain manner. For instance, you may wish to submit a form. Without using cookies, we are not able to complete what you have asked us to do. We do out best to keep your information safe and sound.",
  "privacySubheadingThree": "Working Cookies",
  "privacyParagraphFour": "These cookies make your web experience enjoyable to your need. They remember your choices from previous times to enhance your visit to our websites.",
  "privacySubheadingFour": "Analytics",
  "privacyParagraphFive": " Cookies used for analytic purposes on our websites help us to make your web experience more enjoyable. From these we can find our audience, what they like or don't like by how long they visit a page, how many visitors visit the website, when they visit, where their country of origin is, and what type of platform they prefer. Cookies help developers build better websites for their visitors.",
  "privacySubheadingFive": "Your IP Address",
  "privacyParagraphSix": "IP addresses are <i>like</i> id tags of a computer on the internet, BUT they do not identify you as an individual without additional information (e.g. your ISP has additional information).",
  "privacySubheadingSix": "Web Beacons",
  "privacyParagraphSeven": "Beacons are web files that basically record activity. They keep track of when pages are visited. They track usage and performance. Our websites may contain beacons.",
  "privacySubheadingSeven": "It's your decision",
  "privacyParagraphEight": "By using our website, you agree to the use of cookies and you agree to our policies. If you don't agree, it's okay, no hard feelings. Depending on your browser, you can control many of these cookie options and similar technologies and be able to adjust these settings. When you first entered our site, cookies were sent to the browser and stored on your computer. In your browser, you can clear these as well. Visiting websites without cookies may dramatically effect your browsing experience.",
  "privacySubheadingEight": "Copyright",
  "privacyParagraphNine": "All work Cartisim&copy; has developed is owned by Cartisim and has exclusive rights to work it has developed, unless otherwise stated.",
"privacySubheadingNine": "Cartisim App",
  "privacyParagraphTen": "The above Privacy Policy disclosure applies to the Cartisim App as well. We do not collect information about you unless it is absolutely necessary, or you willingly give us information needed for the application to function or for your purchases. We do our best to make sure that any information of yours that we do have is treated securely.",
"privacySubheadingTen": "Security",
  "privacyParagraphEleven": "We do our best to make sure all development is as secure as we can within reason. No security is perfect, and there will always be a chance for mishaps, errors, bugs, and other imperfections in security. Security Driven Development means we have a security first mindset as we develop applications. In other words, we are highly security conscious. We offer no guarantee for absolute security.",
  "terms": "Terms",
  "termsTitle": "Terms of Service",
  "termsSubtitleOne":"Software License",
  "termsParagraphOne":" Under this Software License Agreement (the \"Agreement \"), C&K Industries(the \"Vendor\") grants to the user (the \"Licensee\") a non-exclusive and non-transferable license (the \"License\") to use Cartisim.io or any other of our websites or applications including cartisimdevelopment.com, cartisimapp.io, and the Cartisim App with applicable Subscriptions (the \"Software\"). \"Software\" includes the executable computer programs and any related printed, electronic, and online documentation, and any other files that may accompany the product. Title, copyright, intellectual property rights, and distribution rights of the Software remain exclusively with the Vendor. Intellectual property rights include the look and feel of the Software. This Agreement constitutes a license for use only and is not in any way a transfer of ownership rights to the Software. The Software may be used on one iTunes account. If the user’s subscription is current, the user may restore the software in case of new hardware or Software reset. The rights and obligations of this Agreement are personal rights granted to the Licensee only. The Licensee may not transfer or assign any of the rights or obligations granted under this Agreement to any other person or legal entity. The Licensee may not make available the Software for use by one or more third parties. The Software may not be modified, reverse-engineered, or de-compiled in any manner through current or future available technologies. Failure to comply with any of the terms under the License section will be considered a material breach of this Agreement.",
  "termsSubtitleTwo":"License Fee",
  "termsParagraphTwo":"The purchased subscription is what covers this License. The subscription price is subject to change.",
  "termsSubtitleThree":"Limitation of Liability",
  "termsParagraphThree":"The Software is provided by the Vendor and accepted by the Licensee \"as is\". Liability of the Vendor will be limited to subscription price of the Software. The Vendor will not be liable for any general, special, incidental, or consequential damages including, but not limited to, loss of production, loss of profits, loss of revenue, loss of data, or any other business or economic disadvantage suffered by the Licensee arising out of the use or failure to use the Software. The Vendor makes no warranty expressed or implied regarding the fitness of the Software for a particular purpose or that the Software will be suitable or appropriate for the specific requirements of the Licensee. The Vendor does not warrant that use of the Software will be uninterrupted or error-free. The Licensee accepts that software in general is prone to bugs and flaws within an acceptable level as determined in the industry.",
  "termsSubtitleFour":"Warrants and Representations",
  "termsParagraphFour":"The Vendor warrants and represents that it is the copyright holder of the Software. The Vendor warrants and represents that granting the license to use this Software is not in violation of any other agreement, copyright, or applicable statute.",
  "termsSubtitleFive":"Acceptance",
  "termsParagraphFive":"All terms, conditions, and obligations of this Agreement will be deemed to be accepted by the Licensee (\"Acceptance\") on registration of the Software with the Vendor.",
  "termsSubtitleSix":"User Support",
  "termsParagraphSix":"The Licensee will be entitled to as long as the user has a subscription.The user may use email support available 9:00AM to 5:00PM, Weekdays only, at no additional cost. The Licensee will be entitled to maintenance upgrades and bug fixes, at no additional cost, for a period of as long as they have a subscription from the date of Acceptance.",
  "termsSubtitleSeven":"Term",
  "termsParagraphSeven":"The term of this Agreement will begin on Acceptance and is perpetual.",
  "termsSubtitleEight":" This Agreement will be terminated and the License forfeited where the Licensee has failed to comply with any of the terms of this Agreement or is in breach of this Agreement. On termination of this Agreement for any reason, the Licensee will promptly destroy the Software or return the Software to the Vendor.",
  "termsParagraphEight":"The Vendor will be free of liability to the Licensee where the Vendor is prevented from executing its obligations under this Agreement in whole or in part due to Force Majeure, such as an earthquake, typhoon, flood, fire, war, or any other unforeseen and uncontrollable event where the Vendor has taken any and all appropriate action to mitigate such an event.",
  "termsSubtitleNine":"Governing Law",
  "termsParagraphNine":"The Parties to this Agreement submit to the jurisdiction of the courts of the State of Washington for the enforcement of this Agreement or any arbitration award or decision arising from this Agreement. This Agreement will be enforced or construed according to the laws of the State of Washington.",
  "termsSubtitleTen":"Miscellaneous",
  "termsParagraphTen":"This Agreement can only be modified in writing signed by both the Vendor and the Licensee. This Agreement does not create or imply any relationship in agency or partnership between the Vendor and the Licensee. Headings are inserted for the convenience of the parties only and are not to be considered when interpreting this Agreement. Words in the singular mean and include the plural and vice versa. Words in the masculine gender include the feminine gender and vice versa. Words in the neuter gender include the masculine gender and the feminine gender and vice versa. If any term, covenant, condition or provision of this Agreement is held by a court of competent jurisdiction to be invalid, void or unenforceable, it is the parties' intent that such provision be reduced in scope by the court only to the extent deemed necessary by that court to render the provision reasonable and enforceable and the remainder of the provisions of this Agreement will in no way be affected, impaired or invalidated as a result. This Agreement contains the entire agreement between the parties. All understandings have been included in this Agreement. Representations which may have been made by any party to this Agreement may in some way be inconsistent with this final written Agreement. All such statements are declared to be of no value in this Agreement. Only the written terms of this Agreement will bind the parties. This Agreement and the terms and conditions contained in this Agreement apply to and are binding upon the Vendor's successors and assigns.",
  "termsSubtitleEleven":"Notices",
  "termsParagraphEleven":"All notices to the Vendor under this Agreement are to be provided at the following address: C&K Industries: 420 E F Street Rosalia, WA 99170",
  "termsSubtitleTweleve":"©2002-2019 LawDepot.com®",
  "termsParagraphThirteen":"Credit to Apple",
  "termsSubtitleThirteen":"Swift, Swift logo, Xcode, Cocoa, iPhone, iPad, Safari, macCatalyst, App Store, Mac, macOS, iOS, and iPadOS, are trademarks of Apple Inc",
  "buildingBlocks":"Building Blocks",
  "swift":"SWIFT",
  "swiftStatement":"Swift is a cross-platform programming language. The developers of Swift really got it right. A great programming language to build quality applications.",
  "nio":"SwiftNIO",
  "nioStatement":"An IO framework that is flexible, fast, and efficient. Written in Swift as the name suggests, and has been the building blocks of many great frameworks and applications, including Server-Side stuff.",
  "js":"VueJS",
  "jsStatement":"Vue JS is an excellent framework for building Robust Single Page Applications on the Web. Like the one you using right now.",
  "vapor":"Vapor",
  "vaporStatement":"Vapor is a Server-Side framework that can be used to build pretty much anything on the web. From RestAPIs, chat server, dynamic SSR Websites and so much more."
}


