{"tr":{"introHeaderTwo":"Vizyon sizde; çözümü biz sunuyoruz. İster mobil uygulama, ister modern web sitesi, ister tam yığın yazılım sistemi olsun, zorluklarınızı güvenilir ve güvenli ürünlere dönüştürüyoruz. Mobil, Web ve Sunucu alanında kurumsal deneyimle ölçeklenen çözümler kuruyor ve entegre ediyoruz—siz işinize odaklanın.","menuItemOne":"Kurslar","menuItemTwo":"Danışmanlık","menuItemThree":"Yönetim","getInTouch":"İletişime Geçin","projectsHeader":"Yazılımımız","projectsDescription":"Size geniş bir açık kaynak yazılım yelpazesi sunmaya kendimizi adadık. Bu misyonu desteklemek için aynı zamanda bazı kapalı kaynak yazılımlar da sunuyoruz. Hem açık kaynak hem de kapalı kaynak seçeneklerini içeren projelerimizi keşfetmenizi davet ediyoruz. Katkıda bulunmaya veya kapalı kaynak yazılımımız için lisans almaya ilgi duyuyorsanız, lütfen bizimle iletişime geçmekten çekinmeyin.","projectsOverview":"İşte ne yaptığımız ve yaptıklarımızın listesi","businessOverviewTitle":"Swift Yazılım Uzmanları","badgeMobile":"Mobil","badgeWeb":"Web","badgeServer":"Sunucu","businessOverviewDescription":"En zor yazılım zorluklarınızı üretime hazır çözümlere dönüştürüyoruz. Yeni bir uygulama, modern bir web sitesi veya sorunsuz entegre sistemler isteyin—Mobil, Web ve Sunucu’da, projenize uygun dilde teslim ediyoruz. Swift uzmanlığımız tip güvenliği, performans ve güvenilirlik getiriyor; mevcut yığınınızla da entegre oluyoruz. İşinizle birlikte ölçeklenen, kalıcı çözümler için bizimle çalışın.","serviceHeaderBackendDevelopment":"Backend ve API'ler","serviceDescriptionBackendDevelopment":"Ölçeklenebilirlik ve entegrasyon zorluklarını sağlam sunucu tarafı çözümleriyle çözün. API'leri, veritabanlarını ve hizmetleri kurup bağlıyoruz; uygulamalarınız ve siteleriniz her ölçekte güvenilir çalışsın.","serviceHeaderMobileAppDevelopment":"Mobil Uygulamalar","serviceDescriptionMobileAppDevelopment":"Kullanıcıların sevdiği native bir uygulama edinin. Gerçek sorunları çözen iOS, Android ve çapraz platform uygulamaları geliştiriyoruz—zamanında ve mağazaya hazır.","serviceHeaderTraining":"BrewHub","serviceDescriptionTraining":"Ekibinizi profesyonel yazılım geliştirme kurslarıyla güçlendirin. Üretim düzeyinde araçlarla rehberli canlı eğitim; çözümleri dahili inşa edip sürdürebilirsiniz.","serviceHeaderWebDevelopment":"Web Geliştirme","serviceDescriptionWebDevelopment":"Her yerde çalışan web siteleri ve web uygulamaları. Kullanıcı çeken, iş hedeflerinizi destekleyen duyarlı, hızlı ve güvenli deneyimler sunuyoruz.","openSourceHeader":"Açık Kaynak","openSourceDescription":"Açık kaynağın gücüne inanıyoruz. GitHub'daki projelerimizi keşfedin ve topluluğa katkıda bulunun. Desteğiniz yenilikçi çözümler geliştirmeye devam etmemize yardımcı olur.","whyChooseSwift":"Neden Swift Seçmelisiniz?","typeSafety":"Tip Güvenliği","typeSafetyDescription":"Swift'in tip sistemi derleme zamanında hataları önler, uygulamalarınızın ilk günden itibaren sağlam ve güvenilir olmasını sağlar.","performance":"Performans","performanceDescription":"Düşük bellek kullanımı ve yüksek performans, Swift'i kaynak kısıtlı ortamlar ve zorlu uygulamalar için ideal kılar.","threadSafety":"Thread Güvenliği","threadSafetyDescription":"Yerleşik eşzamanlılık desteği, uygulamalarınızın yarış koşulları olmadan birden fazla görevi verimli bir şekilde yönetmesini sağlar.","ourServices":"Zorluklarınızı Nasıl Çözüyoruz","servicesDescription":"Kavramdan lansmana ve ötesine, ihtiyacınız olan uygulamaları, web sitelerini ve entegrasyonları teslim ediyoruz. Zorluğunuzu anlatın—çözümü tasarlıyor, inşa ediyor ve destekliyoruz.","startYourProject":"Projenizi Başlatın","swiftNative":"Native","support":"Destek","possibilities":"Olasılıklar","makingYour":"Fikirlerinizi","ideasReality":"Fikirleri Gerçeğe","swiftSoftwareSpecialists":"Swift Yazılım Uzmanları","swift":"Swift","swiftServer":"Swift-Server","frequentlyAskedQuestions":"Sık Sorulan Sorular","faqDescription":"Yazılım geliştirme hizmetlerimiz hakkında yaygın soruların cevaplarını alın","faqTechnologies":"Hangi teknolojilerde uzmanlaşıyorsunuz?","faqTechnologiesAnswer":"Nuxt, Vue, Vapor ve SwiftNIO dahil olmak üzere geniş bir teknoloji yelpazesinde modern web geliştirme konusunda uzmanlaşıyoruz. Dil uzmanlığımız TypeScript ve Swift'i içerir. Ayrıca yüksek performanslı uygulamalar sunmak için güçlü backend çözümleri, bulut hizmetleri, API'ler ve ölçeklenebilir mimari ile çalışıyoruz.","faqTimeline":"Tipik bir proje ne kadar sürer?","faqTimelineAnswer":"Proje süreleri karmaşıklığa göre değişir. Basit web uygulamaları 4-8 hafta sürerken, karmaşık kurumsal çözümler 3-6 ay sürebilir. Danışmanlık sırasında detaylı zaman çizelgeleri sağlıyoruz.","faqSupport":"Devam eden destek ve bakım sağlıyor musunuz?","faqSupportAnswer":"Evet, uygulamanızın güncel ve güvenli kalmasını sağlamak için 7/24 izleme, düzenli güncellemeler, güvenlik yamaları ve özellik geliştirmeleri içeren kapsamlı destek paketleri sunuyoruz.","faqProcess":"Geliştirme süreciniz nedir?","faqProcessAnswer":"Düzenli müşteri iletişimi, yinelemeli geliştirme ve sürekli test ile işbirlikçi bir yaklaşım izliyoruz. Sürecimiz planlama, tasarım, geliştirme, test ve dağıtım aşamalarını içerir.","faqIntegration":"Mevcut sistemler ve API'ler ile çalışabilir misiniz?","faqIntegrationAnswer":"Kesinlikle! Mevcut sistemler, API'ler ve veritabanları ile entegrasyon konusunda kapsamlı deneyime sahibiz. Mevcut altyapınızı geliştirebilir, modernleştirebilir veya tamamen yeniden inşa edebiliriz.","faqSecurity":"Güvenlik ve veri koruma konusunda ne yapıyorsunuz?","faqSecurityAnswer":"Güvenlik, inşa ettiğimiz her şeyde varsayılandır. Verilerinizi ve kullanıcılarınızın bilgilerini korumak için güvenlik odaklı yazılım geliştirme uygulamaları, endüstri standardı güvenlik önlemleri, veri şifreleme ve düzenli güvenlik denetimleri uyguluyoruz.","consultingTitle":"Zorluklarınız, uzmanlığımız","consultingOverview":"Yeni ürün tanımlıyor, miras sistemleri modernize ediyor veya stack ve mimari seçiyor olun—kararların deneyime dayanması ve hedeflerinizle hizalanması için yapılandırılmış rehberlik sunuyoruz.","consultWithUs":"Girişiminiz hakkında konuşalım","consultingWithUsMessage":"Hedeflerinizi, kısıtlamalarınızı ve zaman çizelgenizi paylaşın. Seçenekler, ödünler ve net bir yol—kapsam, teknoloji ve gerekenler—çizeceğiz.","whatToConsultAbout":"Nelerde yardımcı olabiliriz","architectureDesign":"Mimari ve sistem tasarımı","architectureDesignDescription":"Yeni ve mevcut sistemler için ölçeklenebilir, sürdürülebilir mimariler. Desen, sınır ve entegrasyon yaklaşımları seçiminde yardımcı oluyoruz.","technologySelection":"Teknoloji ve stack seçimi","technologySelectionDescription":"Gereksinimler, ekip becerileri ve uzun vadeli sürdürülebilirlik açısından teknoloji ve tedarikçilerin nesnel değerlendirmesi.","performanceOptimization":"Performans ve ölçeklenebilirlik","performanceOptimizationDescription":"Yanıt süreleri, verim, kaynak kullanımı. Önbellek, yük dengeleme, sorgu optimizasyonu ve kapasite planlaması uyguluyoruz.","securityReview":"Güvenlik ve uyumluluk incelemesi","securityReviewDescription":"Güvenlik duruşu ve uyumluluk hizalaması. Tasarım ve uygulamayı yaygın tehdit ve çerçevelere göre değerlendiriyoruz.","codeReview":"Kod ve uygulama incelemesi","codeReviewDescription":"Kod kalitesi, desen ve teknik borç üzerine uzman incelemesi. Uygulanabilir geri bildirim sağlıyoruz.","bestPractices":"Süreç ve en iyi uygulamalar","bestPracticesDescription":"Geliştirme süreci, DevOps ve teslimat uygulamaları. Öngörülebilirlik, kalite ve ekip verimliliğini artıran iş akışları benimsemenize yardımcı oluyoruz.","trainingProgramsHeader":"Eğitim Programları","trainingProgramsDescription":"Profesyonel gelişim ve eğitim çözümleri","trainingOverview":"Ekibinizin becerilerini geliştirmek için kapsamlı eğitim programları","trainingCourses":"Eğitim Kursları","vueJsDevelopment":"Vue.js Geliştirme","vueJsDevelopmentDescription":"Nuxt ile modern Vue.js geliştirme uygulamalarını öğrenin","swiftBackendDevelopment":"Swift Backend Geliştirme","swiftBackendDevelopmentDescription":"Vapor ve SwiftNIO ile Swift backend geliştirmeyi öğrenin","typescriptDevelopment":"TypeScript Geliştirme","typescriptDevelopmentDescription":"TypeScript ile güçlü uygulamalar oluşturun","securityFirstDevelopment":"Güvenlik Odaklı Geliştirme","securityFirstDevelopmentDescription":"Güvenlik odaklı yazılım geliştirme uygulamalarını uygulayın","productManagementExpertiseHeader":"Ürün yönetimi","productManagementExpertiseDescription":"Vizyon, yol haritası ve teslimatı iş sonuçlarıyla hizalayan yapılandırılmış ürün yönetimi.","productManagementOverview":"Keşif, önceliklendirme ve yaşam döngüsü uygulamalarıyla ürün odaklı organizasyonları destekliyoruz. Gereksinimler ve pazar içgörüsünden UX ve yol haritası planlamasına.","productManagementPoints":"Ana alanlar","requirementsGathering":"Gereksinimler ve keşif","requirementsGatheringDescription":"İşlevsel ve işlevsel olmayan gereksinimlerin yapılandırılmış çıkarımı ve belgelenmesi.","marketResearch":"Pazar ve kullanıcı araştırması","marketResearchDescription":"Kullanıcılar, rakipler ve pazar uyumu hakkında kanıta dayalı anlayış.","userExperienceDesign":"Kullanıcı deneyimi tasarımı","userExperienceDesignDescription":"Kullanıcı merkezli akışlar, bilgi mimarisi, etkileşim tasarımı.","productStrategy":"Ürün stratejisi","productStrategyDescription":"İş hedefleriyle hizalı vizyon, konumlandırma ve yol haritası.","featurePrioritization":"Özellik önceliklendirme","featurePrioritizationDescription":"Çerçeve tabanlı önceliklendirme (değer, çaba, risk). Sırada ne inşa edeceğinize karar vermenize yardımcı oluyoruz.","stakeholderManagement":"Paydaş yönetimi","stakeholderManagementDescription":"İç ve dış paydaşlarla net iletişim, beklentiler ve hizalama.","projectManagementExpertiseHeader":"Proje yönetimi","projectManagementExpertiseDescription":"Yazılım projelerinizin kapsam, takvim ve kalitede kalması için teslimat disiplini.","projectManagementOverview":"Kanıtlanmış PM uygulamaları—planlama, izleme, risk ve kaynak yönetimi—ekip büyüklüğü ve metodolojiye göre uyarlanmış.","projectManagementPoints":"Ana alanlar","projectPlanning":"Proje planlaması","projectPlanningDescription":"Kapsam, kilometre taşları, bağımlılıklar. Net teslim edilebilirler ve zaman çizelgeleri tanımlıyoruz.","resourceManagement":"Kaynak yönetimi","resourceManagementDescription":"Ekipler ve sprint'ler arasında kapasite planlaması ve ataması.","riskManagement":"Risk yönetimi","riskManagementDescription":"Teknik ve proje risklerinin tanımlanması, değerlendirilmesi ve azaltılması.","qualityAssurance":"Kalite güvencesi","qualityAssuranceDescription":"Kalite kapıları, kabul kriterleri, sürüm hazırlığı.","overview":"Genel Bakış","privacyPolicyTitle":"Gizlilik Politikası","effectiveDate":"Yürürlük Tarihi","effectiveDateValue":"10/05/2024","introduction":"Giriş","informationWeDoNotCollect":"Toplamadığımız Bilgiler","informationCollectedByServers":"Sunucular ve Teknolojiler Tarafından Toplanan Bilgiler","legalUse":"Yasal Kullanım","limitationOfLiability":"Sorumluluk Sınırlaması","changesToPolicy":"Bu Gizlilik Politikasındaki Değişiklikler","privacyWelcomeMessage":"NeedleTails.com'a hoş geldiniz. Gizliliğiniz bizim için önemlidir.","privacyPurpose":"Bu Gizlilik Politikası, sitemizi ziyaret ettiğinizde bilgi toplama uygulamalarımızı özetlemektedir.","personalInformation":"Kullanıcılarımızdan herhangi bir kişisel bilgi toplamıyoruz.","informationOverview":"Kişisel bilgi toplamadığımız halde, sunucuların ve diğer teknolojilerin otomatik olarak belirli bilgiler toplayabileceğini lütfen unutmayın.","legalUseOverview":"Sitemizi kullanarak, tüm yerel yasa ve düzenlemelere uymayı kabul ediyorsunuz.","userResponsibility":"Sitenin kullanımının yargı yetkinizde yasal olduğundan emin olmak sizin sorumluluğunuzdadır.","privacyLimitationOverview":"Bu web sitesinin yazarı, Sitenin kullanımınızdan kaynaklanan herhangi bir hasar veya kayıp için sorumlu tutulamaz.","privacyUserAcknowledgment":"Siteyi kullanarak, bunu kendi riskinizle yaptığınızı ve yazarın kullanımınızdan kaynaklanan herhangi bir sonuçtan sorumlu olmadığını kabul ediyorsunuz.","privacyChangesToPolicy":"Gizlilik Politikamızı zaman zaman güncelleyebiliriz. Yeni Gizlilik Politikasını bu sayfada yayınlayarak değişiklikler hakkında sizi bilgilendireceğiz. Herhangi bir değişiklik için bu Gizlilik Politikasını periyodik olarak gözden geçirmeniz önerilir.","cookies":"Çerezler","cookiesDescription":"Kullanıcı deneyimini geliştirmek için çerezler kullanılabilir. Bunlar şunları içerebilir:","sessionCookies":"Oturum Çerezleri: Tarayıcınızı kapattığınızda sona eren geçici çerezler.","persistentCookies":"Kalıcı Çerezler: Cihazınızda belirli bir süre veya silinene kadar kalan çerezler.","analytics":"Analitik","analyticsDescription":"Web sitesi kullanımı hakkında bilgi toplayan üçüncü taraf analitik hizmetleri kullanabiliriz, örneğin:","pageViews":"Sayfa Görüntülemeleri","userInteractions":"Kullanıcı Etkileşimleri","trafficSources":"Trafik Kaynakları","serverLogs":"Sunucu Günlükleri","serverLogsDescription":"Web sunucuları ziyaretiniz hakkında bilgi günlüğe kaydedebilir, örneğin:","ipAddress":"IP Adresi","browserType":"Tarayıcı Türü","operatingSystem":"İşletim Sistemi","referringUrl":"Yönlendiren URL","pagesVisited":"Ziyaret Edilen Sayfalar","timeAndDateOfAccess":"Erişim Zamanı ve Tarihi","termsTitle":"Şartlar ve Koşullar","termsEffectiveDate":"Yürürlük Tarihi: 10/05/2024","userAgreement":"Kullanıcı Sözleşmesi","prohibitedActivities":"Yasaklanan Faaliyetler","changesToTerms":"Bu Şartlardaki Değişiklikler","termsWelcomeMessage":"Şartlar ve Koşullarımıza hoş geldiniz.","termsPurpose":"Bu şartlar hizmetlerimizin kullanımını yönetir.","userAgreementText":"Hizmetlerimizi kullanarak bu şartları kabul ediyorsunuz.","prohibitedActivitiesOverview":"Aşağıdaki faaliyetler yasaktır:","usingServiceForIllegalPurposes":"Hizmeti yasa dışı amaçlar için kullanmak.","engagingInHarassment":"Herhangi bir taciz veya istismar biçiminde bulunmak.","unauthorizedAccess":"Sistemlerimize yetkisiz erişim elde etmeye çalışmak.","distributingMalware":"Zararlı yazılım veya virüs dağıtmak.","termsLimitationOverview":"Dolaylı, tesadüfi veya sonuçsal hasarlardan sorumlu değiliz.","termsUserAcknowledgment":"Hizmetlerimizi kendi riskinizle kullandığınızı kabul ediyorsunuz.","termsChangesToTerms":"Bu şartları zaman zaman güncelleyebiliriz. Lütfen düzenli olarak gözden geçirin.","spineTailedKitTitle":"PQSRTC","spineTailedKitDescription":"PQSRTC, Swift’te yalın bir RTC protokolü sunmayı hedefler ve varsayılan olarak post‑kuantum şifreleme kullanır. WebRTC tabanlı bir SDK olarak, Swift ile yazılmış ortak mantığı kullanarak hem Android hem de Apple platformlarında çalışan ses ve video uygulamaları için modern, güvenli ve yüksek performanslı çözümler sunar.","needleTailKitTitle":"NeedleTailKit","needleTailIRCTitle":"NeedleTailIRC","needleTailIRCDescription":"Swift uygulamaları için modern bir IRC istemci kütüphanesi. NeedleTailIRC, IRC sunucularına bağlanma, kanal yönetimi ve gerçek zamanlı iletişim yönetimi için sağlam, tip güvenli bir arayüz sağlar. Optimal performans için Swift Concurrency ile inşa edilmiştir.","connectionManagerKitTitle":"ConnectionManagerKit","connectionManagerKitDescription":"Swift uygulamaları için kapsamlı bir bağlantı yönetimi çerçevesi. ConnectionManagerKit, ağ bağlantısını, bağlantı havuzlamasını ve bağlantı yaşam döngüsü yönetimini basitleştirir. Güvenilir ağ iletişimi gerektiren uygulamalar için mükemmeldir.","postQuantumSolaceTitle":"PostQuantumSolace","postQuantumSolaceDescription":"Swift uygulamaları için post-kuantum kriptografi kütüphanesi. PostQuantumSolace, kuantum hesaplama dirençli kriptografik algoritmalar ve protokoller sağlar, uygulamalarınızın kuantum hesaplama çağında güvende kalmasını sağlar.","doubleRatchetKitTitle":"DoubleRatchetKit","doubleRatchetKitDescription":"A Swift implementation of the Double Ratchet Algorithm with Post-Quantum X3DH (PQXDH) integration. Provides forward secrecy and post-compromise security for secure messaging—implements the Signal protocol specification with hybrid PQXDH (MLKEM1024 and Curve25519), header encryption, and out-of-order message support. Cross-platform: macOS 15+, iOS 18+, Android, and Linux.","needleTailKitDescription":"NeedleTailKit nedir? NTK, güzel uçtan uca şifreli uygulamalar oluşturmayı sağlayan NeedleTail İstemci ve Sunucu Uygulamalarının temel SDK'sıdır. Mesajlaşma dışındaki çeşitli uygulamalar için kullanılabilir. İlgileniyor musunuz? Daha fazla bilgi için bizimle iletişime geçin!","whiteTippedSocketsTitle":"White Tipped Sockets","whiteTippedSocketsDescription":"WhiteTippedSockets, Swift Concurrency kullanarak Network.framework API üzerine inşa edilmiş iOS ve macOS için yerel bir WebSocket kütüphanesidir. Amacımız WebSocket iletişimi için modern, verimli bir çözüm sunmak ve gelecekte tam işlevsel, ölçeklenebilir bir sunucu geliştirmeyi de planlıyoruz.","swiftHlsTitle":"Swift HLS","swiftHlsDescription":"HTTP Live Streaming (HLS), verimli medya akışı için önemli bir teknolojidir ve SwiftHLS bunu kolaylaştırmak için tasarlanmıştır. Web'i güçlendiren aynı protokolü kullanarak, HLS REST API'leri ve CDN'ler aracılığıyla içerik dağıtımına izin verir. Amacı güvenilirlik sağlamak ve ağ koşullarına dinamik olarak uyum sağlamaktır.","swiftIapTitle":"Swift IAP","swiftIapDescription":"SwiftIAP, iOS ve macOS uygulamaları için kapsamlı bir Uygulama İçi Satın Alma kütüphanesidir. Uygulama içi satın almaları, abonelikleri ve makbuz doğrulamasını işlemek için modern, tip güvenli bir arayüz sağlar. Swift Concurrency ile oluşturulmuş ve kullanım kolaylığı için tasarlanmıştır.","stompTitle":"Stomp","stompDescription":"Stomp, STOMP protokolü iletişimi için bir Swift kütüphanesidir. STOMP sunucularına bağlanmak ve mesaj yönlendirmeyi işlemek için modern, tip güvenli bir arayüz sağlar. Güvenilir mesajlaşma altyapısına ihtiyaç duyan uygulamalar için mükemmeldir.","privacy":"Gizlilik Politikası","termsConditions":"Şartlar ve Koşullar","projectTitle_1":"Projeler","projectHeader_1":"PQSRTC","projectTitleText_1":"RTC VoIP Çözümü","projectTitle_2":"Projeler","projectHeader_2":"NeedleTailKit","projectTitleText_2":"Uçtan Uca Şifreli Mesajlaşma Çözümü","projectTitle_3":"Projeler","projectHeader_3":"White Tipped Sockets","projectTitleText_3":"Swift Concurrent Network.framework Sarmalayıcısı","projectTitle_4":"Projeler","projectHeader_4":"Swift Stomp","projectTitleText_4":"Swift Concurrent STOMP Protokolü","projectTitle_5":"Projeler","projectHeader_5":"Swift HLS","projectTitleText_5":"Swift HLS Projesi","pageNotFound":"Sayfa Bulunamadı","pageNotFoundDescription":"Aradığınız sayfa mevcut değil veya taşınmış. Sizi tekrar yola çıkaralım.","goHome":"Ana Sayfaya Git","goBack":"Geri Git","contact":"İletişim","contactUs":"Bizimle İletişime Geçin","becomeASponsor":"Sponsor Olun","supportOpenSourceMessage":"Açık kaynak projelerimizi destekleyin ve harika yazılımlar geliştirmeye devam etmemize yardımcı olun.","getStartedOnDigitalOcean":"Yeni kullanıcılar için 100$'lık 60 günlük kredi ile Digital Ocean'da başlayın.","readyToGetStarted":"Başlamaya Hazır mısınız?","letsDiscussProject":"Projenizi tartışalım ve Swift destekli çözümlerle fikirlerinizi hayata geçirmenize nasıl yardımcı olabileceğimizi görelim.","backToTop":"Yukarı Çık","needleTailsCopyright":"NeedleTails©","pointsForConsideration":"Dikkat Edilecek Noktalar","responsiveDesign":"Responsive ve uyarlanabilir tasarım","responsiveDesignDescription":"Tüm görünüm alanlarına ve cihazlara uyum sağlayan düzenler ve bileşenler.","crossBrowserCompatibility":"Tarayıcılar arası ve standart uyumluluğu","crossBrowserCompatibilityDescription":"Ana tarayıcılar ve standartlar üzerinde test ve uyumluluk.","webPerformanceOptimizationDescription":"Performans bütçeleri, tembel yükleme, optimize varlıklar. Verimli kod, önbellek ve CDN stratejileriyle yükleme sürelerini ve kaynak kullanımını en aza indiriyoruz.","userExperience":"Kullanıcı deneyimi ve erişilebilirlik","userExperienceDescription":"Net bilgi mimarisi, sezgisel gezinme, WCAG erişilebilirlik.","securityPractices":"Güvenlik ve veri koruma","securityPracticesDescription":"HTTPS, güvenli başlıklar, giriş doğrulama, OWASP üst risklere (XSS, CSRF) karşı koruma.","seoBestPractices":"SEO ve keşfedilebilirlik","seoBestPracticesDescription":"Anlamsal yapı, meta etiketler, arama en iyi uygulamalarına uyumlu içerik stratejisi.","backendSolutionsHeader":"Sunucu tarafı çözümler","backendSolutionsDescription":"İşinizi güçlendiren üretim düzeyinde backend'ler tasarlıyor ve teslim ediyoruz. Sunucu öncelikli yaklaşımımız API'lerin, veri boru hatlarının ve entegrasyonların güvenilirlik, uyumluluk ve ölçek için inşa edilmesini sağlar.","backendCapabilitiesOverview":"Sunucu tarafı uygulamamız Swift (Vapor, Hummingbird, SwiftNIO) ve kanıtlanmış bulut yerel desenlere dayanır. Güvenli, yüksek performanslı backend'ler—REST ve özel API'ler, olay güdümlü sistemler, mevcut stack'inizle sorunsuz entegrasyon—sunuyoruz.","scalability":"Ölçeklenebilirlik ve dayanıklılık","scalabilityDescription":"Büyüme için tasarlanmış mimariler: yatay ölçekleme, durumsuz hizmetler, dayanıklı desenler.","security":"Güvenlik ve uyumluluk","securityDescription":"Varsayılan sağlam güvenlik: bekleyen ve aktarımda şifreleme, kimlik ve erişim kontrolü, denetim izleri, yaygın uyumluluk çerçeveleriyle hizalama.","maintainability":"Sürdürülebilirlik ve standartlar","maintainabilityDescription":"Tutarlı desenler ve sürüm kontrolüyle temiz, modüler ve iyi belgelenmiş kod tabanları.","testingAndQualityAssurance":"Test ve kalite güvencesi","testingAndQualityAssuranceDescription":"Sıkı test stratejileri: birim, entegrasyon ve sözleşme testleri, CI/CD otomasyonu.","monitoringAndLogging":"İzleme ve gözlemlenebilirlik","monitoringAndLoggingDescription":"Üretim hazır gözlemlenebilirlik: yapılandırılmış günlük, metrikler, uyarılar. Sağlık, performans ve olaylara net görünürlük için backend'leri enstrümante ediyoruz.","nativeAppDevelopmentHeader":"Yerel uygulama geliştirme","nativeAppDevelopmentDescription":"Performans, güvenlik ve harika kullanıcı deneyimi için inşa edilmiş yerel uygulamaları işinizin gerektirdiği her platformda sunuyoruz.","nativeAppDevelopmentOverview":"Tüm Apple ekosistemi (iOS, iPadOS, macOS, tvOS, watchOS, visionOS) ve Android için üretim hazır yerel uygulamalar inşa ediyoruz. Tip güvenli Swift ve Kotlin/Java, platforma uygun UX, erişilebilirlik ve güvenlik odaklı tasarım vurgulanır.","designConsistency":"Tasarım sistemleri ve tutarlılık","designConsistencyDescription":"Tüm platformlarda birleşik tasarım sistemleri ve bileşen kütüphaneleri.","deviceFragmentation":"Cihaz ve platform kapsamı","deviceFragmentationDescription":"Cihaz matrisleri, ekran boyutları ve OS sürümleri üzerinde yapılandırılmış testler.","userExperienceUX":"Kullanıcı deneyimi ve erişilebilirlik","userExperienceUXDescription":"Sezgisel akışlar, net bilgi mimarisi, WCAG erişilebilirlik.","distributionCompliance":"Dağıtım ve mağaza uyumluluğu","distributionComplianceDescription":"App Store ve Play Store hazırlığı: yönergeler, gizlilik etiketleri, inceleme en iyi uygulamaları.","webDevelopmentExpertiseHeader":"Web uygulaması geliştirme","webDevelopmentExpertiseDescription":"İş hedeflerinizi destekleyen web uygulamaları inşa ediyor ve sürdürüyoruz—pazarlama siteleri ve portallardan mevcut sistemlerinizle entegre tam yığın web uygulamalarına.","webDevelopmentOverview":"Üretim düzeyinde web deneyimleri sunuyoruz: Vue.js, Nuxt ve TypeScript ön uç, Vapor, Hummingbird veya tercih ettiğiniz backend ile responsive siteler, SPA'lar ve tam yığın uygulamalar.","solutionsTitle":"Çözümlerimiz","featuredApplications":"Öne Çıkan Uygulamalar","our":"Bizim","featuredApps":"Öne Çıkan Uygulamalar","featuredAppsDescription":"Swift geliştirme ve modern yazılım mimarisinin gücünü gösteren yenilikçi uygulamalarımızı keşfedin.","nudgeTitle":"Kontrolünüzde güvenli mesajlaşma","nudgeDescription":"İsteğe bağlı self-hosting ile uçtan uca şifreli mesajlaşma. Verileriniz sizin—üçüncü taraf depolama yok, kalıcılık riski yok. Kendi örneğinizi çalıştırın veya küresel ölçeklendirin.","islandHoppersTitle":"Island Hoppers: Sorunsuz Maceralar için Nihai Tur Uygulamanız!","islandHoppersDescription":"Island Hoppers, unutulmaz turlar düzenleyen bir şirket olsun veya mükemmel kaçamak arayan bir müşteri olsun, seyahat deneyiminizi geliştirmek için tasarlanmış all-in-one uygulamadır. Şirketler için uygulamamız tüm tur yönetim sürecini optimize eder. Turlarınızı zahmetsizce organize edin ve özelleştirin, tur rehberleriyle doğrudan iletişim kurun ve müşterilerinizi gerçek zamanlı güncellemelerle bilgilendirin. Island Hoppers ile rezervasyonları yönetebilir, müşteri tercihlerini takip edebilir ve her detayın halledildiğinden emin olabilirsiniz, böylece olağanüstü deneyimler sunmaya odaklanabilirsiniz. Müşteriler için Island Hoppers, aileler, sırt çantalı gezginler ve parti meraklıları dahil olmak üzere çeşitli grup türlerine uyarlanmış çeşitli tur paketleri sunar. Küratörlü macera seçimimizi gözden geçirin, tarzınıza uygun mükemmel paketi seçin ve benzer düşünen gezginlerle bağlantı kurun. Tur rehberlerinizle sorunsuz iletişimin keyfini çıkarın, temel bilgilere erişin ve yolculuğunuzdan en iyi şekilde yararlanmak için kişiselleştirilmiş öneriler alın. Island Hoppers ile, turunuzun her yönünün sadece bir dokunuş uzaklıkta olduğunu bilerek kolaylık ve güvenle unutulmaz maceralara çıkın!","streamStackTitle":"Yazılım Çözümleriniz için Eğitim Platformu","streamStackDescription":"Akış, Oku, Tartış. İster programlamaya yeni olun ister farklı yazılım çözümleri hakkında okumak isteyin, Vapor destekli Nuxt uygulamamızla sizin için kolaylaştırıyoruz. En son kodlama trendlerini takip edin.","welcomeToNeedleTails":"NeedleTails'e Hoş Geldiniz - Yazılım Geliştirme Müttefikiniz","accept":"Kabul ediyorum ve kabul ediyorum","cookieConsentTitle":"Tarayıcı depolaması kullanıyoruz","cookieConsentMessage":"Dil tercihinizi hatırlamak ve gezinme deneyiminizi geliştirmek için tarayıcı depolaması kullanıyoruz. 'Tümünü Kabul Et'e tıklayarak tarayıcı depolaması kullanımımızı kabul etmiş olursunuz.","cookieConsentAcceptAll":"Tümünü Kabul Et","cookieConsentAcceptNecessary":"Sadece Gerekli","cookieConsentReject":"Tümünü Reddet","cookieConsentLearnMore":"Daha Fazla Bilgi","cookieConsentNecessary":"Gerekli depolama, tercih ettiğiniz dilde içerik sağlamak için dil algılamasını içerir.","cookieConsentAnalytics":"Şu anda bu web sitesinde analitik takibi kullanmıyoruz.","cookieConsentPreferences":"Tercih depolaması, deneyiminizi kişiselleştirmek için tema ve kullanıcı tercihleri gibi ayarlarınızı hatırlar.","cookieConsentMarketing":"Şu anda bu web sitesinde pazarlama takibi veya reklam kullanmıyoruz.","brewhubWidgetTitle":"BrewHub","brewhubWidgetDescription":"Profesyonel yazılım geliştirme kursları ve eğitim platformu. Geliştirme becerilerinizi geliştirmek için üretim seviyesi araçlar ve iş akışlarıyla rehberli, canlı eğitime erişin.","brewhubWidgetCTA":"Eğitim Kursları","brewhubComingSoonTitle":"Mevcut","brewhubComingSoonDescription":"BrewHub artık kullanılabilir. Profesyonel yazılım geliştirme kursları ve eğitim için brewhub.needletails.com adresini ziyaret edin.","brewhubFeature1Title":"Uzman Kurslar","brewhubFeature1Description":"Sektör uzmanları tarafından verilen profesyonel yazılım geliştirme kurslarına erişin.","brewhubFeature2Title":"Canlı Eğitim","brewhubFeature2Description":"Uzman rehberliğinde bire bir veya küçük grup canlı eğitimi.","brewhubFeature3Title":"Topluluk","brewhubFeature3Description":"Bir geliştirici topluluğuna katılın ve birlikte öğrenin.","brewhubFeature4Title":"Üretim Araçları","brewhubFeature4Description":"Üretim ortamlarında kullanılan aynı araç ve iş akışlarıyla öğrenin.","brewhubBackToMainSite":"BrewHub'a Git","brewhubMetaTitle":"BrewHub | NeedleTails","brewhubMetaDescription":"BrewHub, NeedleTails'in profesyonel yazılım geliştirme kursları ve eğitim platformudur.","brewhubOgDescription":"Profesyonel yazılım geliştirme kursları ve eğitim platformu.","brewhubLogoAlt":"BrewHub Logosu","needletailKitTitle":"NeedleTailKit","needletailKitSubtitle":"Kurumsal düzeyde güvenlik özelliklerine sahip güvenli, uçtan uca şifreli mesajlaşma uygulamaları oluşturmak için kapsamlı, üretime hazır bir Swift SDK.","needletailKitPrivateBadge":"Özel SDK - Lisans Gerekli","needletailKitRequestLicense":"Lisans İste","needletailKitExploreFeatures":"Özellikleri Keşfet","needletailKitFeaturesTitle":"Kurumsal Düzeyde Özellikler","needletailKitFeaturesDescription":"En son teknoloji güvenlik ve modern Swift mimarisi ile üretim için inşa edilmiştir.","needletailKitSecurityTitle":"Kurumsal Güvenlik","needletailKitSecurityPQ":"Post-Kuantum Kriptografi - Kuantum saldırılarına karşı gelecek güvencesi","needletailKitSecurityDoubleRatchet":"Double Ratchet Protokolü - Mükemmel ileri gizlilik","needletailKitSecurityE2E":"Uçtan Uca Şifreleme - Tüm mesajlar varsayılan olarak şifrelenir","needletailKitSecurityDeviceVerification":"Cihaz Doğrulama - Kriptografik cihaz bağlantısı","needletailKitPlatformTitle":"Çoklu Platform Desteği","needletailKitPlatformIOS":"iOS 18.0+ - Tam yerel iOS desteği","needletailKitPlatformMacOS":"macOS 15.0+ - Tam macOS entegrasyonu","needletailKitPlatformSwift6":"Swift 6.0+ - En son dil özellikleri","needletailKitPlatformAsync":"Async/Await - Her yerde modern eşzamanlılık","needletailKitTransportTitle":"Akıllı Taşıma","needletailKitTransportMulti":"Çoklu Taşıma Yönlendirme - Otomatik yol seçimi","needletailKitTransportP2P":"Yerel Ağ P2P - Doğrudan cihaz iletişimi","needletailKitTransportDCC":"DCC Protokolü - TLS ile IRC tabanlı P2P","needletailKitTransportFailover":"Otomatik Yedekleme - Kesintisiz taşıma değişimi","needletailKitMessagingTitle":"Zengin Mesajlaşma","needletailKitMessagingText":"Metin Mesajları - Basit, güvenli iletişim","needletailKitMessagingMedia":"Medya Mesajları - Görüntüler, videolar, belgeler","needletailKitMessagingSelfDestruct":"Kendini Yok Eden Mesajlar - Geçici destek","needletailKitMessagingEdit":"Mesaj Düzenleme - Gönderilen mesajları düzenleme","needletailKitVoiceVideoTitle":"Ses ve Görüntülü Aramalar","needletailKitVoiceVideoWebRTC":"WebRTC Entegrasyonu - Yüksek kaliteli aramalar","needletailKitVoiceVideoSTUN":"STUN/TURN Desteği - NAT geçişi","needletailKitVoiceVideoCallManagement":"Arama Yönetimi - Tam yaşam döngüsü işleme","needletailKitEnterpriseTitle":"Kurumsal Hazır","needletailKitEnterpriseProduction":"Üretime Hazır - Gerçek uygulamalarda test edilmiştir","needletailKitEnterpriseSupport":"Kurumsal Destek - Profesyonel destek mevcuttur","needletailKitEnterpriseCompliance":"Uyumluluk - Düzenleyici uyumluluk için inşa edilmiştir","needletailKitEnterpriseScalability":"Ölçeklenebilirlik - Büyük ölçekli dağıtımlar için tasarlanmıştır","needletailKitQuickStartTitle":"Quick Start","needletailKitQuickStartDescription":"Get started with NeedleTailKit in minutes. Follow these simple steps to integrate secure messaging into your application.","needletailKitInstallTitle":"Installation","needletailKitInstallCode":"dependencies: [\n    .package(url: \"https://github.com/needletails/needle-tail-kit.git\", from: \"1.0.0\")\n]","needletailKitInitializeTitle":"Initialize Session","needletailKitInitializeCode":"import NeedleTailKit\n\nlet session = NeedleTailSession.shared\ntry await session.createNewUserAccount(\n    authInfo: authInfo,\n    store: store,\n    eventObserver: eventObserver\n)","needletailKitSendMessageTitle":"Send Your First Message","needletailKitSendMessageCode":"let contact = try await session.createContact(contact: \"bob\")\ntry await session.sendMessage(\n    messageType: .text,\n    recipient: .nickname(\"bob\"),\n    text: \"Hello, World!\"\n)","needletailKitContactTitle":"Lisans İste","needletailKitContactDescription":"NeedleTailKit, özel mülkiyetli, kapalı kaynak bir SDK'dır. Projeniz için lisanslama seçeneklerini görüşmek üzere bizimle iletişime geçin.","needletailKitContactButton":"Lisans İçin İletişime Geç","needletailKitMetaTitle":"NeedleTailKit - Kurumsal Güvenli Mesajlaşma SDK | NeedleTails","needletailKitMetaDescription":"Güvenli, uçtan uca şifreli mesajlaşma uygulamaları oluşturmak için üretime hazır Swift SDK. Post-kuantum kriptografi, çoklu platform desteği ve kurumsal düzeyde güvenlik.","needletailKitOgDescription":"Kurumsal düzeyde güvenlik özelliklerine sahip güvenli mesajlaşma için üretime hazır Swift SDK.","needletailKitLogoAlt":"NeedleTailKit Logosu","needletailKitPlatformAndroid":"Android: API 24 (Android 7.0) veya üzeri","nudgeWidgetTitle":"Nudge ile Güvenli","nudgeWidgetDescription":"İsteğe bağlı kendi kendini izleyen, uçtan uca şifreli mesajlaşma, tam veri kontrolü.","nudgeWidgetCTA":"Daha Fazla Bilgi","nudgeWidgetLogoAlt":"Nudge Logosu","nudgeFeature1Title":"Uçtan uca şifreleme","nudgeFeature1Description":"Her mesaj varsayılan olarak şifrelenir. Tam gizlilik.","nudgeFeature2Title":"Verileriniz, kurallarınız","nudgeFeature2Description":"İsteğe bağlı self-hosting. Harici veri depolama yok.","nudgeFeature3Title":"Güvenli kanallar","nudgeFeature3Description":"Güvenlik için inşa edilmiş özel mesajlaşma.","nudgeFeature4Title":"Küresel veya self-hosted","nudgeFeature4Description":"Küresel ölçeklendirin veya kendi örneğinizi çalıştırın—veri kalıcılığı riski yok.","nudgeContactButton":"Nudge'u İncele","nudgeMetaTitle":"Nudge - Güvenli Uçtan Uca Şifreli Mesajlaşma | NeedleTails","nudgeMetaDescription":"İsteğe bağlı kendi kendini izleyen, uçtan uca şifreli mesajlaşma uygulaması, tam veri kontrolü. Veri kalıcılığı riski olmadan güvenli iletişim.","nudgeOgDescription":"İsteğe bağlı kendi kendini izleyen, uçtan uca şifreli mesajlaşma, tam veri kontrolü ve kurumsal düzeyde güvenlik.","nudgeMetaKeywords":"Nudge, güvenli mesajlaşma, uçtan uca şifreleme, şifreli mesajlaşma uygulaması, isteğe bağlı kendi kendini izleyen mesajlaşma, özel mesajlaşma, güvenli iletişim, veri gizliliği, mesajlaşma güvenliği, şifreli sohbet, güvenli sohbet uygulaması, gizlilik odaklı mesajlaşma","brewhubMetaKeywords":"BrewHub, yazılım geliştirme kursları, programlama kursları, geliştirici eğitimi, yazılım eğitimi, kodlama kursları, geliştirme eğitimleri, teknik eğitim, yazılım öğrenme platformu, programlama eğitimleri, web geliştirme kursları, mobil geliştirme kursları, backend geliştirme eğitimi","needletailKitMetaKeywords":"NeedleTailKit, Swift SDK, uçtan uca şifreleme, güvenli mesajlaşma, iOS SDK, macOS SDK, Android SDK, kuantum sonrası kriptografi","heroTagline":"Zorluklarınızı çözüyoruz—uygulamalar, web siteleri ve entegre yazılım çözümleri.","managementPageLabel":"Yönetim","managementPageTitle":"Ürün ve Proje Teslimatı","managementPageLead":"Vizyon, yol haritası ve uygulamayı hizalayarak yazılım projelerinizin kapsam, takvim ve kalitede kalmasını sağlıyoruz.","managementCtaLead":"Sonraki projenizi hizalamaya hazır mısınız?","consultationPageLabel":"Danışmanlık","consultationCtaLead":"Hedeflerinizi anlatın—net bir yol çizeceğiz.","costSavingsBadge":"Tasarruf","costSavingsHeadline":"Sunucu Maliyetlerinden Tasarruf","costSavingsIntro":"Üretimde bir backend çalıştırırken runtime seçiminiz hesaplama maliyetini doğrudan etkiler. Sunucu tarafı Swift (Vapor, Hummingbird, SwiftNIO) birçok popüler runtime'a göre tipik olarak daha az bellek kullanır ve çekirdek başına daha fazla istek sunar. Aynı trafiği daha küçük veya daha az örnekle sunabilir—güvenilirlikten ödün vermeden bulut faturanız düşer.","costSavingsSubhead":"Aynı iş yükü: tek küçük sunucuda ayda yaklaşık 1–2 milyon istek sunan tipik bir API.","costSavingsColRuntime":"Teknoloji","costSavingsColMemory":"Bellek kullanımı","costSavingsColThroughput":"Trafik kapasitesi","costSavingsColMonthlyCost":"Tahmini aylık sunucu maliyeti","costSavingsSwift":"Swift (Vapor / SwiftNIO)","costSavingsSwiftMemory":"Çok düşük (30–80 MB). Orta trafik için tek küçük sunucu çoğu zaman yeterlidir.","costSavingsSwiftThroughput":"Yüksek. Tek sunucu ağır trafiği kaldırır; ölçeklemek için daha az sunucu gerekir.","costSavingsSwiftCost":"12–24 $/ay (en küçük örnekler çoğu zaman yeterli)","costSavingsNode":"Node.js","costSavingsNodeMemory":"Orta (işlem başına 80–150 MB). Genelde sunucu boyutunda bir üst kademe gerekir.","costSavingsNodeThroughput":"İyi. Tek sunucu sağlam trafiği kaldırır; trafik artınca daha fazla sunucu gerekebilir.","costSavingsNodeCost":"24–48 $/ay","costSavingsPython":"Python (örn. FastAPI)","costSavingsPythonMemory":"Daha yüksek (worker başına 100–250 MB). Birden fazla worker için genelde daha fazla RAM gerekir.","costSavingsPythonThroughput":"Birden fazla worker ile iyi. Aynı trafik için genelde daha fazla veya daha büyük sunucu gerekir.","costSavingsPythonCost":"24–48 $/ay (birkaç worker)","costSavingsJava":"Java (örn. Spring Boot)","costSavingsJavaMemory":"En yüksek (tipik 200–500 MB). Genelde baştan daha büyük sunucu gerekir.","costSavingsJavaThroughput":"Çalışınca iyi. Daha yüksek taban bellek, aynı trafikte daha büyük sunucu demektir.","costSavingsJavaCost":"48–96 $/ay (daha büyük örnek tipik)","costSavingsDisclaimer":"Gerçek rakamlar uygulamanıza, trafiğe, veritabanı kullanımına ve bulut sağlayıcıya bağlıdır. Bu rakamlar örnektir; iş yükünüz için maliyet tahmini konusunda yardımcı olabiliriz.","costSavingsCta":"Daha az maliyetle çalışan backend'ler için bizimle çalışın.","costSavingsWhyItMatters":"Bir yıl boyunca daha verimli bir runtime seçmek, aynı iş yükünde sunucu faturanızı yüzlerce veya binlerce dolar azaltabilir. Aşağıdaki karşılaştırma, tek bir küçük bulut örneğinde ayda yaklaşık 1–2 milyon istek sunan basit bir JSON API için gerçekçi bir büyüklük sırasıdır.","costSavingsTableHowToRead":"Bellek kullanımı ne kadar büyük bir sunucuya ihtiyacınız olduğunu belirler. Trafik kapasitesi bir sunucunun kaldırabileceği istek sayısıdır. Düşük bellek + yüksek kapasite genelde aynı trafikte daha düşük aylık fatura demektir.","costSavingsColMemoryHelp":"Minimum sunucu boyutunu belirler; düşük = daha küçük/ucuz sunucu","costSavingsColThroughputHelp":"Bir sunucunun kaldırabileceği trafik; yüksek = daha az sunucu gerekir","costSavingsProductionHeadline":"Üretim ölçeğinde backend'ler nasıl görünür","costSavingsProductionIntro":"Farklı ürün türleri farklı sunucu profilleri gerektirir. Aşağıdaki tablo ölçekte tipik iş yükü türlerini—ve verimli bir runtime'ın (sunucu tarafı Swift gibi) maliyetleri nasıl düşürüp operasyonları nasıl sadeleştirebileceğini gösterir. Belirli ürün adı verilmez.","costSavingsProductionColWorkload":"İş yükü türü","costSavingsProductionColNeeds":"Tipik ölçek ve ihtiyaçlar","costSavingsProductionColWhy":"Sunucu verimliliği neden önemli","costSavingsProductionEnterprise":"Kurumsal ve kurumsal web siteleri","costSavingsProductionEnterpriseNeeds":"Orta–yüksek trafik; güvenilirlik, uyumluluk, çalışma süresi. API'ler, içerik, entegrasyonlar.","costSavingsProductionEnterpriseWhy":"İstek başına daha düşük maliyet; aynı kapasite için daha küçük filo. Trafik artarken öngörülebilir faturalar.","costSavingsProductionMessaging":"Güvenli mesajlaşma ve gerçek zamanlı sohbet","costSavingsProductionMessagingNeeds":"Gerçek zamanlı teslimat, uçtan uca şifreleme, yüksek eşzamanlılık. Sunucu başına çok bağlantı.","costSavingsProductionMessagingWhy":"Bağlantı başına düşük bellek; çekirdek başına yüksek verim. Milyonlarca kullanıcı için daha az sunucu.","costSavingsProductionVideo":"Video konferans ve gerçek zamanlı medya","costSavingsProductionVideoNeeds":"Sinyal, kontrol düzlemleri, koordinasyon. Medya özel altyapı kullanabilir; API'ler yine de ölçeklenmeli.","costSavingsProductionVideoWhy":"Verimli sinyal ve API katmanları maliyeti düşürür. Kontrol trafiği için sunucu başına daha fazla kapasite.","costSavingsProductionSocial":"Sosyal ve içerik platformları","costSavingsProductionSocialNeeds":"Çok yüksek istek hacmi, akışlar, medya meta verileri, küresel dağıtım. İstek başına maliyet birikir.","costSavingsProductionSocialWhy":"Yüksek verim ve düşük bellek milyon istek başına maliyeti düşürür. Ölçekte daha küçük filo."}}