{
  "introHeaderTwo": "Sie haben die Vision; wir liefern die Lösung. Ob mobile App, moderne Website oder vollständiges Software-System—wir verwandeln Ihre Herausforderungen in zuverlässige, sichere Produkte. Mit Enterprise-Erfahrung in Mobile, Web und Server bauen und integrieren wir Lösungen, die skalieren—damit Sie sich auf Ihr Geschäft konzentrieren können.",
  "menuItemOne": "Kurse",
  "menuItemTwo": "Beratung",
  "menuItemThree": "Management",
  "getInTouch": "Kontakt aufnehmen",
  "projectsHeader": "Unsere Software",
  "projectsDescription": "Wir widmen uns der Bereitstellung einer breiten Palette von Open-Source-Software. Um diese Mission zu unterstützen, bieten wir auch einige Closed-Source-Software an. Wir laden Sie ein, unsere Projekte zu erkunden, die sowohl Open-Source- als auch Closed-Source-Optionen umfassen. Wenn Sie daran interessiert sind, zu unseren Closed-Source-Projekten beizutragen oder eine Lizenz zu erhalten, zögern Sie bitte nicht, sich mit uns in Verbindung zu setzen.",
  "projectsOverview": "Hier ist eine Liste dessen, was wir tun und was wir getan haben",
  "businessOverviewTitle": "Swift-Software-Spezialisten",
  "badgeMobile": "Mobil",
  "badgeWeb": "Web",
  "badgeServer": "Server",
  "businessOverviewDescription": "Wir verwandeln Ihre kniffligsten Software-Herausforderungen in produktionsreife Lösungen. Ob neue App, moderne Website oder nahtlos integrierte Systeme—wir liefern in Mobile, Web und Server, in der passenden Sprache für Ihr Projekt. Unsere Swift-Expertise bringt Typsicherheit, Performance und Zuverlässigkeit; wir integrieren uns auch in Ihren bestehenden Stack. Partner mit uns für Lösungen, die halten und mit Ihrem Business skalieren.",
  "serviceHeaderBackendDevelopment": "Backend & APIs",
  "serviceDescriptionBackendDevelopment": "Lösen Sie Skalierungs- und Integrationsherausforderungen mit robusten Server-Lösungen. Wir bauen und verbinden APIs, Datenbanken und Dienste, damit Ihre Apps und Websites zuverlässig in jedem Maßstab laufen.",
  "serviceHeaderMobileAppDevelopment": "Mobile Apps",
  "serviceDescriptionMobileAppDevelopment": "Eine native App, die Nutzer lieben. Wir bauen iOS-, Android- und plattformübergreifende Apps, die echte Probleme lösen—pünktlich und store-ready.",
  "serviceHeaderTraining": "BrewHub",
  "serviceDescriptionTraining": "Qualifizieren Sie Ihr Team mit professionellen Software-Entwicklungskursen. Geführte Live-Schulung mit Production-Tooling, damit Sie Lösungen intern bauen und warten können.",
  "serviceHeaderWebDevelopment": "Web-Entwicklung",
  "serviceDescriptionWebDevelopment": "Websites und Web-Apps, die überall funktionieren. Wir liefern responsive, schnelle und sichere Erlebnisse, die Nutzer anziehen und Ihre Geschäftsziele unterstützen.",
  "openSourceHeader": "Open Source",
  "openSourceDescription": "Wir glauben an die Kraft von Open Source. Erkunden Sie unsere Projekte auf GitHub und tragen Sie zur Community bei. Ihre Unterstützung hilft uns dabei, innovative Lösungen weiterzuentwickeln.",
  "whyChooseSwift": "Warum Swift wählen?",
  "typeSafety": "Typsicherheit",
  "typeSafetyDescription": "Swifts Typsystem verhindert Fehler zur Kompilierzeit und stellt sicher, dass Ihre Anwendungen von Anfang an robust und zuverlässig sind.",
  "performance": "Leistung",
  "performanceDescription": "Geringer Speicherverbrauch und hohe Leistung machen Swift ideal für ressourcenbeschränkte Umgebungen und anspruchsvolle Anwendungen.",
  "threadSafety": "Thread-Sicherheit",
  "threadSafetyDescription": "Integrierte Nebenläufigkeitsunterstützung stellt sicher, dass Ihre Anwendungen mehrere Aufgaben effizient ohne Race Conditions bewältigen.",
  "ourServices": "Wie wir Ihre Herausforderungen lösen",
  "servicesDescription": "Von der Idee bis zum Launch und darüber hinaus liefern wir die Apps, Websites und Integrationen, die Sie brauchen. Schildern Sie uns Ihre Herausforderung—wir entwerfen, bauen und unterstützen die Lösung.",
  "startYourProject": "Starten Sie Ihr Projekt",
  "swiftNative": "Native",
  "support": "Unterstützung",
  "possibilities": "Möglichkeiten",
  "makingYour": "Ihre",
  "ideasReality": "Ideen in die Tat",
  "swiftSoftwareSpecialists": "Swift-Software-Spezialisten",
  "swift": "Swift",
  "swiftServer": "Swift-Server",
  "frequentlyAskedQuestions": "Häufig gestellte Fragen",
  "faqDescription": "Erhalten Sie Antworten auf häufige Fragen zu unseren Softwareentwicklungsdienstleistungen",
  "faqTechnologies": "Welche Technologien sind Ihre Spezialität?",
  "faqTechnologiesAnswer": "Wir sind auf moderne Webentwicklung mit einer breiten Palette von Technologien spezialisiert, einschließlich, aber nicht beschränkt auf Nuxt, Vue, Vapor und SwiftNIO. Unsere Sprachkenntnisse umfassen TypeScript und Swift. Wir arbeiten auch mit robusten Backend-Lösungen, Cloud-Services, APIs und skalierbarer Architektur, um hochleistungsfähige Anwendungen zu liefern.",
  "faqTimeline": "Wie lange dauert ein typisches Projekt?",
  "faqTimelineAnswer": "Projektzeitpläne variieren je nach Komplexität. Einfache Webanwendungen dauern 4-8 Wochen, während komplexe Enterprise-Lösungen 3-6 Monate dauern können. Wir stellen detaillierte Zeitpläne während der Beratung bereit.",
  "faqSupport": "Bieten Sie laufende Unterstützung und Wartung?",
  "faqSupportAnswer": "Ja, wir bieten umfassende Support-Pakete einschließlich 24/7-Überwachung, regelmäßiger Updates, Sicherheitspatches und Funktionsverbesserungen, um sicherzustellen, dass Ihre Anwendung aktuell und sicher bleibt.",
  "faqProcess": "Wie ist Ihr Entwicklungsprozess?",
  "faqProcessAnswer": "Wir folgen einem kollaborativen Ansatz mit regelmäßiger Kundenkommunikation, iterativer Entwicklung und kontinuierlichem Testing. Unser Prozess umfasst Planungs-, Design-, Entwicklungs-, Test- und Bereitstellungsphasen.",
  "faqIntegration": "Können Sie mit bestehenden Systemen und APIs arbeiten?",
  "faqIntegrationAnswer": "Absolut! Wir haben umfangreiche Erfahrung in der Integration mit bestehenden Systemen, APIs und Datenbanken. Wir können Ihre aktuelle Infrastruktur erweitern, modernisieren oder komplett neu aufbauen.",
  "faqSecurity": "Was ist mit Sicherheit und Datenschutz?",
  "faqSecurityAnswer": "Sicherheit ist Standard in allem, was wir bauen. Wir implementieren sicherheitsorientierte Softwareentwicklungspraktiken, branchenübliche Sicherheitsmaßnahmen, Datenverschlüsselung und regelmäßige Sicherheitsaudits, um Ihre Daten und die Informationen Ihrer Benutzer zu schützen.",
  "consultingTitle": "Your Challenges, Our Expertise",
  "consultingOverview": "Whether you're defining a new product, modernizing legacy systems, or choosing stack and architecture—we provide structured guidance so your decisions are informed by experience and aligned with your business goals.",
  "consultWithUs": "Discuss Your Initiative",
  "consultingWithUsMessage": "Share your goals, constraints, and timeline. We'll outline options, trade-offs, and a clear path forward—including scope, technology, and what it takes to get there.",
  "whatToConsultAbout": "What We Can Help With",
  "architectureDesign": "Architecture & System Design",
  "architectureDesignDescription": "Scalable, maintainable architectures for new and existing systems. We help you choose patterns, boundaries, and integration approaches so your solution is fit for production and future growth.",
  "technologySelection": "Technology & Stack Selection",
  "technologySelectionDescription": "Objective evaluation of technologies and vendors against your requirements, team skills, and long-term maintainability. We help you select a stack that balances delivery speed, cost, and risk.",
  "performanceOptimization": "Performance & Scalability",
  "performanceOptimizationDescription": "Response times, throughput, and resource usage. We apply caching, load balancing, query optimization, and capacity planning so your systems perform under load and stay cost-effective.",
  "securityReview": "Security & Compliance Review",
  "securityReviewDescription": "Security posture and compliance alignment. We assess design and implementation against common threats and frameworks so your applications and data meet business and regulatory expectations.",
  "codeReview": "Code & Implementation Review",
  "codeReviewDescription": "Expert review of code quality, patterns, and technical debt. We provide actionable feedback so your codebase stays maintainable, testable, and aligned with best practices.",
  "bestPractices": "Process & Best Practices",
  "bestPracticesDescription": "Development process, DevOps, and delivery practices. We help you adopt workflows that improve predictability, quality, and team efficiency.",
  "trainingProgramsHeader": "Schulungsprogramme",
  "trainingProgramsDescription": "Professionelle Entwicklungs- und Schulungslösungen",
  "trainingOverview": "Umfassende Schulungsprogramme zur Verbesserung der Fähigkeiten Ihres Teams",
  "trainingCourses": "Schulungskurse",
  "vueJsDevelopment": "Vue.js-Entwicklung",
  "vueJsDevelopmentDescription": "Lernen Sie moderne Vue.js-Entwicklungspraktiken mit Nuxt",
  "swiftBackendDevelopment": "Swift Backend-Entwicklung",
  "swiftBackendDevelopmentDescription": "Meistern Sie Swift Backend-Entwicklung mit Vapor und SwiftNIO",
  "typescriptDevelopment": "TypeScript-Entwicklung",
  "typescriptDevelopmentDescription": "Erstellen Sie robuste Anwendungen mit TypeScript",
  "securityFirstDevelopment": "Sicherheitsorientierte Entwicklung",
  "securityFirstDevelopmentDescription": "Implementieren Sie sicherheitsorientierte Softwareentwicklungspraktiken",
  "productManagementExpertiseHeader": "Product Management",
  "productManagementExpertiseDescription": "Structured product management to align vision, roadmap, and delivery with business outcomes.",
  "productManagementOverview": "We support product-led organizations with discovery, prioritization, and lifecycle practices. From requirements and market insight through UX and roadmap planning, we help you ship the right features at the right time and keep stakeholders aligned.",
  "productManagementPoints": "Key Disciplines",
  "requirementsGathering": "Requirements & Discovery",
  "requirementsGatheringDescription": "Structured elicitation and documentation of functional and non-functional requirements. We capture clear, actionable specs so development and stakeholders share a single source of truth.",
  "marketResearch": "Market & User Research",
  "marketResearchDescription": "Evidence-based understanding of users, competitors, and market fit. We support product decisions with research so roadmaps are grounded in real demand and usage.",
  "userExperienceDesign": "User Experience Design",
  "userExperienceDesignDescription": "User-centered flows, information architecture, and interaction design. We align UX with business goals and accessibility so products are usable and compliant.",
  "productStrategy": "Product Strategy",
  "productStrategyDescription": "Vision, positioning, and roadmap aligned with business objectives. We help define and communicate strategy so teams and stakeholders move in the same direction.",
  "featurePrioritization": "Feature Prioritization",
  "featurePrioritizationDescription": "Framework-driven prioritization (value, effort, risk). We help you decide what to build next so capacity is focused on the highest-impact work.",
  "stakeholderManagement": "Stakeholder Management",
  "stakeholderManagementDescription": "Clear communication, expectations, and alignment with internal and external stakeholders. We keep everyone informed and bought in so delivery stays on track.",
  "projectManagementExpertiseHeader": "Project Management",
  "projectManagementExpertiseDescription": "Delivery discipline so your software projects stay on scope, schedule, and quality.",
  "projectManagementOverview": "We apply proven project management practices—planning, tracking, risk and resource management—tailored to your team size and methodology. We keep projects visible and predictable so you can deliver on commitments and adapt when priorities change.",
  "projectManagementPoints": "Key Disciplines",
  "projectPlanning": "Project Planning",
  "projectPlanningDescription": "Scoped plans, milestones, and dependencies. We define clear deliverables and timelines so execution is predictable and aligned with business goals.",
  "resourceManagement": "Resource Management",
  "resourceManagementDescription": "Capacity planning and allocation across teams and sprints. We help balance workload and skills so delivery stays sustainable and on track.",
  "riskManagement": "Risk Management",
  "riskManagementDescription": "Identification, assessment, and mitigation of technical and project risks. We surface and address risks early so issues don’t derail delivery.",
  "qualityAssurance": "Quality Assurance",
  "qualityAssuranceDescription": "Quality gates, acceptance criteria, and release readiness. We ensure standards are met so releases are reliable and supportable.",
  "overview": "Übersicht",
  "privacyPolicyTitle": "Datenschutzerklärung",
  "effectiveDate": "Gültigkeitsdatum",
  "effectiveDateValue": "10.05.2024",
  "introduction": "Einführung",
  "informationWeDoNotCollect": "Informationen, die wir nicht sammeln",
  "informationCollectedByServers": "Von Servern und Technologien gesammelte Informationen",
  "legalUse": "Rechtmäßige Nutzung",
  "limitationOfLiability": "Haftungsbeschränkung",
  "changesToPolicy": "Änderungen dieser Datenschutzerklärung",
  "privacyWelcomeMessage": "Willkommen bei NeedleTails.com. Ihre Privatsphäre ist uns wichtig.",
  "privacyPurpose": "Diese Datenschutzerklärung beschreibt unsere Praktiken bezüglich der Sammlung von Informationen, wenn Sie unsere Website besuchen.",
  "personalInformation": "Wir sammeln keine persönlichen Informationen von unseren Benutzern.",
  "informationOverview": "Obwohl wir keine persönlichen Informationen sammeln, sollten Sie sich bewusst sein, dass Server und andere Technologien automatisch bestimmte Informationen sammeln können.",
  "legalUseOverview": "Durch die Nutzung unserer Website stimmen Sie zu, alle geltenden lokalen Gesetze und Vorschriften zu befolgen.",
  "userResponsibility": "Es ist Ihre Verantwortung sicherzustellen, dass Ihre Nutzung der Website in Ihrer Gerichtsbarkeit rechtmäßig ist.",
  "privacyLimitationOverview": "Der Autor dieser Website haftet nicht für Schäden oder Verluste, die sich aus Ihrer Nutzung der Website ergeben.",
  "privacyUserAcknowledgment": "Durch die Nutzung der Website erkennen Sie an, dass Sie dies auf eigene Gefahr tun und dass der Autor nicht für Folgen verantwortlich ist, die sich aus Ihrer Nutzung ergeben.",
  "privacyChangesToPolicy": "Wir können unsere Datenschutzerklärung von Zeit zu Zeit aktualisieren. Wir werden Sie über alle Änderungen informieren, indem wir die neue Datenschutzerklärung auf dieser Seite veröffentlichen. Es wird empfohlen, diese Datenschutzerklärung regelmäßig auf Änderungen zu überprüfen.",
  "cookies": "Cookies",
  "cookiesDescription": "Cookies können verwendet werden, um die Benutzererfahrung zu verbessern. Diese können umfassen:",
  "sessionCookies": "Session-Cookies: Temporäre Cookies, die ablaufen, wenn Sie Ihren Browser schließen.",
  "persistentCookies": "Persistente Cookies: Cookies, die für einen festgelegten Zeitraum oder bis zum Löschen auf Ihrem Gerät verbleiben.",
  "analytics": "Analytics",
  "analyticsDescription": "Wir können Drittanbieter-Analytics-Dienste verwenden, die Informationen über die Website-Nutzung sammeln, wie:",
  "pageViews": "Seitenaufrufe",
  "userInteractions": "Benutzerinteraktionen",
  "trafficSources": "Verkehrsquellen",
  "serverLogs": "Server-Logs",
  "serverLogsDescription": "Webserver können Informationen über Ihren Besuch protokollieren, einschließlich:",
  "ipAddress": "IP-Adresse",
  "browserType": "Browsertyp",
  "operatingSystem": "Betriebssystem",
  "referringUrl": "Verweisende URL",
  "pagesVisited": "Besuchte Seiten",
  "timeAndDateOfAccess": "Zeit und Datum des Zugriffs",
  "termsTitle": "Allgemeine Geschäftsbedingungen",
  "termsEffectiveDate": "Gültigkeitsdatum: 10.05.2024",
  "userAgreement": "Benutzervereinbarung",
  "prohibitedActivities": "Verbotene Aktivitäten",
  "changesToTerms": "Änderungen dieser Bedingungen",
  "termsWelcomeMessage": "Willkommen zu unseren Allgemeinen Geschäftsbedingungen.",
  "termsPurpose": "Diese Bedingungen regeln Ihre Nutzung unserer Dienstleistungen.",
  "userAgreementText": "Durch die Nutzung unserer Dienstleistungen stimmen Sie diesen Bedingungen zu.",
  "prohibitedActivitiesOverview": "Die folgenden Aktivitäten sind verboten:",
  "usingServiceForIllegalPurposes": "Verwendung des Dienstes für illegale Zwecke.",
  "engagingInHarassment": "Beteiligung an jeglicher Form von Belästigung oder Missbrauch.",
  "unauthorizedAccess": "Versuch, unbefugten Zugang zu unseren Systemen zu erlangen.",
  "distributingMalware": "Verbreitung von Schadsoftware oder Viren.",
  "termsLimitationOverview": "Wir haften nicht für indirekte, zufällige oder Folgeschäden.",
  "termsUserAcknowledgment": "Sie erkennen an, dass Sie unsere Dienstleistungen auf eigene Gefahr nutzen.",
  "termsChangesToTerms": "Wir können diese Bedingungen von Zeit zu Zeit aktualisieren. Bitte überprüfen Sie sie regelmäßig.",
  "spineTailedKitTitle": "PQSRTC",
  "spineTailedKitDescription": "PQSRTC zielt darauf ab, ein schlankes RTC-Protokoll in Swift zu liefern, mit Post-Quantum-Verschlüsselung als Standard. Es ist ein WebRTC-basiertes SDK, das sich auf moderne, sichere und hochleistungsfähige Sprach- und Videoanwendungen für Android- und Apple-Plattformen konzentriert, wobei die gemeinsame Logik in Swift geschrieben ist.",
  "needleTailKitTitle": "NeedleTailKit",
  "needleTailKitDescription": "Was ist NeedleTailKit? NTK ist das Kern-SDK für NeedleTail Client- und Server-Anwendungen und ermöglicht die Erstellung schöner Ende-zu-Ende-verschlüsselter Anwendungen. Es kann für verschiedene Anwendungen über Messaging hinaus verwendet werden. Interessiert? Kontaktieren Sie uns, um mehr zu erfahren!",
  "needleTailIRCTitle": "NeedleTailIRC",
  "needleTailIRCDescription": "Eine moderne IRC-Client-Bibliothek für Swift-Anwendungen. NeedleTailIRC bietet eine robuste, typsichere Schnittstelle für die Verbindung zu IRC-Servern, die Verwaltung von Kanälen und die Verwaltung von Echtzeit-Kommunikation. Erstellt mit Swift Concurrency für optimale Leistung.",
  "connectionManagerKitTitle": "ConnectionManagerKit",
  "connectionManagerKitDescription": "Ein umfassendes Verbindungsverwaltungs-Framework für Swift-Anwendungen. ConnectionManagerKit vereinfacht Netzwerkverbindungen, Verbindungspooling und Verbindungslebenszyklus-Management. Perfekt für Anwendungen, die zuverlässige Netzwerkkommunikation benötigen.",
  "postQuantumSolaceTitle": "PostQuantumSolace",
  "postQuantumSolaceDescription": "Eine Post-Quanten-Kryptographie-Bibliothek für Swift-Anwendungen. PostQuantumSolace bietet quantenresistente kryptographische Algorithmen und Protokolle und stellt sicher, dass Ihre Anwendungen im Zeitalter der Quantencomputer sicher bleiben.",
  "whiteTippedSocketsTitle": "White Tipped Sockets",
  "whiteTippedSocketsDescription": "WhiteTippedSockets ist eine native WebSocket-Bibliothek für iOS und macOS, die auf der Network.framework API mit Swift Concurrency aufbaut. Unser Ziel ist es, eine moderne, effiziente Lösung für WebSocket-Kommunikation zu bieten, und wir planen auch, in Zukunft einen vollständig funktionsfähigen, skalierbaren Server zu entwickeln.",
  "swiftHlsTitle": "Swift HLS",
  "swiftHlsDescription": "HTTP Live Streaming (HLS) ist eine Schlüsseltechnologie für effizientes Media-Streaming, und SwiftHLS ist darauf ausgelegt, dies zu erleichtern. Durch die Nutzung des gleichen Protokolls, das das Web antreibt, ermöglicht HLS Content-Delivery über REST-APIs und CDNs. Sein Zweck ist es, Zuverlässigkeit zu bieten und sich dynamisch an Netzwerkbedingungen anzupassen.",
  "swiftIapTitle": "Swift IAP",
  "swiftIapDescription": "SwiftIAP ist eine umfassende In-App-Purchase-Bibliothek für iOS- und macOS-Anwendungen. Sie bietet eine moderne, typsichere Schnittstelle für die Handhabung von In-App-Käufen, Abonnements und Quittungsvalidierung. Entwickelt mit Swift Concurrency und für einfache Verwendung konzipiert.",
  "stompTitle": "Stomp",
  "stompDescription": "Stomp ist eine Swift-Bibliothek für STOMP-Protokollkommunikation. Sie bietet eine moderne, typsichere Schnittstelle für die Verbindung zu STOMP-Servern und die Handhabung von Nachrichtenrouting. Perfekt für Anwendungen, die eine zuverlässige Messaging-Infrastruktur benötigen.",
  "privacy": "Datenschutzerklärung",
  "termsConditions": "Allgemeine Geschäftsbedingungen",
  "projectTitle_1": "Projekte",
  "projectHeader_1": "PQSRTC",
  "projectTitleText_1": "RTC VoIP-Lösung",
  "projectTitle_2": "Projekte",
  "projectHeader_2": "NeedleTailKit",
  "projectTitleText_2": "Ende-zu-Ende-Verschlüsselungs-Messaging-Lösung",
  "projectTitle_3": "Projekte",
  "projectHeader_3": "White Tipped Sockets",
  "projectTitleText_3": "Swift Concurrent Network.framework Wrapper",
  "projectTitle_4": "Projekte",
  "projectHeader_4": "Swift Stomp",
  "projectTitleText_4": "Swift Concurrent STOMP-Protokoll",
  "projectTitle_5": "Projekte",
  "projectHeader_5": "Swift HLS",
  "projectTitleText_5": "Swift HLS-Projekt",
  "pageNotFound": "Seite nicht gefunden",
  "pageNotFoundDescription": "Die gesuchte Seite existiert nicht oder wurde verschoben. Lassen Sie uns Sie zurück auf den richtigen Weg bringen.",
  "goHome": "Zur Startseite",
  "goBack": "Zurück",
  "contact": "Kontakt",
  "contactUs": "Kontaktieren Sie uns",
  "becomeASponsor": "Werden Sie Sponsor",
  "supportOpenSourceMessage": "Unterstützen Sie unsere Open-Source-Projekte und helfen Sie uns dabei, weiterhin erstaunliche Software zu entwickeln.",
  "getStartedOnDigitalOcean": "Starten Sie mit Digital Ocean mit einem $100, 60-Tage-Guthaben für neue Benutzer.",
  "readyToGetStarted": "Bereit zum Starten?",
  "letsDiscussProject": "Lassen Sie uns über Ihr Projekt sprechen und sehen, wie wir Ihnen dabei helfen können, Ihre Ideen mit Swift-gestützten Lösungen zum Leben zu erwecken.",
  "backToTop": "Nach oben",
  "needleTailsCopyright": "NeedleTails©",
  "pointsForConsideration": "Überlegungspunkte",
  "responsiveDesign": "Responsive & Adaptive Design",
  "responsiveDesignDescription": "Layouts and components that adapt to all viewports and devices. We deliver consistent, high-quality experiences on desktop, tablet, and mobile so your web product works everywhere your users are.",
  "crossBrowserCompatibility": "Cross-Browser & Standards Compliance",
  "crossBrowserCompatibilityDescription": "Testing and compatibility across major browsers and standards. We ensure consistent behavior and appearance so your application works reliably for every user, regardless of browser or device.",
  "webPerformanceOptimizationDescription": "Performance budgets, lazy loading, and optimized assets. We minimize load times and resource usage through efficient code, caching, and CDN strategies so your site feels fast and remains cost-effective at scale.",
  "userExperience": "User Experience & Accessibility",
  "userExperienceDescription": "Clear information architecture, intuitive navigation, and WCAG-aligned accessibility. We design and implement UX that drives engagement and meets enterprise usability and compliance expectations.",
  "securityPractices": "Security & Data Protection",
  "securityPracticesDescription": "HTTPS, secure headers, input validation, and protection against OWASP-top risks including XSS and CSRF. We harden web applications so your data and your users stay secure in production.",
  "seoBestPractices": "SEO & Discoverability",
  "seoBestPracticesDescription": "Semantic structure, meta tags, and content strategy aligned with search best practices. We optimize for discoverability and ranking so your web presence supports your business and marketing goals.",
  "backendSolutionsHeader": "Server-Side Solutions",
  "backendSolutionsDescription": "We design and deliver production-grade backends that power your business. Our server-first approach ensures APIs, data pipelines, and integrations are built for reliability, compliance, and scale—so your applications perform under real-world load and security requirements.",
  "backendCapabilitiesOverview": "Our server-side practice is built on Swift (Vapor, Hummingbird, SwiftNIO) and proven cloud-native patterns. We deliver secure, high-performance backends—REST and custom APIs, event-driven systems, and seamless integration with your existing stack. From architecture through deployment and observability, we own the full lifecycle so your teams can focus on product, not infrastructure.",
  "scalability": "Scalability & Resilience",
  "scalabilityDescription": "Architectures designed for growth: horizontal scaling, stateless services, and resilient patterns. We apply microservices, serverless, and queue-based designs so your backend handles traffic spikes and data growth without rework.",
  "security": "Security & Compliance",
  "securityDescription": "Robust security by default: encryption at rest and in transit, identity and access control, audit trails, and alignment with common compliance frameworks. We harden backends so your data and your users stay protected.",
  "maintainability": "Maintainability & Standards",
  "maintainabilityDescription": "Clean, modular, and well-documented codebases with consistent patterns and version control. We adopt and document coding standards so your team can maintain and extend the system with confidence.",
  "testingAndQualityAssurance": "Testing & Quality Assurance",
  "testingAndQualityAssuranceDescription": "Rigorous testing strategies: unit, integration, and contract tests with CI/CD automation. We maintain high quality and regression safety so releases are predictable and low-risk.",
  "monitoringAndLogging": "Monitoring & Observability",
  "monitoringAndLoggingDescription": "Production-ready observability: structured logging, metrics, and alerting. We instrument backends so you have clear visibility into health, performance, and incidents—and can respond before users are affected.",
  "nativeAppDevelopmentHeader": "Native Application Development",
  "nativeAppDevelopmentDescription": "We deliver native applications built for performance, security, and great user experience—on every platform your business requires.",
  "nativeAppDevelopmentOverview": "We build production-ready native apps for the full Apple ecosystem (iOS, iPadOS, macOS, tvOS, watchOS, visionOS) and Android. Our work emphasizes type-safe Swift and Kotlin/Java, platform-appropriate UX, accessibility, and security-by-design. From MVPs to large-scale deployments, we handle architecture, store readiness, and ongoing support so your apps stay performant, compliant, and maintainable.",
  "designConsistency": "Design Systems & Consistency",
  "designConsistencyDescription": "Unified design systems and component libraries across platforms. We ensure consistent branding, interaction patterns, and accessibility so your product feels cohesive on every device.",
  "deviceFragmentation": "Device & Platform Coverage",
  "deviceFragmentationDescription": "Structured testing across device matrices, screen sizes, and OS versions. We validate behavior and performance so your app works reliably for all target users, including edge cases.",
  "userExperienceUX": "User Experience & Accessibility",
  "userExperienceUXDescription": "Intuitive flows, clear information architecture, and WCAG-aligned accessibility. We design and implement UX that serves all users and supports usability and compliance goals.",
  "distributionCompliance": "Distribution & Store Compliance",
  "distributionComplianceDescription": "App Store and Play Store readiness: guidelines, privacy labels, and review best practices. We prepare and maintain your apps for public and private distribution channels.",
  "webDevelopmentExpertiseHeader": "Web Application Development",
  "webDevelopmentExpertiseDescription": "We build and maintain web applications that support your business goals—from marketing sites and portals to full-stack web apps that integrate with your existing systems.",
  "webDevelopmentOverview": "We deliver production-grade web experiences: responsive sites, SPAs, and full-stack applications built with Vue.js, Nuxt, and TypeScript on the front end, and Vapor, Hummingbird, or your preferred backend. Our work covers corporate sites, customer portals, internal tools, and public-facing apps—with a focus on performance, security, SEO, and maintainability so your web presence scales with your organization.",
  "solutionsTitle": "Unsere Lösungen",
  "featuredApplications": "Hervorgehobene Anwendungen",
  "our": "Unsere",
  "featuredApps": "Hervorgehobene Apps",
  "featuredAppsDescription": "Entdecken Sie unsere innovativen Anwendungen, die die Kraft der Swift-Entwicklung und moderner Softwarearchitektur zeigen.",
  "nudgeTitle": "Secure Messaging You Control",
  "nudgeDescription": "End-to-end encrypted messaging with optional self-hosting. Your data stays yours—no third-party storage, no persistence risk. Run your own instance or scale globally.",
  "islandHoppersTitle": "Island Hoppers: Ihre ultimative Tour-App für nahtlose Abenteuer!",
  "islandHoppersDescription": "Island Hoppers ist die All-in-One-App, die entwickelt wurde, um Ihr Reiseerlebnis zu verbessern, egal ob Sie ein Unternehmen sind, das unvergessliche Touren organisiert, oder ein Kunde, der das perfekte Urlaubserlebnis sucht. Für Unternehmen optimiert unsere App den gesamten Tour-Management-Prozess. Organisieren und passen Sie Ihre Touren mühelos an, kommunizieren Sie direkt mit Reiseführern und halten Sie Ihre Kunden mit Echtzeit-Updates auf dem Laufenden. Mit Island Hoppers können Sie Buchungen verwalten, Kundenpräferenzen verfolgen und sicherstellen, dass jedes Detail berücksichtigt wird, sodass Sie sich auf die Bereitstellung außergewöhnlicher Erlebnisse konzentrieren können. Für Kunden bietet Island Hoppers eine vielfältige Auswahl an Tour-Paketen, die auf verschiedene Gruppentypen zugeschnitten sind, einschließlich Familien, Rucksacktouristen und Party-Enthusiasten. Durchsuchen Sie unsere kuratierte Auswahl an Abenteuern, wählen Sie das perfekte Paket, das zu Ihrem Stil passt, und vernetzen Sie sich mit Gleichgesinnten. Genießen Sie nahtlose Kommunikation mit Ihren Reiseführern, greifen Sie auf wichtige Informationen zu und erhalten Sie personalisierte Empfehlungen, um das Beste aus Ihrer Reise herauszuholen. Mit Island Hoppers begeben Sie sich mit Leichtigkeit und Vertrauen auf unvergessliche Abenteuer, wissend, dass jeder Aspekt Ihrer Tour nur einen Klick entfernt ist!",
  "streamStackTitle": "Eine Bildungsplattform für Ihre Software-Lösungen",
  "streamStackDescription": "Streamen, Lesen, Diskutieren. Ob Sie neu im Programmieren sind oder sich über verschiedene Software-Lösungen informieren möchten, wir machen es Ihnen mit unserer Vapor-gestützten Nuxt-App leicht. Bleiben Sie auf dem Laufenden über die neuesten Coding-Trends.",
  "welcomeToNeedleTails": "Willkommen bei NeedleTails - Ihr Verbündeter in der Softwareentwicklung",
  "accept": "Ich stimme zu und akzeptiere",
  "cookieConsentTitle": "Wir verwenden Browser-Speicher",
  "cookieConsentMessage": "Wir verwenden Browser-Speicher, um Ihre Sprachpräferenz zu merken und Ihr Browsing-Erlebnis zu verbessern. Durch Klicken auf 'Alle akzeptieren' stimmen Sie unserer Verwendung des Browser-Speichers zu.",
  "cookieConsentAcceptAll": "Alle akzeptieren",
  "cookieConsentAcceptNecessary": "Nur Notwendige",
  "cookieConsentReject": "Alle ablehnen",
  "cookieConsentLearnMore": "Mehr erfahren",
  "cookieConsentNecessary": "Notwendiger Speicher umfasst die Spracherkennung, um Inhalte in Ihrer bevorzugten Sprache bereitzustellen.",
  "cookieConsentAnalytics": "Wir verwenden derzeit kein Analyse-Tracking auf dieser Website.",
  "cookieConsentPreferences": "Präferenz-Speicher merkt sich Ihre Einstellungen wie Theme und Benutzereinstellungen, um Ihre Erfahrung zu personalisieren.",
  "cookieConsentMarketing": "Wir verwenden derzeit kein Marketing-Tracking oder Werbung auf dieser Website.",
  "brewhubWidgetTitle": "BrewHub",
  "brewhubWidgetDescription": "Professionelle Plattform für Softwareentwicklungskurse und -unterricht. Zugriff auf geführte, Live-Schulungen mit Produktions-Tools und -Workflows zur Verbesserung Ihrer Entwicklungskompetenzen.",
  "brewhubWidgetCTA": "Schulungskurse",
  "brewhubComingSoonTitle": "Verfügbar",
  "brewhubComingSoonDescription": "BrewHub ist jetzt verfügbar. Besuchen Sie brewhub.needletails.com für professionelle Softwareentwicklungskurse und Trainings.",
  "brewhubFeature1Title": "Expertenkurse",
  "brewhubFeature1Description": "Greifen Sie auf professionelle Softwareentwicklungskurse zu, die von Branchenexperten unterrichtet werden.",
  "brewhubFeature2Title": "Live-Training",
  "brewhubFeature2Description": "Live-Training einzeln oder in kleinen Gruppen mit direkter Expertenanleitung.",
  "brewhubFeature3Title": "Community",
  "brewhubFeature3Description": "Treten Sie einer Entwickler-Community bei und lernen Sie gemeinsam.",
  "brewhubFeature4Title": "Produktions-Tools",
  "brewhubFeature4Description": "Lernen Sie mit denselben Tools und Workflows, die in Produktionsumgebungen verwendet werden.",
  "brewhubBackToMainSite": "Zu BrewHub",
  "brewhubMetaTitle": "BrewHub | NeedleTails",
  "brewhubMetaDescription": "BrewHub ist die Plattform von NeedleTails für professionelle Softwareentwicklungskurse und Trainings.",
  "brewhubOgDescription": "Professionelle Softwareentwicklungskurse und Trainings.",
  "brewhubLogoAlt": "BrewHub-Logo",
  "needletailKitTitle": "NeedleTailKit",
  "needletailKitSubtitle": "Ein umfassendes, produktionsreifes Swift SDK zum Erstellen sicherer, Ende-zu-Ende-verschlüsselter Messaging-Anwendungen mit Sicherheitsfunktionen auf Unternehmensebene.",
  "needletailKitPrivateBadge": "Privates SDK - Lizenz Erforderlich",
  "needletailKitRequestLicense": "Lizenz Anfordern",
  "needletailKitExploreFeatures": "Funktionen Erkunden",
  "needletailKitFeaturesTitle": "Funktionen auf Unternehmensebene",
  "needletailKitFeaturesDescription": "Für die Produktion entwickelt mit modernster Sicherheit und moderner Swift-Architektur.",
  "needletailKitSecurityTitle": "Unternehmenssicherheit",
  "needletailKitSecurityPQ": "Post-Quanten-Kryptographie - Zukunftsicher gegen Quantenangriffe",
  "needletailKitSecurityDoubleRatchet": "Double Ratchet Protokoll - Perfekte Vorwärtsgeheimhaltung",
  "needletailKitSecurityE2E": "Ende-zu-Ende-Verschlüsselung - Alle Nachrichten standardmäßig verschlüsselt",
  "needletailKitSecurityDeviceVerification": "Geräteverifizierung - Kryptographische Geräteverknüpfung",
  "needletailKitPlatformTitle": "Multi-Plattform-Unterstützung",
  "needletailKitPlatformIOS": "iOS 18.0+ - Vollständige native iOS-Unterstützung",
  "needletailKitPlatformMacOS": "macOS 15.0+ - Vollständige macOS-Integration",
  "needletailKitPlatformSwift6": "Swift 6.0+ - Neueste Sprachfunktionen",
  "needletailKitPlatformAsync": "Async/Await - Moderne Nebenläufigkeit überall",
  "needletailKitTransportTitle": "Intelligenter Transport",
  "needletailKitTransportMulti": "Multi-Transport-Routing - Automatische Pfadauswahl",
  "needletailKitTransportP2P": "Lokales Netzwerk P2P - Direkte Gerätekommunikation",
  "needletailKitTransportDCC": "DCC-Protokoll - IRC-basiertes P2P mit TLS",
  "needletailKitTransportFailover": "Automatisches Failover - Nahtloser Transportwechsel",
  "needletailKitMessagingTitle": "Umfangreiches Messaging",
  "needletailKitMessagingText": "Textnachrichten - Einfache, sichere Kommunikation",
  "needletailKitMessagingMedia": "Mediennachrichten - Bilder, Videos, Dokumente",
  "needletailKitMessagingSelfDestruct": "Selbstzerstörende Nachrichten - Temporäre Unterstützung",
  "needletailKitMessagingEdit": "Nachrichtenbearbeitung - Gesendete Nachrichten bearbeiten",
  "needletailKitVoiceVideoTitle": "Sprach- und Videoanrufe",
  "needletailKitVoiceVideoWebRTC": "WebRTC-Integration - Hochwertige Anrufe",
  "needletailKitVoiceVideoSTUN": "STUN/TURN-Unterstützung - NAT-Traversierung",
  "needletailKitVoiceVideoCallManagement": "Anrufverwaltung - Vollständige Lebenszyklusverwaltung",
  "needletailKitEnterpriseTitle": "Unternehmensbereit",
  "needletailKitEnterpriseProduction": "Produktionsbereit - In echten Anwendungen getestet",
  "needletailKitEnterpriseSupport": "Unternehmenssupport - Professioneller Support verfügbar",
  "needletailKitEnterpriseCompliance": "Compliance - Für regulatorische Compliance entwickelt",
  "needletailKitEnterpriseScalability": "Skalierbarkeit - Für groß angelegte Bereitstellungen konzipiert",
  "needletailKitQuickStartTitle": "Quick Start",
  "needletailKitQuickStartDescription": "Get started with NeedleTailKit in minutes. Follow these simple steps to integrate secure messaging into your application.",
  "needletailKitInstallTitle": "Installation",
  "needletailKitInstallCode": "dependencies: [\n    .package(url: \"https://github.com/needletails/needle-tail-kit.git\", from: \"1.0.0\")\n]",
  "needletailKitInitializeTitle": "Initialize Session",
  "needletailKitInitializeCode": "import NeedleTailKit\n\nlet session = NeedleTailSession.shared\ntry await session.createNewUserAccount(\n    authInfo: authInfo,\n    store: store,\n    eventObserver: eventObserver\n)",
  "needletailKitSendMessageTitle": "Send Your First Message",
  "needletailKitSendMessageCode": "let contact = try await session.createContact(contact: \"bob\")\ntry await session.sendMessage(\n    messageType: .text,\n    recipient: .nickname(\"bob\"),\n    text: \"Hello, World!\"\n)",
  "needletailKitContactTitle": "Lizenz Anfordern",
  "needletailKitContactDescription": "NeedleTailKit ist ein proprietäres, quellgeschütztes SDK. Kontaktieren Sie uns, um Lizenzierungsoptionen für Ihr Projekt zu besprechen.",
  "needletailKitContactButton": "Für Lizenz Kontaktieren",
  "needletailKitMetaTitle": "NeedleTailKit - Enterprise Secure Messaging SDK | NeedleTails",
  "needletailKitMetaDescription": "Produktionsreifes Swift SDK zum Erstellen sicherer, Ende-zu-Ende-verschlüsselter Messaging-Anwendungen. Post-Quanten-Kryptographie, Multi-Plattform-Unterstützung und Sicherheit auf Unternehmensebene.",
  "needletailKitOgDescription": "Produktionsreifes Swift SDK für sicheres Messaging mit Sicherheitsfunktionen auf Unternehmensebene.",
  "needletailKitLogoAlt": "NeedleTailKit Logo",
  "needletailKitPlatformAndroid": "Android: API 24 (Android 7.0) oder höher",
  "nudgeWidgetTitle": "Sicher mit Nudge",
  "nudgeWidgetDescription": "Optionell selbstüberwacht, End-zu-Ende-verschlüsseltes Messaging mit vollständiger Datenkontrolle.",
  "nudgeWidgetCTA": "Mehr Erfahren",
  "nudgeWidgetLogoAlt": "Nudge Logo",
  "nudgeFeature1Title": "End-to-End Encryption",
  "nudgeFeature1Description": "Every message encrypted by default. Full privacy.",
  "nudgeFeature2Title": "Your Data, Your Rules",
  "nudgeFeature2Description": "Optional self-hosting. No external data storage.",
  "nudgeFeature3Title": "Secure Channels",
  "nudgeFeature3Description": "Private messaging built for security.",
  "nudgeFeature4Title": "Global or Self-Hosted",
  "nudgeFeature4Description": "Scale globally or run your own instance—no data persistence risk.",
  "nudgeContactButton": "Nudge Ansehen",
  "nudgeMetaTitle": "Nudge - Sichere Ende-zu-Ende-verschlüsselte Messaging | NeedleTails",
  "nudgeMetaDescription": "Optionell selbstüberwachte, End-zu-Ende-verschlüsselte Messaging-Anwendung mit vollständiger Datenkontrolle. Sichere Kommunikation ohne Risiken der Datenpersistenz.",
  "nudgeOgDescription": "Optionell selbstüberwachtes, End-zu-Ende-verschlüsseltes Messaging mit vollständiger Datenkontrolle und Sicherheit auf Unternehmensebene.",
  "nudgeMetaKeywords": "Nudge, sichere Messaging, Ende-zu-Ende-Verschlüsselung, verschlüsselte Messaging-App, optional selbstüberwachte Messaging, private Messaging, sichere Kommunikation, Datenschutz, Messaging-Sicherheit, verschlüsselter Chat, sichere Chat-App, datenschutzorientierte Messaging",
  "brewhubMetaKeywords": "BrewHub, Softwareentwicklungskurse, Programmierkurse, Entwicklerschulung, Softwareausbildung, Programmierkurse, Entwicklungstutorials, technische Schulung, Software-Lernplattform, Programmiertutorials, Webentwicklungskurse, Mobile-Entwicklungskurse, Backend-Entwicklungsschulung",
  "needletailKitMetaKeywords": "NeedleTailKit, Swift SDK, Ende-zu-Ende-Verschlüsselung, sichere Messaging, iOS SDK, macOS SDK, Android SDK, Post-Quanten-Kryptographie",
  "heroTagline": "Wir lösen Ihre Herausforderungen—Apps, Websites und integrierte Softwarelösungen.",
  "managementPageLabel": "Management",
  "managementPageTitle": "Product & Project Delivery",
  "managementPageLead": "We align vision, roadmap, and execution so your software projects stay on scope, schedule, and quality.",
  "managementCtaLead": "Ready to align your next project?",
  "consultationPageLabel": "Consultation",
  "consultationCtaLead": "Tell us about your goals and we'll outline a clear path forward."
}
