{
  "introHeaderTwo": "With Enterprise Application experience, we have what it takes to handle complicated tasks and projects from start to finish. As we specialize in Swift software development, you will feel confident in the safety that the language brings to the table. We strive for quality products, crafting secure websites, applications, and AI‑powered solutions tailored to your needs.",
  "solutionsTitle": "Solutions",
  "menuItemOne": "Courses",
  "menuItemTwo": "Consultation",
  "menuItemThree": "Management",
  "getInTouch": "Get In Touch",
  "projectsHeader": "Our Software",
  "projectsDescription": "We are dedicated to providing you with a wide range of open-source software. To support this mission, we also offer some closed-source software. We invite you to explore our SDKs, which include both open-source and closed-source options. If you're interested in contributing or obtaining a license for our closed-source software, please don't hesitate to get in touch with us.",
  "projectsOverview": "Here is a list of what we do and what we've done",
  "businessOverviewTitle": "Swift Software Specialists",
  "businessOverviewDescription": "Swift is a type-safe programming language, which means it helps prevent errors by ensuring that values are used correctly. It has a low memory footprint, allowing applications to run efficiently, especially on mobile devices. Additionally, Swift offers strong support for thread safety, ensuring that applications can handle multiple tasks at once without issues. By choosing NeedleTails, you can be confident that your projects will benefit from the reliability and performance that Swift provides, leading to high-quality software solutions tailored to your needs. Swift's advanatage is interoperability, which means we can incrementally move less efficient projects in different languages into Swift and or call Swift APIs from your native language.",
  "serviceHeaderBackendDevelopment": "Backend Development",
  "serviceDescriptionBackendDevelopment": "We leverage Swift's power to develop robust server-side solutions using Vapor and SwiftNIO, ensuring high performance and scalability for your applications.",
  "serviceHeaderMobileAppDevelopment": "Mobile App Development",
  "serviceDescriptionMobileAppDevelopment": "Create native iOS and macOS applications with Swift, delivering exceptional user experiences and optimal performance on Apple platforms.",
  "serviceHeaderTraining": "BrewHub",
  "serviceDescriptionTraining": "Professional software development courses and instruction platform. Access guided, live training with production-grade tooling and workflows to enhance your development skills.",
  "serviceHeaderWebDevelopment": "Web Development",
  "serviceDescriptionWebDevelopment": "Modern web applications built with Vue.js, Nuxt, and TypeScript, providing responsive and interactive user experiences.",
  "openSourceHeader": "Open Source",
  "openSourceDescription": "We believe in the power of open source. Explore our projects on GitHub and contribute to the community. Your support helps us continue developing innovative solutions.",
  "whyChooseSwift": "Why Choose Swift?",
  "typeSafety": "Type Safety",
  "typeSafetyDescription": "Swift's type system prevents errors at compile time, ensuring your applications are robust and reliable from day one.",
  "performance": "Performance",
  "performanceDescription": "Low memory footprint and high performance make Swift ideal for resource-constrained environments and demanding applications.",
  "threadSafety": "Thread Safety",
  "threadSafetyDescription": "Built-in concurrency support ensures your applications handle multiple tasks efficiently without race conditions.",
  "ourServices": "Our Services",
  "servicesDescription": "We believe that meticulous planning is essential for success. Our comprehensive blueprints, insightful inquiries, and guidance will support you throughout your journey.",
  "startYourProject": "Start Your Project",
  "swiftNative": "Swift Native",
  "support": "Support",
  "possibilities": "Possibilities",
  "makingYour": "Making Your",
  "ideasReality": "Ideas Reality",
  "featuredApplications": "Featured Applications",
  "our": "Our",
  "featuredApps": "Featured Apps",
  "featuredAppsDescription": "Discover our innovative applications that showcase the power of Swift development and modern software architecture.",
  "nudgeTitle": "Your Self Monitored Data End-to-End Encrypted Messaging Application",
  "nudgeDescription": "Are you worried about security in today's digital landscape? Do you want a secure communication channel but feel uncertain about who has access to your data? Even with end-to-end encryption, concerns about data storage can linger. Nudge is here to provide the solution you need. With Nudge, you have complete control over your data, allowing you to manage it securely or expand your reach globally without the risk of data persistence. Contact us today to learn more about how you can set up your own instance and enjoy peace of mind with secure communication!",
  "islandHoppersTitle": "Island Hoppers: Your Ultimate Tour App for Seamless Adventures!",
  "islandHoppersDescription": "Island Hoppers is the all-in-one app designed to enhance your travel experience, whether you're a company organizing unforgettable tours or a customer seeking the perfect getaway. For companies, our app streamlines the entire tour management process. Organize and customize your tours effortlessly, communicate directly with tour guides, and keep your customers informed with real-time updates. With Island Hoppers, you can manage bookings, track customer preferences, and ensure every detail is taken care of, allowing you to focus on delivering exceptional experiences. For customers, Island Hoppers offers a diverse range of tour packages tailored to suit various group types, including families, backpackers, and party enthusiasts. Browse through our curated selection of adventures, choose the perfect package that fits your style, and connect with like-minded travelers. Enjoy seamless communication with your tour guides, access essential information, and receive personalized recommendations to make the most of your journey. With Island Hoppers, embark on unforgettable adventures with ease and confidence, knowing that every aspect of your tour is just a tap away!",
  "streamStackTitle": "An Educational Platform for your Software Solutions",
  "streamStackDescription": "Stream, Read, Discuss. Whether you are new to programming or want to read up on some different software solutions, we make it easy for you to do so with our Vapor Backed NUXT App. Stay tuned for the latest coding trends.",
  "swiftSoftwareSpecialists": "Swift Software Specialists",
  "swift": "Swift",
  "swiftServer": "Swift-Server",
  "frequentlyAskedQuestions": "Frequently Asked Questions",
  "faqDescription": "Get answers to common questions about our software development services",
  "faqTechnologies": "What technologies do you specialize in?",
  "faqTechnologiesAnswer": "We specialize in modern web development using a wide range of technologies including, but not limited to Nuxt, Vue, Vapor, and SwiftNIO. Our language expertise includes TypeScript and Swift. We also work with robust backend solutions, cloud services, APIs, and scalable architecture to deliver high-performance applications.",
  "faqTimeline": "How long does a typical project take?",
  "faqTimelineAnswer": "Project timelines vary based on complexity. Simple web applications take 4-8 weeks, while complex enterprise solutions can take 3-6 months. We provide detailed timelines during consultation.",
  "faqSupport": "Do you provide ongoing support and maintenance?",
  "faqSupportAnswer": "Yes, we offer comprehensive support packages including 24/7 monitoring, regular updates, security patches, and feature enhancements to ensure your application remains current and secure.",
  "faqProcess": "What is your development process?",
  "faqProcessAnswer": "We follow a collaborative approach with regular client communication, iterative development, and continuous testing. Our process includes planning, design, development, testing, and deployment phases.",
  "faqIntegration": "Can you work with existing systems and APIs?",
  "faqIntegrationAnswer": "Absolutely! We have extensive experience integrating with existing systems, APIs, and databases. We can enhance, modernize, or completely rebuild your current infrastructure.",
  "faqSecurity": "What about security and data protection?",
  "faqSecurityAnswer": "Security is the default in everything we build. We implement security-driven software development practices, industry-standard security measures, data encryption, and regular security audits to protect your data and your users' information.",
  "consultingTitle": "Consulting Solutions",
  "consultingOverview": "Expert guidance for your software development projects",
  "consultWithUs": "Consult with Us",
  "consultingWithUsMessage": "Get professional advice on your development needs",
  "whatToConsultAbout": "What to Consult About",
  "architectureDesign": "Architecture Design",
  "architectureDesignDescription": "Design scalable and maintainable software architectures",
  "technologySelection": "Technology Selection",
  "technologySelectionDescription": "Choose the right technologies for your project needs",
  "performanceOptimization": "Performance Optimization",
  "performanceOptimizationDescription": "Focus on optimizing response times and resource usage. Use caching strategies, load balancing, and efficient database queries to enhance performance and reduce latency.",
  "securityReview": "Security Review",
  "securityReviewDescription": "Ensure your applications are secure and compliant",
  "codeReview": "Code Review",
  "codeReviewDescription": "Get expert feedback on your code quality",
  "bestPractices": "Best Practices",
  "bestPracticesDescription": "Implement industry best practices in your development",
  "trainingProgramsHeader": "Training Programs",
  "trainingProgramsDescription": "Professional development and training solutions",
  "trainingOverview": "Comprehensive training programs to enhance your team's skills",
  "trainingCourses": "Training Courses",
  "vueJsDevelopment": "Vue.js Development",
  "vueJsDevelopmentDescription": "Learn modern Vue.js development practices with Nuxt",
  "swiftBackendDevelopment": "Swift Backend Development",
  "swiftBackendDevelopmentDescription": "Master Swift backend development with Vapor and SwiftNIO",
  "typescriptDevelopment": "TypeScript Development",
  "typescriptDevelopmentDescription": "Build robust applications with TypeScript",
  "securityFirstDevelopment": "Security-First Development",
  "securityFirstDevelopmentDescription": "Implement security-driven software development practices",
  "productManagementExpertiseHeader": "Product Management Expertise",
  "productManagementExpertiseDescription": "Comprehensive product management solutions",
  "productManagementOverview": "Expert product management services to help you succeed",
  "productManagementPoints": "Product Management Points of Consideration",
  "requirementsGathering": "Requirements Gathering",
  "requirementsGatheringDescription": "Define and document project requirements",
  "marketResearch": "Market Research",
  "marketResearchDescription": "Conduct thorough market analysis",
  "userExperienceDesign": "User Experience Design",
  "userExperienceDesignDescription": "Design intuitive user experiences",
  "productStrategy": "Product Strategy",
  "productStrategyDescription": "Develop comprehensive product strategies",
  "featurePrioritization": "Feature Prioritization",
  "featurePrioritizationDescription": "Prioritize features based on value",
  "stakeholderManagement": "Stakeholder Management",
  "stakeholderManagementDescription": "Manage stakeholder relationships",
  "projectManagementExpertiseHeader": "Project Management Expertise",
  "projectManagementExpertiseDescription": "Professional project management solutions",
  "projectManagementOverview": "Comprehensive project management services",
  "projectManagementPoints": "Project Management Points of Consideration",
  "projectPlanning": "Project Planning",
  "projectPlanningDescription": "Create detailed project plans",
  "resourceManagement": "Resource Management",
  "resourceManagementDescription": "Manage project resources effectively",
  "riskManagement": "Risk Management",
  "riskManagementDescription": "Identify and mitigate project risks",
  "qualityAssurance": "Quality Assurance",
  "qualityAssuranceDescription": "Ensure project quality standards",
  "overview": "Overview",
  "privacyPolicyTitle": "Privacy Policy",
  "effectiveDate": "Effective Date",
  "effectiveDateValue": "10/05/2024",
  "introduction": "Introduction",
  "informationWeDoNotCollect": "Information We Do Not Collect",
  "informationCollectedByServers": "Information Collected by Servers and Technologies",
  "legalUse": "Legal Use",
  "limitationOfLiability": "Limitation of Liability",
  "changesToPolicy": "Changes to This Privacy Policy",
  "privacyWelcomeMessage": "Welcome to NeedleTails.com. Your privacy is important to us.",
  "privacyPurpose": "This Privacy Policy outlines our practices regarding the collection of information when you visit our site.",
  "personalInformation": "We do not collect any personal information from our users.",
  "informationOverview": "While we do not collect personal information, please be aware that servers and other technologies may collect certain information automatically.",
  "legalUseOverview": "By using our Site, you agree to comply with all applicable local laws and regulations.",
  "userResponsibility": "It is your responsibility to ensure that your use of the Site is lawful in your jurisdiction.",
  "privacyLimitationOverview": "The author of this website shall not be held liable for any damages or losses arising from your use of the Site.",
  "privacyUserAcknowledgment": "By using the Site, you acknowledge that you do so at your own risk and that the author is not responsible for any consequences resulting from your use.",
  "privacyChangesToPolicy": "We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page. You are advised to review this Privacy Policy periodically for any changes.",
  "cookies": "Cookies",
  "cookiesDescription": "Cookies may be used to enhance user experience. These may include:",
  "sessionCookies": "Session Cookies: Temporary cookies that expire when you close your browser.",
  "persistentCookies": "Persistent Cookies: Cookies that remain on your device for a set period or until deleted.",
  "analytics": "Analytics",
  "analyticsDescription": "We may use third-party analytics services that collect information about website usage, such as:",
  "pageViews": "Page Views",
  "userInteractions": "User Interactions",
  "trafficSources": "Traffic Sources",
  "serverLogs": "Server Logs",
  "serverLogsDescription": "Web servers may log information about your visit, including:",
  "ipAddress": "IP Address",
  "browserType": "Browser Type",
  "operatingSystem": "Operating System",
  "referringUrl": "Referring URL",
  "pagesVisited": "Pages Visited",
  "timeAndDateOfAccess": "Time and Date of Access",
  "termsTitle": "Terms and Conditions",
  "termsEffectiveDate": "Effective Date: 10/05/2024",
  "userAgreement": "User Agreement",
  "prohibitedActivities": "Prohibited Activities",
  "changesToTerms": "Changes to These Terms",
  "termsWelcomeMessage": "Welcome to our Terms and Conditions.",
  "termsPurpose": "These terms govern your use of our services.",
  "userAgreementText": "By using our services, you agree to these terms.",
  "prohibitedActivitiesOverview": "The following activities are prohibited:",
  "usingServiceForIllegalPurposes": "Using the service for illegal purposes.",
  "engagingInHarassment": "Engaging in any form of harassment or abuse.",
  "unauthorizedAccess": "Attempting to gain unauthorized access to our systems.",
  "distributingMalware": "Distributing malicious software or viruses.",
  "termsLimitationOverview": "We are not liable for any indirect, incidental, or consequential damages.",
  "termsUserAcknowledgment": "You acknowledge that you use our services at your own risk.",
  "termsChangesToTerms": "We may update these terms from time to time. Please review them regularly.",
  "spineTailedKitTitle": "PQSRTC",
  "spineTailedKitDescription": "PQSRTC aims to deliver a streamlined RTC protocol in Swift, with post-quantum encryption as the default. It is a WebRTC-backed SDK that focuses on providing a modern, safe, and high-performance solution for voice and video applications on both Android and Apple platforms, with shared logic written in Swift.",
  "needleTailKitTitle": "NeedleTailKit",
  "needleTailKitDescription": "What is NeedleTailKit? NTK is the core SDK for NeedleTail Client and Server Applications, enabling the creation of beautiful end-to-end encrypted applications. It can be used for various applications beyond messaging. Interested? Contact us to learn more!",
  "needleTailIRCTitle": "NeedleTailIRC",
  "needleTailIRCDescription": "A modern IRC client library for Swift applications. NeedleTailIRC provides a robust, type-safe interface for connecting to IRC servers, handling channels, and managing real-time communication. Built with Swift Concurrency for optimal performance.",
  "connectionManagerKitTitle": "ConnectionManagerKit",
  "connectionManagerKitDescription": "A comprehensive connection management framework for Swift applications. ConnectionManagerKit simplifies network connectivity, connection pooling, and connection lifecycle management. Perfect for applications requiring reliable network communication.",
  "postQuantumSolaceTitle": "PostQuantumSolace",
  "postQuantumSolaceDescription": "A post-quantum cryptography library for Swift applications. PostQuantumSolace provides quantum-resistant cryptographic algorithms and protocols, ensuring your applications remain secure in the quantum computing era.",
  "whiteTippedSocketsTitle": "White Tipped Sockets",
  "whiteTippedSocketsDescription": "WhiteTippedSockets is a native WebSocket library for iOS and macOS, built on the Network.framework API using Swift Concurrency. Our goal is to provide a modern, efficient solution for WebSocket communication, and we also plan to develop a fully functional, scalable server in the future.",
  "swiftHlsTitle": "Swift HLS",
  "swiftHlsDescription": "HTTP Live Streaming (HLS) is a key technology for efficient media streaming, and SwiftHLS is designed to facilitate this. Utilizing the same protocol that powers the web, HLS allows content delivery via REST APIs and CDNs. Its purpose is to provide reliability and dynamically adapts to network conditions.",
  "swiftIapTitle": "Swift IAP",
  "swiftIapDescription": "SwiftIAP is a comprehensive In-App Purchase library for iOS and macOS applications. It provides a modern, type-safe interface for handling in-app purchases, subscriptions, and receipt validation. Built with Swift Concurrency and designed for ease of use.",
  "stompTitle": "Stomp",
  "stompDescription": "Stomp is a Swift library for STOMP protocol communication. It provides a modern, type-safe interface for connecting to STOMP servers and handling message routing. Perfect for applications that need reliable messaging infrastructure.",
  "accept": "I agree and accept",
  "cookieConsentTitle": "We use browser storage",
  "cookieConsentMessage": "We use browser storage to remember your language preference and enhance your browsing experience. By clicking 'Accept All', you consent to our use of browser storage.",
  "cookieConsentAcceptAll": "Accept All",
  "cookieConsentAcceptNecessary": "Accept Necessary Only",
  "cookieConsentReject": "Reject All",
  "cookieConsentLearnMore": "Learn More",
  "cookieConsentNecessary": "Necessary storage includes language detection to provide content in your preferred language.",
  "cookieConsentAnalytics": "We do not currently use analytics tracking on this website.",
  "cookieConsentPreferences": "Preference storage remembers your settings like theme and user preferences to personalize your experience.",
  "cookieConsentMarketing": "We do not currently use marketing tracking or advertising on this website.",
  "privacy": "Privacy Policy",
  "termsConditions": "Terms and Conditions",
  "projectTitle_1": "Projects",
  "projectHeader_1": "PQSRTC",
  "projectTitleText_1": "RTC VoIP Solution",
  "projectTitle_2": "Projects",
  "projectHeader_2": "NeedleTailKit",
  "projectTitleText_2": "End-to-End Encryption Messaging Solution",
  "projectTitle_3": "Projects",
  "projectHeader_3": "White Tipped Sockets",
  "projectTitleText_3": "Swift Concurrent Network.framework Wrapper",
  "projectTitle_4": "Projects",
  "projectHeader_4": "Swift Stomp",
  "projectTitleText_4": "Swift Concurrent STOMP Protocol",
  "projectTitle_5": "Projects",
  "projectHeader_5": "Swift HLS",
  "projectTitleText_5": "Swift HLS Project",
  "pageNotFound": "Page Not Found",
  "pageNotFoundDescription": "The page you're looking for doesn't exist or has been moved. Let's get you back on track.",
  "goHome": "Go Home",
  "goBack": "Go Back",
  "contact": "Contact",
  "contactUs": "Contact Us",
  "becomeASponsor": "Become a Sponsor",
  "supportOpenSourceMessage": "Support our open source projects and help us continue building amazing software.",
  "getStartedOnDigitalOcean": "Get Started on Digital Ocean with a $100, 60-day credit for new users.",
  "readyToGetStarted": "Ready to Get Started?",
  "letsDiscussProject": "Let's discuss your project and see how we can help bring your ideas to life with Swift-powered solutions.",
  "backToTop": "Back to Top",
  "needleTailsCopyright": "NeedleTails©",
  "welcomeToNeedleTails": "Welcome to NeedleTails - Your Software Development Ally",
  "pointsForConsideration": "Points for Consideration",
  "responsiveDesign": "Responsive Design",
  "responsiveDesignDescription": "Ensure your website is responsive and works well on various devices and screen sizes for an optimal user experience.",
  "crossBrowserCompatibility": "Cross-Browser Compatibility",
  "crossBrowserCompatibilityDescription": "Test your web application across different browsers to ensure consistent functionality and appearance.",
  "webPerformanceOptimizationDescription": "Focus on optimizing load times and overall performance by minimizing file sizes, using efficient coding practices, and leveraging caching.",
  "userExperience": "User Experience (UX)",
  "userExperienceDescription": "Prioritize intuitive navigation, clear calls to action, and accessibility features to enhance user engagement.",
  "securityPractices": "Security Practices",
  "securityPracticesDescription": "Implement essential security measures, such as HTTPS, data validation, and protection against common vulnerabilities like SQL injection and cross-site scripting (XSS).",
  "seoBestPractices": "SEO Best Practices",
  "seoBestPracticesDescription": "Optimize your website for search engines by using proper HTML structure, meta tags, and relevant keywords to improve visibility and ranking.",
  "backendSolutionsHeader": "Server-Side Solutions",
  "backendSolutionsDescription": "Server-Side First: We focus on developing your backend projects by prioritizing the server's needs. This approach allows us to create scalable solutions that drive business growth and ensure the success of your projects.",
  "backendCapabilitiesOverview": "Our backend expertise is anchored in server-side Swift, utilizing the power and versatility of the Swift programming language. We excel in crafting secure, high-performance backend solutions that are tailored to your unique requirements. Whether you need to implement modern standard protocols or develop a custom protocol designed specifically for your needs, our team harnesses Swift's exceptional capabilities to drive your business forward.",
  "scalability": "Scalability",
  "scalabilityDescription": "Design your architecture to handle growth in user traffic and data volume. Consider using microservices or serverless architectures to allow for easy scaling of individual components.",
  "security": "Security",
  "securityDescription": "Implement key security practices, such as data encryption and secure authentication, to protect user data and reduce vulnerabilities.",
  "maintainability": "Maintainability",
  "maintainabilityDescription": "Write clean, modular, and well-documented code to facilitate easier maintenance and updates. Consider using version control systems and adopting coding standards to ensure consistency across the team.",
  "testingAndQualityAssurance": "Testing and Quality Assurance",
  "testingAndQualityAssuranceDescription": "Establish a testing strategy that includes unit and integration tests. Use continuous integration practices to automate testing and maintain code quality.",
  "monitoringAndLogging": "Monitoring and Logging",
  "monitoringAndLoggingDescription": "Implement basic monitoring and logging to track performance and identify issues. Focus on tools that provide essential insights, allowing you to address problems and improve the system over time.",
  "nativeAppDevelopmentHeader": "Native Application Development",
  "nativeAppDevelopmentDescription": "We elevate your projects into sophisticated native experiences, meticulously crafted for that native look and feel.",
  "nativeAppDevelopmentOverview": "Our team specializes in creating applications for a wide array of Apple platforms and Android devices. With extensive experience in developing seamless, intuitive, and high-performance applications, we cater to iOS, iPadOS, macOS, tvOS, watchOS, and visionOS. For Android, we ensure a native look and feel that enhances user engagement. We are committed to security, implementing best practices to protect user data and ensure a safe experience. Our expertise allows us to design and build applications that are visually appealing, user-friendly, and deliver exceptional performance. Whether you need a polished mobile app, a powerful desktop application, or an engaging TV interface, we provide solutions that guarantee an outstanding user experience across all devices.",
  "designConsistency": "Design Consistency",
  "designConsistencyDescription": "Maintain a consistent design and user experience across Swift client applications and Android platforms to enhance usability.",
  "deviceFragmentation": "Device Fragmentation",
  "deviceFragmentationDescription": "Test on various devices and screen sizes, especially for Android.",
  "userExperienceUX": "User Experience (UX)",
  "userExperienceUXDescription": "Ensure intuitive navigation and accessibility for all users.",
  "distributionCompliance": "Distribution Compliance",
  "distributionComplianceDescription": "Ensure your app meets the requirements for various distribution channels, including app stores and alternative platforms.",
  "webDevelopmentExpertiseHeader": "Web Application Development",
  "webDevelopmentExpertiseDescription": "We leverage our in-depth expertise to build and sustain a strong online presence for your business.",
  "webDevelopmentOverview": "In the field of web development, we provide a diverse array of services that enable customers to utilize various types of websites, including portfolio sites to showcase creative work, blogs for sharing content, corporate websites to represent businesses, interactive web applications for specific functionalities, and targeted landing pages for marketing campaigns. Our technology stack features Vue.js with TypeScript, along with Swift solutions like Vapor, Hummingbird 2, and Toucan. Utilizing these technologies, we create responsive and user-friendly web experiences, delivering solutions that are both visually engaging and functionally robust.",
  "brewhubWidgetTitle": "Learn with BrewHub",
  "brewhubWidgetDescription": "Professional software development courses and training platform.",
  "brewhubWidgetCTA": "Explore Courses",
  "brewhubComingSoonTitle": "Coming Soon",
  "brewhubComingSoonDescription": "BrewHub is currently under development. We're building an amazing platform for professional software development courses and training. Stay tuned for updates!",
  "brewhubFeature1Title": "Expert Courses",
  "brewhubFeature1Description": "Access professional software development courses taught by industry experts.",
  "brewhubFeature2Title": "Live Training",
  "brewhubFeature2Description": "Participate in guided, live training sessions with production-grade tooling.",
  "brewhubFeature3Title": "Community",
  "brewhubFeature3Description": "Join a community of developers and learn together.",
  "brewhubFeature4Title": "Production Tools",
  "brewhubFeature4Description": "Learn with the same tools and workflows used in production environments.",
  "brewhubBackToMainSite": "Back to NeedleTails"
}