{
  "introHeaderTwo": "Usted tiene la visión; nosotros entregamos la solución. Ya sea una app móvil, un sitio web moderno o un sistema de software completo, convertimos sus retos en productos seguros y fiables. Con experiencia empresarial en móvil, web y servidor, construimos e integramos soluciones que escalan—para que usted se enfoque en su negocio.",
  "menuItemOne": "Cursos",
  "menuItemTwo": "Consultoría",
  "menuItemThree": "Gestión",
  "getInTouch": "Ponte en Contacto",
  "projectsHeader": "Nuestro Software",
  "projectsDescription": "Nos dedicamos a proporcionarte una amplia gama de software de código abierto. Para apoyar esta misión, también ofrecemos software de código cerrado. Te invitamos a explorar nuestros proyectos, que incluyen tanto opciones de código abierto como de código cerrado. Si estás interesado en contribuir u obtener una licencia para nuestro software de código cerrado, no dudes en contactarnos.",
  "projectsOverview": "Aquí tienes una lista de lo que hacemos y lo que hemos hecho",
  "businessOverviewTitle": "Especialistas en Software Swift",
  "badgeMobile": "Móvil",
  "badgeWeb": "Web",
  "badgeServer": "Servidor",
  "businessOverviewDescription": "Convertimos sus retos de software en soluciones listas para producción. Ya necesite una nueva app, un sitio web moderno o sistemas que se integren sin fricciones, entregamos en móvil, web y servidor—en el lenguaje adecuado para su proyecto. Nuestra experiencia en Swift aporta seguridad de tipos, rendimiento y fiabilidad; también integramos con su stack actual. Cuente con nosotros para soluciones que perduran y escalan con su negocio.",
  "serviceHeaderBackendDevelopment": "Backend y APIs",
  "serviceDescriptionBackendDevelopment": "Resuelva retos de escalabilidad e integración con soluciones robustas del lado del servidor. Construimos y conectamos APIs, bases de datos y servicios para que sus apps y sitios funcionen con fiabilidad a cualquier escala.",
  "serviceHeaderMobileAppDevelopment": "Apps Móviles",
  "serviceDescriptionMobileAppDevelopment": "Obtenga una app nativa que los usuarios adoren. Desarrollamos apps iOS, Android y multiplataforma que resuelven problemas reales—a tiempo y listas para la tienda.",
  "serviceHeaderTraining": "BrewHub",
  "serviceDescriptionTraining": "Forme a su equipo con cursos profesionales de desarrollo de software. Formación guiada en vivo con herramientas de nivel producción para que puedan construir y mantener soluciones internamente.",
  "serviceHeaderWebDevelopment": "Desarrollo Web",
  "serviceDescriptionWebDevelopment": "Sitios y aplicaciones web que funcionan en todas partes. Entregamos experiencias responsivas, rápidas y seguras que atraen usuarios y apoyan los objetivos de su negocio.",
  "openSourceHeader": "Código Abierto",
  "openSourceDescription": "Creemos en el poder del código abierto. Explora nuestros proyectos en GitHub y contribuye a la comunidad. Tu apoyo nos ayuda a continuar desarrollando soluciones innovadoras.",
  "whyChooseSwift": "¿Por qué Elegir Swift?",
  "typeSafety": "Seguridad de Tipos",
  "typeSafetyDescription": "El sistema de tipos de Swift previene errores en tiempo de compilación, asegurando que tus aplicaciones sean robustas y confiables desde el primer día.",
  "performance": "Rendimiento",
  "performanceDescription": "Baja huella de memoria y alto rendimiento hacen de Swift ideal para entornos con recursos limitados y aplicaciones exigentes.",
  "threadSafety": "Seguridad de Hilos",
  "threadSafetyDescription": "El soporte de concurrencia integrado asegura que tus aplicaciones manejen múltiples tareas eficientemente sin condiciones de carrera.",
  "ourServices": "Cómo Resolvemos Sus Retos",
  "servicesDescription": "Del concepto al lanzamiento y más allá, entregamos las apps, sitios web e integraciones que necesita. Cuéntenos su reto—diseñamos, construimos y damos soporte a la solución.",
  "startYourProject": "Inicia tu Proyecto",
  "swiftNative": "Nativo",
  "support": "Soporte",
  "possibilities": "Posibilidades",
  "makingYour": "Haciendo tus",
  "ideasReality": "Ideas en Realidad",
  "swiftSoftwareSpecialists": "Especialistas en Software Swift",
  "swift": "Swift",
  "swiftServer": "Swift-Servidor",
  "frequentlyAskedQuestions": "Preguntas Frecuentes",
  "faqDescription": "Obtén respuestas a preguntas comunes sobre nuestros servicios de desarrollo de software",
  "faqTechnologies": "¿En qué tecnologías se especializan?",
  "faqTechnologiesAnswer": "Nos especializamos en desarrollo web moderno usando una amplia gama de tecnologías incluyendo, pero no limitado a Nuxt, Vue, Vapor y SwiftNIO. Nuestra experiencia en lenguajes incluye TypeScript y Swift. También trabajamos con soluciones backend robustas, servicios en la nube, APIs y arquitectura escalable para entregar aplicaciones de alto rendimiento.",
  "faqTimeline": "¿Cuánto tiempo toma un proyecto típico?",
  "faqTimelineAnswer": "Los cronogramas de proyectos varían según la complejidad. Las aplicaciones web simples toman 4-8 semanas, mientras que las soluciones empresariales complejas pueden tomar 3-6 meses. Proporcionamos cronogramas detallados durante la consulta.",
  "faqSupport": "¿Proporcionan soporte y mantenimiento continuo?",
  "faqSupportAnswer": "Sí, ofrecemos paquetes de soporte integrales incluyendo monitoreo 24/7, actualizaciones regulares, parches de seguridad y mejoras de características para asegurar que tu aplicación permanezca actualizada y segura.",
  "faqProcess": "¿Cuál es su proceso de desarrollo?",
  "faqProcessAnswer": "Seguimos un enfoque colaborativo con comunicación regular del cliente, desarrollo iterativo y pruebas continuas. Nuestro proceso incluye fases de planificación, diseño, desarrollo, pruebas e implementación.",
  "faqIntegration": "¿Pueden trabajar con sistemas y APIs existentes?",
  "faqIntegrationAnswer": "¡Absolutamente! Tenemos amplia experiencia integrando con sistemas existentes, APIs y bases de datos. Podemos mejorar, modernizar o reconstruir completamente tu infraestructura actual.",
  "faqSecurity": "¿Qué hay sobre seguridad y protección de datos?",
  "faqSecurityAnswer": "La seguridad es el valor predeterminado en todo lo que construimos. Implementamos prácticas de desarrollo de software impulsadas por la seguridad, medidas de seguridad estándar de la industria, encriptación de datos y auditorías de seguridad regulares para proteger tus datos y la información de tus usuarios.",
  "consultingTitle": "Your Challenges, Our Expertise",
  "consultingOverview": "Whether you're defining a new product, modernizing legacy systems, or choosing stack and architecture—we provide structured guidance so your decisions are informed by experience and aligned with your business goals.",
  "consultWithUs": "Discuss Your Initiative",
  "consultingWithUsMessage": "Share your goals, constraints, and timeline. We'll outline options, trade-offs, and a clear path forward—including scope, technology, and what it takes to get there.",
  "whatToConsultAbout": "What We Can Help With",
  "architectureDesign": "Architecture & System Design",
  "architectureDesignDescription": "Scalable, maintainable architectures for new and existing systems. We help you choose patterns, boundaries, and integration approaches so your solution is fit for production and future growth.",
  "technologySelection": "Technology & Stack Selection",
  "technologySelectionDescription": "Objective evaluation of technologies and vendors against your requirements, team skills, and long-term maintainability. We help you select a stack that balances delivery speed, cost, and risk.",
  "performanceOptimization": "Performance & Scalability",
  "performanceOptimizationDescription": "Response times, throughput, and resource usage. We apply caching, load balancing, query optimization, and capacity planning so your systems perform under load and stay cost-effective.",
  "securityReview": "Security & Compliance Review",
  "securityReviewDescription": "Security posture and compliance alignment. We assess design and implementation against common threats and frameworks so your applications and data meet business and regulatory expectations.",
  "codeReview": "Code & Implementation Review",
  "codeReviewDescription": "Expert review of code quality, patterns, and technical debt. We provide actionable feedback so your codebase stays maintainable, testable, and aligned with best practices.",
  "bestPractices": "Process & Best Practices",
  "bestPracticesDescription": "Development process, DevOps, and delivery practices. We help you adopt workflows that improve predictability, quality, and team efficiency.",
  "trainingProgramsHeader": "Programas de Capacitación",
  "trainingProgramsDescription": "Soluciones de desarrollo profesional y capacitación",
  "trainingOverview": "Programas de capacitación integrales para mejorar las habilidades de tu equipo",
  "trainingCourses": "Cursos de Capacitación",
  "vueJsDevelopment": "Desarrollo Vue.js",
  "vueJsDevelopmentDescription": "Aprende prácticas modernas de desarrollo Vue.js con Nuxt",
  "swiftBackendDevelopment": "Desarrollo Backend Swift",
  "swiftBackendDevelopmentDescription": "Domina el desarrollo backend Swift con Vapor y SwiftNIO",
  "typescriptDevelopment": "Desarrollo TypeScript",
  "typescriptDevelopmentDescription": "Construye aplicaciones robustas con TypeScript",
  "securityFirstDevelopment": "Desarrollo Seguridad-Primero",
  "securityFirstDevelopmentDescription": "Implementa prácticas de desarrollo de software impulsadas por la seguridad",
  "productManagementExpertiseHeader": "Product Management",
  "productManagementExpertiseDescription": "Structured product management to align vision, roadmap, and delivery with business outcomes.",
  "productManagementOverview": "We support product-led organizations with discovery, prioritization, and lifecycle practices. From requirements and market insight through UX and roadmap planning, we help you ship the right features at the right time and keep stakeholders aligned.",
  "productManagementPoints": "Key Disciplines",
  "requirementsGathering": "Requirements & Discovery",
  "requirementsGatheringDescription": "Structured elicitation and documentation of functional and non-functional requirements. We capture clear, actionable specs so development and stakeholders share a single source of truth.",
  "marketResearch": "Market & User Research",
  "marketResearchDescription": "Evidence-based understanding of users, competitors, and market fit. We support product decisions with research so roadmaps are grounded in real demand and usage.",
  "userExperienceDesign": "User Experience Design",
  "userExperienceDesignDescription": "User-centered flows, information architecture, and interaction design. We align UX with business goals and accessibility so products are usable and compliant.",
  "productStrategy": "Product Strategy",
  "productStrategyDescription": "Vision, positioning, and roadmap aligned with business objectives. We help define and communicate strategy so teams and stakeholders move in the same direction.",
  "featurePrioritization": "Feature Prioritization",
  "featurePrioritizationDescription": "Framework-driven prioritization (value, effort, risk). We help you decide what to build next so capacity is focused on the highest-impact work.",
  "stakeholderManagement": "Stakeholder Management",
  "stakeholderManagementDescription": "Clear communication, expectations, and alignment with internal and external stakeholders. We keep everyone informed and bought in so delivery stays on track.",
  "projectManagementExpertiseHeader": "Project Management",
  "projectManagementExpertiseDescription": "Delivery discipline so your software projects stay on scope, schedule, and quality.",
  "projectManagementOverview": "We apply proven project management practices—planning, tracking, risk and resource management—tailored to your team size and methodology. We keep projects visible and predictable so you can deliver on commitments and adapt when priorities change.",
  "projectManagementPoints": "Key Disciplines",
  "projectPlanning": "Project Planning",
  "projectPlanningDescription": "Scoped plans, milestones, and dependencies. We define clear deliverables and timelines so execution is predictable and aligned with business goals.",
  "resourceManagement": "Resource Management",
  "resourceManagementDescription": "Capacity planning and allocation across teams and sprints. We help balance workload and skills so delivery stays sustainable and on track.",
  "riskManagement": "Risk Management",
  "riskManagementDescription": "Identification, assessment, and mitigation of technical and project risks. We surface and address risks early so issues don’t derail delivery.",
  "qualityAssurance": "Quality Assurance",
  "qualityAssuranceDescription": "Quality gates, acceptance criteria, and release readiness. We ensure standards are met so releases are reliable and supportable.",
  "overview": "Resumen",
  "privacyPolicyTitle": "Política de Privacidad",
  "effectiveDate": "Fecha Efectiva",
  "effectiveDateValue": "10/05/2024",
  "introduction": "Introducción",
  "informationWeDoNotCollect": "Información que No Recolectamos",
  "informationCollectedByServers": "Información Recolectada por Servidores y Tecnologías",
  "legalUse": "Uso Legal",
  "limitationOfLiability": "Limitación de Responsabilidad",
  "changesToPolicy": "Cambios a esta Política de Privacidad",
  "privacyWelcomeMessage": "Bienvenido a NeedleTails.com. Tu privacidad es importante para nosotros.",
  "privacyPurpose": "Esta Política de Privacidad describe nuestras prácticas respecto a la recolección de información cuando visitas nuestro sitio.",
  "personalInformation": "No recolectamos ninguna información personal de nuestros usuarios.",
  "informationOverview": "Aunque no recolectamos información personal, ten en cuenta que los servidores y otras tecnologías pueden recolectar cierta información automáticamente.",
  "legalUseOverview": "Al usar nuestro Sitio, aceptas cumplir con todas las leyes y regulaciones locales aplicables.",
  "userResponsibility": "Es tu responsabilidad asegurar que tu uso del Sitio sea legal en tu jurisdicción.",
  "privacyLimitationOverview": "El autor de este sitio web no será responsable por ningún daño o pérdida que surja de tu uso del Sitio.",
  "privacyUserAcknowledgment": "Al usar el Sitio, reconoces que lo haces bajo tu propio riesgo y que el autor no es responsable por ninguna consecuencia resultante de tu uso.",
  "privacyChangesToPolicy": "Podemos actualizar nuestra Política de Privacidad de vez en cuando. Te notificaremos de cualquier cambio publicando la nueva Política de Privacidad en esta página. Se te aconseja revisar esta Política de Privacidad periódicamente para cualquier cambio.",
  "cookies": "Cookies",
  "cookiesDescription": "Se pueden usar cookies para mejorar la experiencia del usuario. Estas pueden incluir:",
  "sessionCookies": "Cookies de Sesión: Cookies temporales que expiran cuando cierras tu navegador.",
  "persistentCookies": "Cookies Persistentes: Cookies que permanecen en tu dispositivo por un período establecido o hasta que se eliminen.",
  "analytics": "Analíticas",
  "analyticsDescription": "Podemos usar servicios de analíticas de terceros que recolectan información sobre el uso del sitio web, como:",
  "pageViews": "Vistas de Página",
  "userInteractions": "Interacciones de Usuario",
  "trafficSources": "Fuentes de Tráfico",
  "serverLogs": "Registros del Servidor",
  "serverLogsDescription": "Los servidores web pueden registrar información sobre tu visita, incluyendo:",
  "ipAddress": "Dirección IP",
  "browserType": "Tipo de Navegador",
  "operatingSystem": "Sistema Operativo",
  "referringUrl": "URL de Referencia",
  "pagesVisited": "Páginas Visitadas",
  "timeAndDateOfAccess": "Hora y Fecha de Acceso",
  "termsTitle": "Términos y Condiciones",
  "termsEffectiveDate": "Fecha Efectiva: 10/05/2024",
  "userAgreement": "Acuerdo de Usuario",
  "prohibitedActivities": "Actividades Prohibidas",
  "changesToTerms": "Cambios a estos Términos",
  "termsWelcomeMessage": "Bienvenido a nuestros Términos y Condiciones.",
  "termsPurpose": "Estos términos rigen tu uso de nuestros servicios.",
  "userAgreementText": "Al usar nuestros servicios, aceptas estos términos.",
  "prohibitedActivitiesOverview": "Las siguientes actividades están prohibidas:",
  "usingServiceForIllegalPurposes": "Usar el servicio para propósitos ilegales.",
  "engagingInHarassment": "Participar en cualquier forma de acoso o abuso.",
  "unauthorizedAccess": "Intentar obtener acceso no autorizado a nuestros sistemas.",
  "distributingMalware": "Distribuir software malicioso o virus.",
  "termsLimitationOverview": "No somos responsables por ningún daño indirecto, incidental o consecuente.",
  "termsUserAcknowledgment": "Reconoces que usas nuestros servicios bajo tu propio riesgo.",
  "termsChangesToTerms": "Podemos actualizar estos términos de vez en cuando. Por favor revísalos regularmente.",
  "spineTailedKitTitle": "PQSRTC",
  "spineTailedKitDescription": "PQSRTC busca ofrecer un protocolo RTC simplificado en Swift, con cifrado poscuántico como valor predeterminado. Es un SDK basado en WebRTC que se centra en proporcionar una solución moderna, segura y de alto rendimiento para aplicaciones de voz y video tanto en Android como en plataformas Apple, con lógica compartida escrita en Swift.",
  "needleTailKitTitle": "NeedleTailKit",
  "needleTailKitDescription": "¿Qué es NeedleTailKit? NTK es el SDK principal para Aplicaciones Cliente y Servidor NeedleTail, permitiendo la creación de hermosas aplicaciones encriptadas de extremo a extremo. Puede usarse para varias aplicaciones más allá de mensajería. ¿Interesado? ¡Contáctanos para aprender más!",
  "needleTailIRCTitle": "NeedleTailIRC",
  "needleTailIRCDescription": "Una biblioteca cliente IRC moderna para aplicaciones Swift. NeedleTailIRC proporciona una interfaz robusta y segura para conectarse a servidores IRC, manejar canales y gestionar comunicación en tiempo real. Construida con Swift Concurrency para un rendimiento óptimo.",
  "connectionManagerKitTitle": "ConnectionManagerKit",
  "connectionManagerKitDescription": "Un framework completo de gestión de conexiones para aplicaciones Swift. ConnectionManagerKit simplifica la conectividad de red, el agrupamiento de conexiones y la gestión del ciclo de vida de las conexiones. Perfecto para aplicaciones que requieren comunicación de red confiable.",
  "postQuantumSolaceTitle": "PostQuantumSolace",
  "postQuantumSolaceDescription": "Una biblioteca de criptografía post-cuántica para aplicaciones Swift. PostQuantumSolace proporciona algoritmos y protocolos criptográficos resistentes a la computación cuántica, asegurando que tus aplicaciones permanezcan seguras en la era de la computación cuántica.",
  "whiteTippedSocketsTitle": "White Tipped Sockets",
  "whiteTippedSocketsDescription": "WhiteTippedSockets es una biblioteca WebSocket nativa para iOS y macOS, construida sobre la API Network.framework usando Swift Concurrency. Nuestro objetivo es proporcionar una solución moderna y eficiente para comunicación WebSocket, y también planeamos desarrollar un servidor completamente funcional y escalable en el futuro.",
  "swiftHlsTitle": "Swift HLS",
  "swiftHlsDescription": "HTTP Live Streaming (HLS) es una tecnología clave para transmisión eficiente de medios, y SwiftHLS está diseñado para facilitar esto. Utilizando el mismo protocolo que impulsa la web, HLS permite entrega de contenido vía APIs REST y CDNs. Su propósito es proporcionar confiabilidad y se adapta dinámicamente a las condiciones de red.",
  "swiftIapTitle": "Swift IAP",
  "swiftIapDescription": "SwiftIAP es una biblioteca integral de Compras en la Aplicación para aplicaciones iOS y macOS. Proporciona una interfaz moderna y segura de tipos para manejar compras en la aplicación, suscripciones y validación de recibos. Construida con Swift Concurrency y diseñada para facilidad de uso.",
  "stompTitle": "Stomp",
  "stompDescription": "Stomp es una biblioteca Swift para comunicación de protocolo STOMP. Proporciona una interfaz moderna y segura de tipos para conectarse a servidores STOMP y manejar enrutamiento de mensajes. Perfecto para aplicaciones que necesitan infraestructura de mensajería confiable.",
  "privacy": "Política de Privacidad",
  "termsConditions": "Términos y Condiciones",
  "projectTitle_1": "Proyectos",
  "projectHeader_1": "PQSRTC",
  "projectTitleText_1": "Solución RTC VoIP",
  "projectTitle_2": "Proyectos",
  "projectHeader_2": "NeedleTailKit",
  "projectTitleText_2": "Solución de Mensajería Encriptada de Extremo a Extremo",
  "projectTitle_3": "Proyectos",
  "projectHeader_3": "White Tipped Sockets",
  "projectTitleText_3": "Wrapper Swift Concurrent de Network.framework",
  "projectTitle_4": "Proyectos",
  "projectHeader_4": "Swift Stomp",
  "projectTitleText_4": "Protocolo STOMP Swift Concurrent",
  "projectTitle_5": "Proyectos",
  "projectHeader_5": "Swift HLS",
  "projectTitleText_5": "Proyecto Swift HLS",
  "pageNotFound": "Página No Encontrada",
  "pageNotFoundDescription": "La página que buscas no existe o ha sido movida. Te ayudemos a volver al camino correcto.",
  "goHome": "Ir al Inicio",
  "goBack": "Volver",
  "contact": "Contacto",
  "contactUs": "Contáctanos",
  "becomeASponsor": "Conviértete en un Patrocinador",
  "supportOpenSourceMessage": "Apoya nuestros proyectos de código abierto y ayúdanos a continuar construyendo software increíble.",
  "getStartedOnDigitalOcean": "Comienza en Digital Ocean con un crédito de $100 por 60 días para nuevos usuarios.",
  "readyToGetStarted": "¿Listo para Comenzar?",
  "letsDiscussProject": "Hablemos de tu proyecto y veamos cómo podemos ayudar a hacer realidad tus ideas con soluciones impulsadas por Swift.",
  "backToTop": "Volver Arriba",
  "needleTailsCopyright": "NeedleTails©",
  "pointsForConsideration": "Puntos para Considerar",
  "responsiveDesign": "Responsive & Adaptive Design",
  "responsiveDesignDescription": "Layouts and components that adapt to all viewports and devices. We deliver consistent, high-quality experiences on desktop, tablet, and mobile so your web product works everywhere your users are.",
  "crossBrowserCompatibility": "Cross-Browser & Standards Compliance",
  "crossBrowserCompatibilityDescription": "Testing and compatibility across major browsers and standards. We ensure consistent behavior and appearance so your application works reliably for every user, regardless of browser or device.",
  "webPerformanceOptimizationDescription": "Performance budgets, lazy loading, and optimized assets. We minimize load times and resource usage through efficient code, caching, and CDN strategies so your site feels fast and remains cost-effective at scale.",
  "userExperience": "User Experience & Accessibility",
  "userExperienceDescription": "Clear information architecture, intuitive navigation, and WCAG-aligned accessibility. We design and implement UX that drives engagement and meets enterprise usability and compliance expectations.",
  "securityPractices": "Security & Data Protection",
  "securityPracticesDescription": "HTTPS, secure headers, input validation, and protection against OWASP-top risks including XSS and CSRF. We harden web applications so your data and your users stay secure in production.",
  "seoBestPractices": "SEO & Discoverability",
  "seoBestPracticesDescription": "Semantic structure, meta tags, and content strategy aligned with search best practices. We optimize for discoverability and ranking so your web presence supports your business and marketing goals.",
  "backendSolutionsHeader": "Server-Side Solutions",
  "backendSolutionsDescription": "We design and deliver production-grade backends that power your business. Our server-first approach ensures APIs, data pipelines, and integrations are built for reliability, compliance, and scale—so your applications perform under real-world load and security requirements.",
  "backendCapabilitiesOverview": "Our server-side practice is built on Swift (Vapor, Hummingbird, SwiftNIO) and proven cloud-native patterns. We deliver secure, high-performance backends—REST and custom APIs, event-driven systems, and seamless integration with your existing stack. From architecture through deployment and observability, we own the full lifecycle so your teams can focus on product, not infrastructure.",
  "scalability": "Scalability & Resilience",
  "scalabilityDescription": "Architectures designed for growth: horizontal scaling, stateless services, and resilient patterns. We apply microservices, serverless, and queue-based designs so your backend handles traffic spikes and data growth without rework.",
  "security": "Security & Compliance",
  "securityDescription": "Robust security by default: encryption at rest and in transit, identity and access control, audit trails, and alignment with common compliance frameworks. We harden backends so your data and your users stay protected.",
  "maintainability": "Maintainability & Standards",
  "maintainabilityDescription": "Clean, modular, and well-documented codebases with consistent patterns and version control. We adopt and document coding standards so your team can maintain and extend the system with confidence.",
  "testingAndQualityAssurance": "Testing & Quality Assurance",
  "testingAndQualityAssuranceDescription": "Rigorous testing strategies: unit, integration, and contract tests with CI/CD automation. We maintain high quality and regression safety so releases are predictable and low-risk.",
  "monitoringAndLogging": "Monitoring & Observability",
  "monitoringAndLoggingDescription": "Production-ready observability: structured logging, metrics, and alerting. We instrument backends so you have clear visibility into health, performance, and incidents—and can respond before users are affected.",
  "nativeAppDevelopmentHeader": "Native Application Development",
  "nativeAppDevelopmentDescription": "We deliver native applications built for performance, security, and great user experience—on every platform your business requires.",
  "nativeAppDevelopmentOverview": "We build production-ready native apps for the full Apple ecosystem (iOS, iPadOS, macOS, tvOS, watchOS, visionOS) and Android. Our work emphasizes type-safe Swift and Kotlin/Java, platform-appropriate UX, accessibility, and security-by-design. From MVPs to large-scale deployments, we handle architecture, store readiness, and ongoing support so your apps stay performant, compliant, and maintainable.",
  "designConsistency": "Design Systems & Consistency",
  "designConsistencyDescription": "Unified design systems and component libraries across platforms. We ensure consistent branding, interaction patterns, and accessibility so your product feels cohesive on every device.",
  "deviceFragmentation": "Device & Platform Coverage",
  "deviceFragmentationDescription": "Structured testing across device matrices, screen sizes, and OS versions. We validate behavior and performance so your app works reliably for all target users, including edge cases.",
  "userExperienceUX": "User Experience & Accessibility",
  "userExperienceUXDescription": "Intuitive flows, clear information architecture, and WCAG-aligned accessibility. We design and implement UX that serves all users and supports usability and compliance goals.",
  "distributionCompliance": "Distribution & Store Compliance",
  "distributionComplianceDescription": "App Store and Play Store readiness: guidelines, privacy labels, and review best practices. We prepare and maintain your apps for public and private distribution channels.",
  "webDevelopmentExpertiseHeader": "Web Application Development",
  "webDevelopmentExpertiseDescription": "We build and maintain web applications that support your business goals—from marketing sites and portals to full-stack web apps that integrate with your existing systems.",
  "webDevelopmentOverview": "We deliver production-grade web experiences: responsive sites, SPAs, and full-stack applications built with Vue.js, Nuxt, and TypeScript on the front end, and Vapor, Hummingbird, or your preferred backend. Our work covers corporate sites, customer portals, internal tools, and public-facing apps—with a focus on performance, security, SEO, and maintainability so your web presence scales with your organization.",
  "solutionsTitle": "Nuestras Soluciones",
  "featuredApplications": "Aplicaciones Destacadas",
  "our": "Nuestras",
  "featuredApps": "Apps Destacadas",
  "featuredAppsDescription": "Descubre nuestras aplicaciones innovadoras que muestran el poder del desarrollo Swift y la arquitectura de software moderna.",
  "nudgeTitle": "Secure Messaging You Control",
  "nudgeDescription": "End-to-end encrypted messaging with optional self-hosting. Your data stays yours—no third-party storage, no persistence risk. Run your own instance or scale globally.",
  "islandHoppersTitle": "Island Hoppers: ¡Tu App de Tours Definitiva para Aventuras Sin Problemas!",
  "islandHoppersDescription": "Island Hoppers es la app todo-en-uno diseñada para mejorar tu experiencia de viaje, ya seas una empresa organizando tours inolvidables o un cliente buscando la escapada perfecta. Para empresas, nuestra app optimiza todo el proceso de gestión de tours. Organiza y personaliza tus tours sin esfuerzo, comunícate directamente con guías turísticos y mantén a tus clientes informados con actualizaciones en tiempo real. Con Island Hoppers, puedes gestionar reservas, rastrear preferencias de clientes y asegurar que cada detalle esté cuidado, permitiéndote enfocarte en entregar experiencias excepcionales. Para clientes, Island Hoppers ofrece una diversa gama de paquetes de tours adaptados para varios tipos de grupos, incluyendo familias, mochileros y entusiastas de fiestas. Navega por nuestra selección curada de aventuras, elige el paquete perfecto que se ajuste a tu estilo y conéctate con viajeros afines. Disfruta de comunicación fluida con tus guías turísticos, accede a información esencial y recibe recomendaciones personalizadas para aprovechar al máximo tu viaje. ¡Con Island Hoppers, embárcate en aventuras inolvidables con facilidad y confianza, sabiendo que cada aspecto de tu tour está a solo un toque de distancia!",
  "streamStackTitle": "Una Plataforma Educativa para tus Soluciones de Software",
  "streamStackDescription": "Transmite, Lee, Discute. Ya seas nuevo en programación o quieras leer sobre diferentes soluciones de software, te lo hacemos fácil con nuestra app Nuxt respaldada por Vapor. Mantente al día con las últimas tendencias de programación.",
  "welcomeToNeedleTails": "Bienvenido a NeedleTails - Tu Aliado en Desarrollo de Software",
  "accept": "Acepto y estoy de acuerdo",
  "cookieConsentTitle": "Usamos almacenamiento del navegador",
  "cookieConsentMessage": "Usamos almacenamiento del navegador para recordar tu preferencia de idioma y mejorar tu experiencia de navegación. Al hacer clic en 'Aceptar Todo', consientes nuestro uso del almacenamiento del navegador.",
  "cookieConsentAcceptAll": "Aceptar Todo",
  "cookieConsentAcceptNecessary": "Solo Necesarias",
  "cookieConsentReject": "Rechazar Todo",
  "cookieConsentLearnMore": "Más Información",
  "cookieConsentNecessary": "El almacenamiento necesario incluye la detección de idioma para proporcionar contenido en tu idioma preferido.",
  "cookieConsentAnalytics": "Actualmente no usamos seguimiento de análisis en este sitio web.",
  "cookieConsentPreferences": "El almacenamiento de preferencias recuerda tu configuración como tema y preferencias de usuario para personalizar tu experiencia.",
  "cookieConsentMarketing": "Actualmente no usamos seguimiento de marketing o publicidad en este sitio web.",
  "brewhubWidgetTitle": "BrewHub",
  "brewhubWidgetDescription": "Plataforma profesional de cursos e instrucción en desarrollo de software. Accede a capacitación guiada en vivo con herramientas y flujos de trabajo de nivel de producción para mejorar tus habilidades de desarrollo.",
  "brewhubWidgetCTA": "Cursos de Capacitación",
  "brewhubComingSoonTitle": "Disponible",
  "brewhubComingSoonDescription": "BrewHub ya está disponible. Visita brewhub.needletails.com para cursos y formación profesional en desarrollo de software.",
  "brewhubFeature1Title": "Cursos de expertos",
  "brewhubFeature1Description": "Accede a cursos profesionales de desarrollo de software impartidos por expertos del sector.",
  "brewhubFeature2Title": "Formación en vivo",
  "brewhubFeature2Description": "Formación en vivo individual o en pequeños grupos con guía directa de expertos.",
  "brewhubFeature3Title": "Comunidad",
  "brewhubFeature3Description": "Únete a una comunidad de desarrolladores y aprende en conjunto.",
  "brewhubFeature4Title": "Herramientas de producción",
  "brewhubFeature4Description": "Aprende con las mismas herramientas y flujos de trabajo usados en entornos de producción.",
  "brewhubBackToMainSite": "Ir a BrewHub",
  "brewhubMetaTitle": "BrewHub | NeedleTails",
  "brewhubMetaDescription": "BrewHub es la plataforma de NeedleTails para cursos y formación profesional en desarrollo de software.",
  "brewhubOgDescription": "Cursos y formación profesional en desarrollo de software.",
  "brewhubLogoAlt": "Logotipo de BrewHub",
  "needletailKitTitle": "NeedleTailKit",
  "needletailKitSubtitle": "Un SDK Swift completo y listo para producción para crear aplicaciones de mensajería seguras con cifrado de extremo a extremo y funciones de seguridad de nivel empresarial.",
  "needletailKitPrivateBadge": "SDK Privado - Se Requiere Licencia",
  "needletailKitRequestLicense": "Solicitar Licencia",
  "needletailKitExploreFeatures": "Explorar Características",
  "needletailKitFeaturesTitle": "Características de Nivel Empresarial",
  "needletailKitFeaturesDescription": "Construido para producción con seguridad de vanguardia y arquitectura Swift moderna.",
  "needletailKitSecurityTitle": "Seguridad Empresarial",
  "needletailKitSecurityPQ": "Criptografía Post-Cuántica - A prueba de futuros ataques cuánticos",
  "needletailKitSecurityDoubleRatchet": "Protocolo Double Ratchet - Secreto directo perfecto",
  "needletailKitSecurityE2E": "Cifrado de Extremo a Extremo - Todos los mensajes cifrados por defecto",
  "needletailKitSecurityDeviceVerification": "Verificación de Dispositivos - Vinculación criptográfica de dispositivos",
  "needletailKitPlatformTitle": "Soporte Multiplataforma",
  "needletailKitPlatformIOS": "iOS 18.0+ - Soporte nativo completo para iOS",
  "needletailKitPlatformMacOS": "macOS 15.0+ - Integración completa de macOS",
  "needletailKitPlatformSwift6": "Swift 6.0+ - Últimas características del lenguaje",
  "needletailKitPlatformAsync": "Async/Await - Concurrencia moderna en todo",
  "needletailKitTransportTitle": "Transporte Inteligente",
  "needletailKitTransportMulti": "Enrutamiento Multi-Transporte - Selección automática de ruta",
  "needletailKitTransportP2P": "P2P de Red Local - Comunicación directa entre dispositivos",
  "needletailKitTransportDCC": "Protocolo DCC - P2P basado en IRC con TLS",
  "needletailKitTransportFailover": "Conmutación Automática - Cambio de transporte sin interrupciones",
  "needletailKitMessagingTitle": "Mensajería Rica",
  "needletailKitMessagingText": "Mensajes de Texto - Comunicación simple y segura",
  "needletailKitMessagingMedia": "Mensajes Multimedia - Imágenes, videos, documentos",
  "needletailKitMessagingSelfDestruct": "Mensajes Autodestructivos - Soporte temporal",
  "needletailKitMessagingEdit": "Edición de Mensajes - Editar mensajes enviados",
  "needletailKitVoiceVideoTitle": "Llamadas de Voz y Video",
  "needletailKitVoiceVideoWebRTC": "Integración WebRTC - Llamadas de alta calidad",
  "needletailKitVoiceVideoSTUN": "Soporte STUN/TURN - Travesía NAT",
  "needletailKitVoiceVideoCallManagement": "Gestión de Llamadas - Manejo completo del ciclo de vida",
  "needletailKitEnterpriseTitle": "Listo para Empresas",
  "needletailKitEnterpriseProduction": "Listo para Producción - Probado en aplicaciones reales",
  "needletailKitEnterpriseSupport": "Soporte Empresarial - Soporte profesional disponible",
  "needletailKitEnterpriseCompliance": "Cumplimiento - Construido para cumplimiento regulatorio",
  "needletailKitEnterpriseScalability": "Escalabilidad - Diseñado para implementaciones a gran escala",
  "needletailKitQuickStartTitle": "Quick Start",
  "needletailKitQuickStartDescription": "Get started with NeedleTailKit in minutes. Follow these simple steps to integrate secure messaging into your application.",
  "needletailKitInstallTitle": "Installation",
  "needletailKitInstallCode": "dependencies: [\n    .package(url: \"https://github.com/needletails/needle-tail-kit.git\", from: \"1.0.0\")\n]",
  "needletailKitInitializeTitle": "Initialize Session",
  "needletailKitInitializeCode": "import NeedleTailKit\n\nlet session = NeedleTailSession.shared\ntry await session.createNewUserAccount(\n    authInfo: authInfo,\n    store: store,\n    eventObserver: eventObserver\n)",
  "needletailKitSendMessageTitle": "Send Your First Message",
  "needletailKitSendMessageCode": "let contact = try await session.createContact(contact: \"bob\")\ntry await session.sendMessage(\n    messageType: .text,\n    recipient: .nickname(\"bob\"),\n    text: \"Hello, World!\"\n)",
  "needletailKitContactTitle": "Solicitar una Licencia",
  "needletailKitContactDescription": "NeedleTailKit es un SDK propietario de código cerrado. Contáctenos para discutir opciones de licencia para su proyecto.",
  "needletailKitContactButton": "Contactar para Licencia",
  "needletailKitMetaTitle": "NeedleTailKit - SDK de Mensajería Segura Empresarial | NeedleTails",
  "needletailKitMetaDescription": "SDK Swift listo para producción para crear aplicaciones de mensajería seguras con cifrado de extremo a extremo. Criptografía post-cuántica, soporte multiplataforma y seguridad de nivel empresarial.",
  "needletailKitOgDescription": "SDK Swift listo para producción para mensajería segura con funciones de seguridad de nivel empresarial.",
  "needletailKitLogoAlt": "Logo de NeedleTailKit",
  "needletailKitPlatformAndroid": "Android: API 24 (Android 7.0) o posterior",
  "nudgeWidgetTitle": "Seguro con Nudge",
  "nudgeWidgetDescription": "Opcionalmente automonitoreado, mensajería con cifrado de extremo a extremo con control completo de datos.",
  "nudgeWidgetCTA": "Más Información",
  "nudgeWidgetLogoAlt": "Logo de Nudge",
  "nudgeFeature1Title": "End-to-End Encryption",
  "nudgeFeature1Description": "Every message encrypted by default. Full privacy.",
  "nudgeFeature2Title": "Your Data, Your Rules",
  "nudgeFeature2Description": "Optional self-hosting. No external data storage.",
  "nudgeFeature3Title": "Secure Channels",
  "nudgeFeature3Description": "Private messaging built for security.",
  "nudgeFeature4Title": "Global or Self-Hosted",
  "nudgeFeature4Description": "Scale globally or run your own instance—no data persistence risk.",
  "nudgeContactButton": "Ver Nudge",
  "nudgeMetaTitle": "Nudge - Mensajería Segura con Cifrado de Extremo a Extremo | NeedleTails",
  "nudgeMetaDescription": "Aplicación de mensajería con cifrado de extremo a extremo y datos opcionalmente automonitoreados con control completo de datos. Comunicación segura sin riesgos de persistencia de datos.",
  "nudgeOgDescription": "Mensajería con cifrado de extremo a extremo y datos opcionalmente automonitoreados con control completo de datos y seguridad de nivel empresarial.",
  "nudgeMetaKeywords": "Nudge, mensajería segura, cifrado de extremo a extremo, aplicación de mensajería cifrada, mensajería opcionalmente automonitoreada, mensajería privada, comunicación segura, privacidad de datos, seguridad de mensajería, chat cifrado, aplicación de chat segura, mensajería centrada en la privacidad",
  "brewhubMetaKeywords": "BrewHub, cursos de desarrollo de software, cursos de programación, capacitación para desarrolladores, educación en software, cursos de codificación, tutoriales de desarrollo, capacitación técnica, plataforma de aprendizaje de software, tutoriales de programación, cursos de desarrollo web, cursos de desarrollo móvil, capacitación en desarrollo backend",
  "needletailKitMetaKeywords": "NeedleTailKit, SDK Swift, cifrado de extremo a extremo, mensajería segura, SDK iOS, SDK macOS, SDK Android, criptografía post-cuántica",
  "heroTagline": "Resolvemos sus retos: apps, sitios web y soluciones de software integradas.",
  "managementPageLabel": "Management",
  "managementPageTitle": "Product & Project Delivery",
  "managementPageLead": "We align vision, roadmap, and execution so your software projects stay on scope, schedule, and quality.",
  "managementCtaLead": "Ready to align your next project?",
  "consultationPageLabel": "Consultation",
  "consultationCtaLead": "Tell us about your goals and we'll outline a clear path forward."
}
