{
  "introHeaderTwo": "Con experiencia en Aplicaciones Empresariales, tenemos lo necesario para manejar tareas y proyectos complicados de principio a fin. Como nos especializamos en desarrollo de software Swift, te sentirás confiado en la seguridad que el lenguaje aporta. Nos esforzamos por productos de calidad.",
  "menuItemOne": "Capacitación",
  "menuItemTwo": "Consultoría",
  "menuItemThree": "Gestión",
  "getInTouch": "Ponte en Contacto",
  "projectsHeader": "Nuestro Software",
  "projectsDescription": "Nos dedicamos a proporcionarte una amplia gama de software de código abierto. Para apoyar esta misión, también ofrecemos software de código cerrado. Te invitamos a explorar nuestros proyectos, que incluyen tanto opciones de código abierto como de código cerrado. Si estás interesado en contribuir u obtener una licencia para nuestro software de código cerrado, no dudes en contactarnos.",
  "projectsOverview": "Aquí tienes una lista de lo que hacemos y lo que hemos hecho",
  "businessOverviewTitle": "Especialistas en Software Swift",
  "businessOverviewDescription": "Swift es un lenguaje de programación seguro de tipos, lo que significa que ayuda a prevenir errores asegurando que los valores se usen correctamente. Tiene una huella de memoria baja, permitiendo que las aplicaciones se ejecuten eficientemente, especialmente en dispositivos móviles. Además, Swift ofrece un fuerte soporte para la seguridad de hilos, asegurando que las aplicaciones puedan manejar múltiples tareas a la vez sin problemas. Al elegir NeedleTails, puedes estar confiado de que tus proyectos se beneficiarán de la confiabilidad y rendimiento que Swift proporciona, llevando a soluciones de software de alta calidad adaptadas a tus necesidades. La ventaja de Swift es la interoperabilidad, lo que significa que podemos mover incrementalmente proyectos menos eficientes en diferentes lenguajes a Swift y/o llamar APIs de Swift desde tu lenguaje nativo.",
  "serviceHeaderBackendDevelopment": "Desarrollo Backend",
  "serviceDescriptionBackendDevelopment": "Aprovechamos el poder de Swift para desarrollar soluciones robustas del lado del servidor usando Vapor y SwiftNIO, asegurando alto rendimiento y escalabilidad para tus aplicaciones.",
  "serviceHeaderMobileAppDevelopment": "Desarrollo de Aplicaciones Móviles",
  "serviceDescriptionMobileAppDevelopment": "Crea aplicaciones nativas de iOS y macOS con Swift, entregando experiencias de usuario excepcionales y rendimiento óptimo en plataformas Apple.",
  "serviceHeaderTraining": "Capacitación y Educación",
  "serviceDescriptionTraining": "Programas de capacitación integrales para mejorar las habilidades de tu equipo en desarrollo Swift, tecnologías web modernas y mejores prácticas.",
  "serviceHeaderWebDevelopment": "Desarrollo Web",
  "serviceDescriptionWebDevelopment": "Aplicaciones web modernas construidas con Vue.js, Nuxt y TypeScript, proporcionando experiencias de usuario responsivas e interactivas.",
  "openSourceHeader": "Código Abierto",
  "openSourceDescription": "Creemos en el poder del código abierto. Explora nuestros proyectos en GitHub y contribuye a la comunidad. Tu apoyo nos ayuda a continuar desarrollando soluciones innovadoras.",
  "whyChooseSwift": "¿Por qué Elegir Swift?",
  "typeSafety": "Seguridad de Tipos",
  "typeSafetyDescription": "El sistema de tipos de Swift previene errores en tiempo de compilación, asegurando que tus aplicaciones sean robustas y confiables desde el primer día.",
  "performance": "Rendimiento",
  "performanceDescription": "Baja huella de memoria y alto rendimiento hacen de Swift ideal para entornos con recursos limitados y aplicaciones exigentes.",
  "threadSafety": "Seguridad de Hilos",
  "threadSafetyDescription": "El soporte de concurrencia integrado asegura que tus aplicaciones manejen múltiples tareas eficientemente sin condiciones de carrera.",
  "ourServices": "Nuestros Servicios",
  "servicesDescription": "Creemos que la planificación meticulosa es esencial para el éxito. Nuestros planos integrales, consultas perspicaces y orientación te apoyarán durante todo tu viaje.",
  "startYourProject": "Inicia tu Proyecto",
  "swiftNative": "Swift Nativo",
  "support": "Soporte",
  "possibilities": "Posibilidades",
  "makingYour": "Haciendo tus",
  "ideasReality": "Ideas Realidad",
  "swiftSoftwareSpecialists": "Especialistas en Software Swift",
  "swift": "Swift",
  "swiftServer": "Swift-Servidor",
  "frequentlyAskedQuestions": "Preguntas Frecuentes",
  "faqDescription": "Obtén respuestas a preguntas comunes sobre nuestros servicios de desarrollo de software",
  "faqTechnologies": "¿En qué tecnologías se especializan?",
  "faqTechnologiesAnswer": "Nos especializamos en desarrollo web moderno usando una amplia gama de tecnologías incluyendo, pero no limitado a Nuxt, Vue, Vapor y SwiftNIO. Nuestra experiencia en lenguajes incluye TypeScript y Swift. También trabajamos con soluciones backend robustas, servicios en la nube, APIs y arquitectura escalable para entregar aplicaciones de alto rendimiento.",
  "faqTimeline": "¿Cuánto tiempo toma un proyecto típico?",
  "faqTimelineAnswer": "Los cronogramas de proyectos varían según la complejidad. Las aplicaciones web simples toman 4-8 semanas, mientras que las soluciones empresariales complejas pueden tomar 3-6 meses. Proporcionamos cronogramas detallados durante la consulta.",
  "faqSupport": "¿Proporcionan soporte y mantenimiento continuo?",
  "faqSupportAnswer": "Sí, ofrecemos paquetes de soporte integrales incluyendo monitoreo 24/7, actualizaciones regulares, parches de seguridad y mejoras de características para asegurar que tu aplicación permanezca actualizada y segura.",
  "faqProcess": "¿Cuál es su proceso de desarrollo?",
  "faqProcessAnswer": "Seguimos un enfoque colaborativo con comunicación regular del cliente, desarrollo iterativo y pruebas continuas. Nuestro proceso incluye fases de planificación, diseño, desarrollo, pruebas e implementación.",
  "faqIntegration": "¿Pueden trabajar con sistemas y APIs existentes?",
  "faqIntegrationAnswer": "¡Absolutamente! Tenemos amplia experiencia integrando con sistemas existentes, APIs y bases de datos. Podemos mejorar, modernizar o reconstruir completamente tu infraestructura actual.",
  "faqSecurity": "¿Qué hay sobre seguridad y protección de datos?",
  "faqSecurityAnswer": "La seguridad es el valor predeterminado en todo lo que construimos. Implementamos prácticas de desarrollo de software impulsadas por la seguridad, medidas de seguridad estándar de la industria, encriptación de datos y auditorías de seguridad regulares para proteger tus datos y la información de tus usuarios.",
  "consultingTitle": "Soluciones de Consultoría",
  "consultingOverview": "Orientación experta para tus proyectos de desarrollo de software",
  "consultWithUs": "Consulta con Nosotros",
  "consultingWithUsMessage": "Obtén asesoramiento profesional sobre tus necesidades de desarrollo",
  "whatToConsultAbout": "Sobre qué Consultar",
  "architectureDesign": "Diseño de Arquitectura",
  "architectureDesignDescription": "Diseña arquitecturas de software escalables y mantenibles",
  "technologySelection": "Selección de Tecnología",
  "technologySelectionDescription": "Elige las tecnologías correctas para las necesidades de tu proyecto",
  "performanceOptimization": "Optimización de Rendimiento",
  "performanceOptimizationDescription": "Enfócate en optimizar los tiempos de respuesta y el uso de recursos. Usa estrategias de caché, balanceo de carga y consultas eficientes de base de datos para mejorar el rendimiento y reducir la latencia.",
  "securityReview": "Revisión de Seguridad",
  "securityReviewDescription": "Asegura que tus aplicaciones sean seguras y cumplan con las regulaciones",
  "codeReview": "Revisión de Código",
  "codeReviewDescription": "Obtén retroalimentación experta sobre la calidad de tu código",
  "bestPractices": "Mejores Prácticas",
  "bestPracticesDescription": "Implementa las mejores prácticas de la industria en tu desarrollo",
  "trainingProgramsHeader": "Programas de Capacitación",
  "trainingProgramsDescription": "Soluciones de desarrollo profesional y capacitación",
  "trainingOverview": "Programas de capacitación integrales para mejorar las habilidades de tu equipo",
  "trainingCourses": "Cursos de Capacitación",
  "vueJsDevelopment": "Desarrollo Vue.js",
  "vueJsDevelopmentDescription": "Aprende prácticas modernas de desarrollo Vue.js con Nuxt",
  "swiftBackendDevelopment": "Desarrollo Backend Swift",
  "swiftBackendDevelopmentDescription": "Domina el desarrollo backend Swift con Vapor y SwiftNIO",
  "typescriptDevelopment": "Desarrollo TypeScript",
  "typescriptDevelopmentDescription": "Construye aplicaciones robustas con TypeScript",
  "securityFirstDevelopment": "Desarrollo Seguridad-Primero",
  "securityFirstDevelopmentDescription": "Implementa prácticas de desarrollo de software impulsadas por la seguridad",
  "productManagementExpertiseHeader": "Experiencia en Gestión de Productos",
  "productManagementExpertiseDescription": "Soluciones integrales de gestión de productos",
  "productManagementOverview": "Servicios expertos de gestión de productos para ayudarte a tener éxito",
  "productManagementPoints": "Puntos de Consideración en Gestión de Productos",
  "requirementsGathering": "Recopilación de Requisitos",
  "requirementsGatheringDescription": "Define y documenta los requisitos del proyecto",
  "marketResearch": "Investigación de Mercado",
  "marketResearchDescription": "Conduce análisis de mercado exhaustivos",
  "userExperienceDesign": "Diseño de Experiencia de Usuario",
  "userExperienceDesignDescription": "Diseña experiencias de usuario intuitivas",
  "productStrategy": "Estrategia de Producto",
  "productStrategyDescription": "Desarrolla estrategias de producto integrales",
  "featurePrioritization": "Priorización de Características",
  "featurePrioritizationDescription": "Prioriza características basadas en valor",
  "stakeholderManagement": "Gestión de Partes Interesadas",
  "stakeholderManagementDescription": "Gestiona relaciones con partes interesadas",
  "projectManagementExpertiseHeader": "Experiencia en Gestión de Proyectos",
  "projectManagementExpertiseDescription": "Soluciones profesionales de gestión de proyectos",
  "projectManagementOverview": "Servicios integrales de gestión de proyectos",
  "projectManagementPoints": "Puntos de Consideración en Gestión de Proyectos",
  "projectPlanning": "Planificación de Proyectos",
  "projectPlanningDescription": "Crea planes de proyecto detallados",
  "resourceManagement": "Gestión de Recursos",
  "resourceManagementDescription": "Gestiona recursos del proyecto efectivamente",
  "riskManagement": "Gestión de Riesgos",
  "riskManagementDescription": "Identifica y mitiga riesgos del proyecto",
  "qualityAssurance": "Aseguramiento de Calidad",
  "qualityAssuranceDescription": "Asegura estándares de calidad del proyecto",
  "overview": "Resumen",
  "privacyPolicyTitle": "Política de Privacidad",
  "effectiveDate": "Fecha Efectiva",
  "effectiveDateValue": "10/05/2024",
  "introduction": "Introducción",
  "informationWeDoNotCollect": "Información que No Recolectamos",
  "informationCollectedByServers": "Información Recolectada por Servidores y Tecnologías",
  "legalUse": "Uso Legal",
  "limitationOfLiability": "Limitación de Responsabilidad",
  "changesToPolicy": "Cambios a esta Política de Privacidad",
  "privacyWelcomeMessage": "Bienvenido a NeedleTails.com. Tu privacidad es importante para nosotros.",
  "privacyPurpose": "Esta Política de Privacidad describe nuestras prácticas respecto a la recolección de información cuando visitas nuestro sitio.",
  "personalInformation": "No recolectamos ninguna información personal de nuestros usuarios.",
  "informationOverview": "Aunque no recolectamos información personal, ten en cuenta que los servidores y otras tecnologías pueden recolectar cierta información automáticamente.",
  "legalUseOverview": "Al usar nuestro Sitio, aceptas cumplir con todas las leyes y regulaciones locales aplicables.",
  "userResponsibility": "Es tu responsabilidad asegurar que tu uso del Sitio sea legal en tu jurisdicción.",
  "privacyLimitationOverview": "El autor de este sitio web no será responsable por ningún daño o pérdida que surja de tu uso del Sitio.",
  "privacyUserAcknowledgment": "Al usar el Sitio, reconoces que lo haces bajo tu propio riesgo y que el autor no es responsable por ninguna consecuencia resultante de tu uso.",
  "privacyChangesToPolicy": "Podemos actualizar nuestra Política de Privacidad de vez en cuando. Te notificaremos de cualquier cambio publicando la nueva Política de Privacidad en esta página. Se te aconseja revisar esta Política de Privacidad periódicamente para cualquier cambio.",
  "cookies": "Cookies",
  "cookiesDescription": "Se pueden usar cookies para mejorar la experiencia del usuario. Estas pueden incluir:",
  "sessionCookies": "Cookies de Sesión: Cookies temporales que expiran cuando cierras tu navegador.",
  "persistentCookies": "Cookies Persistentes: Cookies que permanecen en tu dispositivo por un período establecido o hasta que se eliminen.",
  "analytics": "Analíticas",
  "analyticsDescription": "Podemos usar servicios de analíticas de terceros que recolectan información sobre el uso del sitio web, como:",
  "pageViews": "Vistas de Página",
  "userInteractions": "Interacciones de Usuario",
  "trafficSources": "Fuentes de Tráfico",
  "serverLogs": "Registros del Servidor",
  "serverLogsDescription": "Los servidores web pueden registrar información sobre tu visita, incluyendo:",
  "ipAddress": "Dirección IP",
  "browserType": "Tipo de Navegador",
  "operatingSystem": "Sistema Operativo",
  "referringUrl": "URL de Referencia",
  "pagesVisited": "Páginas Visitadas",
  "timeAndDateOfAccess": "Hora y Fecha de Acceso",
  "termsTitle": "Términos y Condiciones",
  "termsEffectiveDate": "Fecha Efectiva: 10/05/2024",
  "userAgreement": "Acuerdo de Usuario",
  "prohibitedActivities": "Actividades Prohibidas",
  "changesToTerms": "Cambios a estos Términos",
  "termsWelcomeMessage": "Bienvenido a nuestros Términos y Condiciones.",
  "termsPurpose": "Estos términos rigen tu uso de nuestros servicios.",
  "userAgreementText": "Al usar nuestros servicios, aceptas estos términos.",
  "prohibitedActivitiesOverview": "Las siguientes actividades están prohibidas:",
  "usingServiceForIllegalPurposes": "Usar el servicio para propósitos ilegales.",
  "engagingInHarassment": "Participar en cualquier forma de acoso o abuso.",
  "unauthorizedAccess": "Intentar obtener acceso no autorizado a nuestros sistemas.",
  "distributingMalware": "Distribuir software malicioso o virus.",
  "termsLimitationOverview": "No somos responsables por ningún daño indirecto, incidental o consecuente.",
  "termsUserAcknowledgment": "Reconoces que usas nuestros servicios bajo tu propio riesgo.",
  "termsChangesToTerms": "Podemos actualizar estos términos de vez en cuando. Por favor revísalos regularmente.",
  "spineTailedKitTitle": "SpineTailedKit",
  "spineTailedKitDescription": "SpineTailedKit busca entregar un protocolo RTC optimizado en Swift. A diferencia de otras bibliotecas RTC que están sobrecargadas con código C y C++ innecesario, nos enfocamos en proporcionar una solución moderna, segura y de alto rendimiento para aplicaciones de voz y video.",
  "needleTailKitTitle": "NeedleTailKit",
  "needleTailKitDescription": "¿Qué es NeedleTailKit? NTK es el SDK principal para Aplicaciones Cliente y Servidor NeedleTail, permitiendo la creación de hermosas aplicaciones encriptadas de extremo a extremo. Puede usarse para varias aplicaciones más allá de mensajería. ¿Interesado? ¡Contáctanos para aprender más!",
  "needleTailIRCTitle": "NeedleTailIRC",
  "needleTailIRCDescription": "Una biblioteca cliente IRC moderna para aplicaciones Swift. NeedleTailIRC proporciona una interfaz robusta y segura para conectarse a servidores IRC, manejar canales y gestionar comunicación en tiempo real. Construida con Swift Concurrency para un rendimiento óptimo.",
  "connectionManagerKitTitle": "ConnectionManagerKit",
  "connectionManagerKitDescription": "Un framework completo de gestión de conexiones para aplicaciones Swift. ConnectionManagerKit simplifica la conectividad de red, el agrupamiento de conexiones y la gestión del ciclo de vida de las conexiones. Perfecto para aplicaciones que requieren comunicación de red confiable.",
  "postQuantumSolaceTitle": "PostQuantumSolace",
  "postQuantumSolaceDescription": "Una biblioteca de criptografía post-cuántica para aplicaciones Swift. PostQuantumSolace proporciona algoritmos y protocolos criptográficos resistentes a la computación cuántica, asegurando que tus aplicaciones permanezcan seguras en la era de la computación cuántica.",
  "whiteTippedSocketsTitle": "White Tipped Sockets",
  "whiteTippedSocketsDescription": "WhiteTippedSockets es una biblioteca WebSocket nativa para iOS y macOS, construida sobre la API Network.framework usando Swift Concurrency. Nuestro objetivo es proporcionar una solución moderna y eficiente para comunicación WebSocket, y también planeamos desarrollar un servidor completamente funcional y escalable en el futuro.",
  "swiftHlsTitle": "Swift HLS",
  "swiftHlsDescription": "HTTP Live Streaming (HLS) es una tecnología clave para transmisión eficiente de medios, y SwiftHLS está diseñado para facilitar esto. Utilizando el mismo protocolo que impulsa la web, HLS permite entrega de contenido vía APIs REST y CDNs. Su propósito es proporcionar confiabilidad y se adapta dinámicamente a las condiciones de red.",
  "swiftIapTitle": "Swift IAP",
  "swiftIapDescription": "SwiftIAP es una biblioteca integral de Compras en la Aplicación para aplicaciones iOS y macOS. Proporciona una interfaz moderna y segura de tipos para manejar compras en la aplicación, suscripciones y validación de recibos. Construida con Swift Concurrency y diseñada para facilidad de uso.",
  "stompTitle": "Stomp",
  "stompDescription": "Stomp es una biblioteca Swift para comunicación de protocolo STOMP. Proporciona una interfaz moderna y segura de tipos para conectarse a servidores STOMP y manejar enrutamiento de mensajes. Perfecto para aplicaciones que necesitan infraestructura de mensajería confiable.",
  "privacy": "Política de Privacidad",
  "termsConditions": "Términos y Condiciones",
  "projectTitle_1": "Proyectos",
  "projectHeader_1": "SpineTailedKit",
  "projectTitleText_1": "Solución RTC VoIP",
  "projectTitle_2": "Proyectos",
  "projectHeader_2": "NeedleTailKit",
  "projectTitleText_2": "Solución de Mensajería Encriptada de Extremo a Extremo",
  "projectTitle_3": "Proyectos",
  "projectHeader_3": "White Tipped Sockets",
  "projectTitleText_3": "Wrapper Swift Concurrent de Network.framework",
  "projectTitle_4": "Proyectos",
  "projectHeader_4": "Swift Stomp",
  "projectTitleText_4": "Protocolo STOMP Swift Concurrent",
  "projectTitle_5": "Proyectos",
  "projectHeader_5": "Swift HLS",
  "projectTitleText_5": "Proyecto Swift HLS",
  "pageNotFound": "Página No Encontrada",
  "pageNotFoundDescription": "La página que buscas no existe o ha sido movida. Te ayudemos a volver al camino correcto.",
  "goHome": "Ir al Inicio",
  "goBack": "Volver",
  "contact": "Contacto",
  "contactUs": "Contáctanos",
  "becomeASponsor": "Conviértete en un Patrocinador",
  "supportOpenSourceMessage": "Apoya nuestros proyectos de código abierto y ayúdanos a continuar construyendo software increíble.",
  "getStartedOnDigitalOcean": "Comienza en Digital Ocean con un crédito de $100 por 60 días para nuevos usuarios.",
  "readyToGetStarted": "¿Listo para Comenzar?",
  "letsDiscussProject": "Hablemos de tu proyecto y veamos cómo podemos ayudar a hacer realidad tus ideas con soluciones impulsadas por Swift.",
  "backToTop": "Volver Arriba",
  "needleTailsCopyright": "NeedleTails©",
  "pointsForConsideration": "Puntos para Considerar",
  "responsiveDesign": "Diseño Responsivo",
  "responsiveDesignDescription": "Asegura que tu sitio web sea responsivo y funcione bien en varios dispositivos y tamaños de pantalla para una experiencia de usuario óptima.",
  "crossBrowserCompatibility": "Compatibilidad Multi-Navegador",
  "crossBrowserCompatibilityDescription": "Prueba tu aplicación web en diferentes navegadores para asegurar funcionalidad y apariencia consistentes.",
  "webPerformanceOptimizationDescription": "Enfócate en optimizar tiempos de carga y rendimiento general minimizando tamaños de archivo, usando prácticas de codificación eficientes y aprovechando el caché.",
  "userExperience": "Experiencia de Usuario (UX)",
  "userExperienceDescription": "Prioriza navegación intuitiva, llamadas a la acción claras y características de accesibilidad para mejorar el compromiso del usuario.",
  "securityPractices": "Prácticas de Seguridad",
  "securityPracticesDescription": "Implementa medidas de seguridad esenciales, como HTTPS, validación de datos y protección contra vulnerabilidades comunes como inyección SQL y cross-site scripting (XSS).",
  "seoBestPractices": "Mejores Prácticas SEO",
  "seoBestPracticesDescription": "Optimiza tu sitio web para motores de búsqueda usando estructura HTML apropiada, meta tags y palabras clave relevantes para mejorar visibilidad y ranking.",
  "backendSolutionsHeader": "Soluciones del Lado del Servidor",
  "backendSolutionsDescription": "Servidor Primero: Nos enfocamos en desarrollar tus proyectos backend priorizando las necesidades del servidor. Este enfoque nos permite crear soluciones escalables que impulsan el crecimiento empresarial y aseguran el éxito de tus proyectos.",
  "backendCapabilitiesOverview": "Nuestra experiencia en backend está anclada en Swift del lado del servidor, utilizando el poder y versatilidad del lenguaje de programación Swift. Nos destacamos en crear soluciones backend seguras y de alto rendimiento que están adaptadas a tus requisitos únicos. Ya sea que necesites implementar protocolos estándar modernos o desarrollar un protocolo personalizado diseñado específicamente para tus necesidades, nuestro equipo aprovecha las capacidades excepcionales de Swift para impulsar tu negocio hacia adelante.",
  "scalability": "Escalabilidad",
  "scalabilityDescription": "Diseña tu arquitectura para manejar el crecimiento en el tráfico de usuarios y volumen de datos. Considera usar microservicios o arquitecturas sin servidor para permitir el escalado fácil de componentes individuales.",
  "security": "Seguridad",
  "securityDescription": "Implementa prácticas de seguridad clave, como encriptación de datos y autenticación segura, para proteger los datos del usuario y reducir vulnerabilidades.",
  "maintainability": "Mantenibilidad",
  "maintainabilityDescription": "Escribe código limpio, modular y bien documentado para facilitar el mantenimiento y las actualizaciones. Considera usar sistemas de control de versiones y adoptar estándares de codificación para asegurar consistencia en todo el equipo.",
  "testingAndQualityAssurance": "Pruebas y Aseguramiento de Calidad",
  "testingAndQualityAssuranceDescription": "Establece una estrategia de pruebas que incluya pruebas unitarias y de integración. Usa prácticas de integración continua para automatizar las pruebas y mantener la calidad del código.",
  "monitoringAndLogging": "Monitoreo y Registro",
  "monitoringAndLoggingDescription": "Implementa monitoreo y registro básico para rastrear el rendimiento e identificar problemas. Enfócate en herramientas que proporcionen insights esenciales, permitiéndote abordar problemas y mejorar el sistema con el tiempo.",
  "nativeAppDevelopmentHeader": "Desarrollo de Aplicaciones Nativas",
  "nativeAppDevelopmentDescription": "Elevamos tus proyectos a experiencias nativas sofisticadas, meticulosamente elaboradas para esa apariencia y sensación nativa.",
  "nativeAppDevelopmentOverview": "Nuestro equipo se especializa en crear aplicaciones para una amplia gama de plataformas Apple y dispositivos Android. Con amplia experiencia en el desarrollo de aplicaciones fluidas, intuitivas y de alto rendimiento, atendemos iOS, iPadOS, macOS, tvOS, watchOS y visionOS. Para Android, aseguramos una apariencia y sensación nativa que mejora el compromiso del usuario. Estamos comprometidos con la seguridad, implementando las mejores prácticas para proteger los datos del usuario y asegurar una experiencia segura. Nuestra experiencia nos permite diseñar y construir aplicaciones que son visualmente atractivas, fáciles de usar y ofrecen rendimiento excepcional. Ya sea que necesites una aplicación móvil pulida, una aplicación de escritorio potente o una interfaz de TV atractiva, proporcionamos soluciones que garantizan una experiencia de usuario excepcional en todos los dispositivos.",
  "designConsistency": "Consistencia de Diseño",
  "designConsistencyDescription": "Mantén un diseño y experiencia de usuario consistentes en aplicaciones cliente Swift y plataformas Android para mejorar la usabilidad.",
  "deviceFragmentation": "Fragmentación de Dispositivos",
  "deviceFragmentationDescription": "Prueba en varios dispositivos y tamaños de pantalla, especialmente para Android.",
  "userExperienceUX": "Experiencia de Usuario (UX)",
  "userExperienceUXDescription": "Asegura navegación intuitiva y accesibilidad para todos los usuarios.",
  "distributionCompliance": "Cumplimiento de Distribución",
  "distributionComplianceDescription": "Asegúrate de que tu aplicación cumpla con los requisitos de varios canales de distribución, incluyendo tiendas de aplicaciones y plataformas alternativas.",
  "webDevelopmentExpertiseHeader": "Desarrollo de Aplicaciones Web",
  "webDevelopmentExpertiseDescription": "Aprovechamos nuestra experiencia profunda para construir y sostener una fuerte presencia en línea para tu negocio.",
  "webDevelopmentOverview": "En el campo del desarrollo web, proporcionamos una diversa gama de servicios que permiten a los clientes utilizar varios tipos de sitios web, incluyendo sitios de portafolio para mostrar trabajo creativo, blogs para compartir contenido, sitios web corporativos para representar negocios, aplicaciones web interactivas para funcionalidades específicas y páginas de aterrizaje dirigidas para campañas de marketing. Nuestra pila tecnológica incluye Vue.js con TypeScript, junto con soluciones Swift como Vapor, Hummingbird 2 y Toucan. Utilizando estas tecnologías, creamos experiencias web responsivas y fáciles de usar, entregando soluciones que son tanto visualmente atractivas como funcionalmente robustas.",
  "solutionsTitle": "Soluciones",
  "featuredApplications": "Aplicaciones Destacadas",
  "our": "Nuestras",
  "featuredApps": "Apps Destacadas",
  "featuredAppsDescription": "Descubre nuestras aplicaciones innovadoras que muestran el poder del desarrollo Swift y la arquitectura de software moderna.",
  "nudgeTitle": "Tu Aplicación de Mensajería con Datos Automonitoreados Encriptados de Extremo a Extremo",
  "nudgeDescription": "¿Te preocupa la seguridad en el panorama digital actual? ¿Quieres un canal de comunicación seguro pero te sientes inseguro sobre quién tiene acceso a tus datos? Incluso con encriptación de extremo a extremo, las preocupaciones sobre el almacenamiento de datos pueden persistir. Nudge está aquí para proporcionar la solución que necesitas. Con Nudge, tienes control completo sobre tus datos, permitiéndote gestionarlos de forma segura o expandir tu alcance globalmente sin el riesgo de persistencia de datos. ¡Contáctanos hoy para aprender más sobre cómo puedes configurar tu propia instancia y disfrutar de la tranquilidad con comunicación segura!",
  "islandHoppersTitle": "Island Hoppers: ¡Tu App de Tours Definitiva para Aventuras Sin Problemas!",
  "islandHoppersDescription": "Island Hoppers es la app todo-en-uno diseñada para mejorar tu experiencia de viaje, ya seas una empresa organizando tours inolvidables o un cliente buscando la escapada perfecta. Para empresas, nuestra app optimiza todo el proceso de gestión de tours. Organiza y personaliza tus tours sin esfuerzo, comunícate directamente con guías turísticos y mantén a tus clientes informados con actualizaciones en tiempo real. Con Island Hoppers, puedes gestionar reservas, rastrear preferencias de clientes y asegurar que cada detalle esté cuidado, permitiéndote enfocarte en entregar experiencias excepcionales. Para clientes, Island Hoppers ofrece una diversa gama de paquetes de tours adaptados para varios tipos de grupos, incluyendo familias, mochileros y entusiastas de fiestas. Navega por nuestra selección curada de aventuras, elige el paquete perfecto que se ajuste a tu estilo y conéctate con viajeros afines. Disfruta de comunicación fluida con tus guías turísticos, accede a información esencial y recibe recomendaciones personalizadas para aprovechar al máximo tu viaje. ¡Con Island Hoppers, embárcate en aventuras inolvidables con facilidad y confianza, sabiendo que cada aspecto de tu tour está a solo un toque de distancia!",
  "streamStackTitle": "Una Plataforma Educativa para tus Soluciones de Software",
  "streamStackDescription": "Transmite, Lee, Discute. Ya seas nuevo en programación o quieras leer sobre diferentes soluciones de software, te lo hacemos fácil con nuestra app nativa de Mac. Mantente al día con las últimas tendencias de programación.",
  "welcomeToNeedleTails": "Bienvenido a NeedleTails - Tu Aliado en Desarrollo de Software",
  "accept": "Acepto y estoy de acuerdo",
  "cookieConsentTitle": "Usamos almacenamiento del navegador",
  "cookieConsentMessage": "Usamos almacenamiento del navegador para recordar tu preferencia de idioma y mejorar tu experiencia de navegación. Al hacer clic en 'Aceptar Todo', consientes nuestro uso del almacenamiento del navegador.",
  "cookieConsentAcceptAll": "Aceptar Todo",
  "cookieConsentAcceptNecessary": "Solo Necesarias",
  "cookieConsentReject": "Rechazar Todo",
  "cookieConsentLearnMore": "Más Información",
  "cookieConsentNecessary": "El almacenamiento necesario incluye la detección de idioma para proporcionar contenido en tu idioma preferido.",
  "cookieConsentAnalytics": "Actualmente no usamos seguimiento de análisis en este sitio web.",
  "cookieConsentPreferences": "El almacenamiento de preferencias recuerda tu configuración como tema y preferencias de usuario para personalizar tu experiencia.",
  "cookieConsentMarketing": "Actualmente no usamos seguimiento de marketing o publicidad en este sitio web."
}