{
  "introHeaderTwo": "Vous avez la vision ; nous livrons la solution. Que ce soit une app mobile, un site web moderne ou un système logiciel complet, nous transformons vos défis en produits fiables et sécurisés. Avec une expérience entreprise sur Mobile, Web et Serveur, nous construisons et intégrons des solutions qui évoluent—pour que vous puissiez vous concentrer sur votre activité.",
  "menuItemOne": "Cours",
  "menuItemTwo": "Consultation",
  "menuItemThree": "Gestion",
  "getInTouch": "Nous Contacter",
  "projectsHeader": "Notre Logiciel",
  "projectsDescription": "Nous nous consacrons à vous fournir une large gamme de logiciels open-source. Pour soutenir cette mission, nous proposons également certains logiciels propriétaires. Nous vous invitons à explorer nos projets, qui incluent des options open-source et propriétaires. Si vous êtes intéressé par contribuer ou obtenir une licence pour nos logiciels propriétaires, n'hésitez pas à nous contacter.",
  "projectsOverview": "Voici une liste de ce que nous faisons et ce que nous avons fait",
  "businessOverviewTitle": "Spécialistes en Logiciel Swift",
  "badgeMobile": "Mobile",
  "badgeWeb": "Web",
  "badgeServer": "Serveur",
  "businessOverviewDescription": "Nous transformons vos défis logiciels en solutions prêtes pour la production. Que vous ayez besoin d'une nouvelle app, d'un site web moderne ou de systèmes qui s'intègrent parfaitement, nous livrons sur Mobile, Web et Serveur—dans la langue adaptée à votre projet. Notre expertise Swift apporte sécurité des types, performance et fiabilité ; nous nous intégrons aussi à votre stack existant. Faites équipe avec nous pour des solutions durables qui évoluent avec votre entreprise.",
  "serviceHeaderBackendDevelopment": "Backend et APIs",
  "serviceDescriptionBackendDevelopment": "Relevez les défis de scalabilité et d'intégration avec des solutions serveur robustes. Nous construisons et connectons APIs, bases de données et services pour que vos apps et sites fonctionnent de façon fiable à toute échelle.",
  "serviceHeaderMobileAppDevelopment": "Apps Mobiles",
  "serviceDescriptionMobileAppDevelopment": "Obtenez une app native que les utilisateurs adorent. Nous développons des apps iOS, Android et multiplateformes qui résolvent de vrais problèmes—à temps et prêtes pour les stores.",
  "serviceHeaderTraining": "BrewHub",
  "serviceDescriptionTraining": "Formez votre équipe avec des cours professionnels de développement logiciel. Formation guidée en direct avec des outils de niveau production pour que vous puissiez construire et maintenir des solutions en interne.",
  "serviceHeaderWebDevelopment": "Développement Web",
  "serviceDescriptionWebDevelopment": "Sites et applications web qui fonctionnent partout. Nous livrons des expériences réactives, rapides et sécurisées qui attirent les utilisateurs et soutiennent les objectifs de votre entreprise.",
  "openSourceHeader": "Open Source",
  "openSourceDescription": "Nous croyons en la puissance de l'open source. Explorez nos projets sur GitHub et contribuez à la communauté. Votre soutien nous aide à continuer de développer des solutions innovantes.",
  "whyChooseSwift": "Pourquoi Choisir Swift ?",
  "typeSafety": "Sécurité des Types",
  "typeSafetyDescription": "Le système de types de Swift prévient les erreurs au moment de la compilation, assurant que vos applications sont robustes et fiables dès le premier jour.",
  "performance": "Performance",
  "performanceDescription": "Une faible empreinte mémoire et des performances élevées rendent Swift idéal pour les environnements à ressources limitées et les applications exigeantes.",
  "threadSafety": "Sécurité des Threads",
  "threadSafetyDescription": "Le support de concurrence intégré assure que vos applications gèrent efficacement plusieurs tâches sans conditions de course.",
  "ourServices": "Comment Nous Relevons Vos Défis",
  "servicesDescription": "Du concept au lancement et au-delà, nous livrons les apps, sites web et intégrations dont vous avez besoin. Décrivez-nous votre défi—nous concevons, construisons et assurons le support de la solution.",
  "startYourProject": "Démarrer Votre Projet",
  "swiftNative": "Natif",
  "support": "Support",
  "possibilities": "Possibilités",
  "makingYour": "Rendre Vos",
  "ideasReality": "Idées en Réalité",
  "swiftSoftwareSpecialists": "Spécialistes en Logiciel Swift",
  "swift": "Swift",
  "swiftServer": "Swift-Serveur",
  "frequentlyAskedQuestions": "Questions Fréquemment Posées",
  "faqDescription": "Obtenez des réponses aux questions courantes sur nos services de développement logiciel",
  "faqTechnologies": "Dans quelles technologies vous spécialisez-vous ?",
  "faqTechnologiesAnswer": "Nous nous spécialisons dans le développement web moderne utilisant une large gamme de technologies incluant, mais sans s'y limiter, Nuxt, Vue, Vapor et SwiftNIO. Notre expertise linguistique inclut TypeScript et Swift. Nous travaillons également avec des solutions backend robustes, des services cloud, des APIs et une architecture évolutive pour livrer des applications haute performance.",
  "faqTimeline": "Combien de temps prend un projet typique ?",
  "faqTimelineAnswer": "Les délais de projet varient selon la complexité. Les applications web simples prennent 4-8 semaines, tandis que les solutions d'entreprise complexes peuvent prendre 3-6 mois. Nous fournissons des délais détaillés lors de la consultation.",
  "faqSupport": "Fournissez-vous un support et une maintenance continus ?",
  "faqSupportAnswer": "Oui, nous offrons des packages de support complets incluant une surveillance 24/7, des mises à jour régulières, des correctifs de sécurité et des améliorations de fonctionnalités pour assurer que votre application reste actuelle et sécurisée.",
  "faqProcess": "Quel est votre processus de développement ?",
  "faqProcessAnswer": "Nous suivons une approche collaborative avec une communication client régulière, un développement itératif et des tests continus. Notre processus inclut les phases de planification, conception, développement, test et déploiement.",
  "faqIntegration": "Pouvez-vous travailler avec des systèmes et APIs existants ?",
  "faqIntegrationAnswer": "Absolument ! Nous avons une vaste expérience d'intégration avec des systèmes existants, des APIs et des bases de données. Nous pouvons améliorer, moderniser ou complètement reconstruire votre infrastructure actuelle.",
  "faqSecurity": "Qu'en est-il de la sécurité et de la protection des données ?",
  "faqSecurityAnswer": "La sécurité est par défaut dans tout ce que nous construisons. Nous implémentons des pratiques de développement logiciel axées sur la sécurité, des mesures de sécurité conformes aux standards de l'industrie, le chiffrement des données et des audits de sécurité réguliers pour protéger vos données et les informations de vos utilisateurs.",
  "consultingTitle": "Your Challenges, Our Expertise",
  "consultingOverview": "Whether you're defining a new product, modernizing legacy systems, or choosing stack and architecture—we provide structured guidance so your decisions are informed by experience and aligned with your business goals.",
  "consultWithUs": "Discuss Your Initiative",
  "consultingWithUsMessage": "Share your goals, constraints, and timeline. We'll outline options, trade-offs, and a clear path forward—including scope, technology, and what it takes to get there.",
  "whatToConsultAbout": "What We Can Help With",
  "architectureDesign": "Architecture & System Design",
  "architectureDesignDescription": "Scalable, maintainable architectures for new and existing systems. We help you choose patterns, boundaries, and integration approaches so your solution is fit for production and future growth.",
  "technologySelection": "Technology & Stack Selection",
  "technologySelectionDescription": "Objective evaluation of technologies and vendors against your requirements, team skills, and long-term maintainability. We help you select a stack that balances delivery speed, cost, and risk.",
  "performanceOptimization": "Performance & Scalability",
  "performanceOptimizationDescription": "Response times, throughput, and resource usage. We apply caching, load balancing, query optimization, and capacity planning so your systems perform under load and stay cost-effective.",
  "securityReview": "Security & Compliance Review",
  "securityReviewDescription": "Security posture and compliance alignment. We assess design and implementation against common threats and frameworks so your applications and data meet business and regulatory expectations.",
  "codeReview": "Code & Implementation Review",
  "codeReviewDescription": "Expert review of code quality, patterns, and technical debt. We provide actionable feedback so your codebase stays maintainable, testable, and aligned with best practices.",
  "bestPractices": "Process & Best Practices",
  "bestPracticesDescription": "Development process, DevOps, and delivery practices. We help you adopt workflows that improve predictability, quality, and team efficiency.",
  "trainingProgramsHeader": "Programmes de Formation",
  "trainingProgramsDescription": "Solutions de développement professionnel et de formation",
  "trainingOverview": "Programmes de formation complets pour améliorer les compétences de votre équipe",
  "trainingCourses": "Cours de Formation",
  "vueJsDevelopment": "Développement Vue.js",
  "vueJsDevelopmentDescription": "Apprenez les pratiques modernes de développement Vue.js avec Nuxt",
  "swiftBackendDevelopment": "Développement Backend Swift",
  "swiftBackendDevelopmentDescription": "Maîtrisez le développement backend Swift avec Vapor et SwiftNIO",
  "typescriptDevelopment": "Développement TypeScript",
  "typescriptDevelopmentDescription": "Construisez des applications robustes avec TypeScript",
  "securityFirstDevelopment": "Développement Sécurité-First",
  "securityFirstDevelopmentDescription": "Implémentez des pratiques de développement logiciel axées sur la sécurité",
  "productManagementExpertiseHeader": "Product Management",
  "productManagementExpertiseDescription": "Structured product management to align vision, roadmap, and delivery with business outcomes.",
  "productManagementOverview": "We support product-led organizations with discovery, prioritization, and lifecycle practices. From requirements and market insight through UX and roadmap planning, we help you ship the right features at the right time and keep stakeholders aligned.",
  "productManagementPoints": "Key Disciplines",
  "requirementsGathering": "Requirements & Discovery",
  "requirementsGatheringDescription": "Structured elicitation and documentation of functional and non-functional requirements. We capture clear, actionable specs so development and stakeholders share a single source of truth.",
  "marketResearch": "Market & User Research",
  "marketResearchDescription": "Evidence-based understanding of users, competitors, and market fit. We support product decisions with research so roadmaps are grounded in real demand and usage.",
  "userExperienceDesign": "User Experience Design",
  "userExperienceDesignDescription": "User-centered flows, information architecture, and interaction design. We align UX with business goals and accessibility so products are usable and compliant.",
  "productStrategy": "Product Strategy",
  "productStrategyDescription": "Vision, positioning, and roadmap aligned with business objectives. We help define and communicate strategy so teams and stakeholders move in the same direction.",
  "featurePrioritization": "Feature Prioritization",
  "featurePrioritizationDescription": "Framework-driven prioritization (value, effort, risk). We help you decide what to build next so capacity is focused on the highest-impact work.",
  "stakeholderManagement": "Stakeholder Management",
  "stakeholderManagementDescription": "Clear communication, expectations, and alignment with internal and external stakeholders. We keep everyone informed and bought in so delivery stays on track.",
  "projectManagementExpertiseHeader": "Project Management",
  "projectManagementExpertiseDescription": "Delivery discipline so your software projects stay on scope, schedule, and quality.",
  "projectManagementOverview": "We apply proven project management practices—planning, tracking, risk and resource management—tailored to your team size and methodology. We keep projects visible and predictable so you can deliver on commitments and adapt when priorities change.",
  "projectManagementPoints": "Key Disciplines",
  "projectPlanning": "Project Planning",
  "projectPlanningDescription": "Scoped plans, milestones, and dependencies. We define clear deliverables and timelines so execution is predictable and aligned with business goals.",
  "resourceManagement": "Resource Management",
  "resourceManagementDescription": "Capacity planning and allocation across teams and sprints. We help balance workload and skills so delivery stays sustainable and on track.",
  "riskManagement": "Risk Management",
  "riskManagementDescription": "Identification, assessment, and mitigation of technical and project risks. We surface and address risks early so issues don’t derail delivery.",
  "qualityAssurance": "Quality Assurance",
  "qualityAssuranceDescription": "Quality gates, acceptance criteria, and release readiness. We ensure standards are met so releases are reliable and supportable.",
  "overview": "Aperçu",
  "privacyPolicyTitle": "Politique de Confidentialité",
  "effectiveDate": "Date d'Effet",
  "effectiveDateValue": "10/05/2024",
  "introduction": "Introduction",
  "informationWeDoNotCollect": "Informations Que Nous Ne Collectons Pas",
  "informationCollectedByServers": "Informations Collectées par les Serveurs et Technologies",
  "legalUse": "Utilisation Légale",
  "limitationOfLiability": "Limitation de Responsabilité",
  "changesToPolicy": "Modifications de Cette Politique de Confidentialité",
  "privacyWelcomeMessage": "Bienvenue sur NeedleTails.com. Votre confidentialité est importante pour nous.",
  "privacyPurpose": "Cette Politique de Confidentialité décrit nos pratiques concernant la collecte d'informations lorsque vous visitez notre site.",
  "personalInformation": "Nous ne collectons aucune information personnelle de nos utilisateurs.",
  "informationOverview": "Bien que nous ne collections pas d'informations personnelles, veuillez être conscient que les serveurs et autres technologies peuvent collecter certaines informations automatiquement.",
  "legalUseOverview": "En utilisant notre Site, vous acceptez de vous conformer à toutes les lois et réglementations locales applicables.",
  "userResponsibility": "Il est de votre responsabilité de vous assurer que votre utilisation du Site est légale dans votre juridiction.",
  "privacyLimitationOverview": "L'auteur de ce site web ne sera pas tenu responsable de tout dommage ou perte résultant de votre utilisation du Site.",
  "privacyUserAcknowledgment": "En utilisant le Site, vous reconnaissez que vous le faites à vos propres risques et que l'auteur n'est pas responsable de toute conséquence résultant de votre utilisation.",
  "privacyChangesToPolicy": "Nous pouvons mettre à jour notre Politique de Confidentialité de temps à autre. Nous vous informerons de tout changement en publiant la nouvelle Politique de Confidentialité sur cette page. Il vous est conseillé de réviser cette Politique de Confidentialité périodiquement pour tout changement.",
  "cookies": "Cookies",
  "cookiesDescription": "Les cookies peuvent être utilisés pour améliorer l'expérience utilisateur. Ceux-ci peuvent inclure :",
  "sessionCookies": "Cookies de Session : Cookies temporaires qui expirent lorsque vous fermez votre navigateur.",
  "persistentCookies": "Cookies Persistants : Cookies qui restent sur votre appareil pour une période définie ou jusqu'à suppression.",
  "analytics": "Analytics",
  "analyticsDescription": "Nous pouvons utiliser des services d'analytics tiers qui collectent des informations sur l'utilisation du site web, telles que :",
  "pageViews": "Pages Vues",
  "userInteractions": "Interactions Utilisateur",
  "trafficSources": "Sources de Trafic",
  "serverLogs": "Logs Serveur",
  "serverLogsDescription": "Les serveurs web peuvent enregistrer des informations sur votre visite, incluant :",
  "ipAddress": "Adresse IP",
  "browserType": "Type de Navigateur",
  "operatingSystem": "Système d'Exploitation",
  "referringUrl": "URL de Référence",
  "pagesVisited": "Pages Visitées",
  "timeAndDateOfAccess": "Heure et Date d'Accès",
  "termsTitle": "Conditions Générales",
  "termsEffectiveDate": "Date d'Effet : 10/05/2024",
  "userAgreement": "Accord Utilisateur",
  "prohibitedActivities": "Activités Interdites",
  "changesToTerms": "Modifications de Ces Conditions",
  "termsWelcomeMessage": "Bienvenue dans nos Conditions Générales.",
  "termsPurpose": "Ces conditions régissent votre utilisation de nos services.",
  "userAgreementText": "En utilisant nos services, vous acceptez ces conditions.",
  "prohibitedActivitiesOverview": "Les activités suivantes sont interdites :",
  "usingServiceForIllegalPurposes": "Utiliser le service à des fins illégales.",
  "engagingInHarassment": "Se livrer à toute forme de harcèlement ou d'abus.",
  "unauthorizedAccess": "Tenter d'obtenir un accès non autorisé à nos systèmes.",
  "distributingMalware": "Distribuer des logiciels malveillants ou des virus.",
  "termsLimitationOverview": "Nous ne sommes pas responsables de tout dommage indirect, incident ou consécutif.",
  "termsUserAcknowledgment": "Vous reconnaissez que vous utilisez nos services à vos propres risques.",
  "termsChangesToTerms": "Nous pouvons mettre à jour ces conditions de temps à autre. Veuillez les réviser régulièrement.",
  "spineTailedKitTitle": "PQSRTC",
  "spineTailedKitDescription": "PQSRTC vise à fournir un protocole RTC rationalisé en Swift, avec chiffrement post-quantique activé par défaut. Il s’agit d’un SDK basé sur WebRTC qui se concentre sur des solutions modernes, sûres et haute performance pour les applications vocales et vidéo sur les plateformes Android et Apple, avec une logique partagée écrite en Swift.",
  "needleTailKitTitle": "NeedleTailKit",
  "needleTailKitDescription": "Qu'est-ce que NeedleTailKit ? NTK est le SDK principal pour les Applications Client et Serveur NeedleTail, permettant la création d'applications belles et chiffrées de bout en bout. Il peut être utilisé pour diverses applications au-delà de la messagerie. Intéressé ? Contactez-nous pour en savoir plus !",
  "needleTailIRCTitle": "NeedleTailIRC",
  "needleTailIRCDescription": "Une bibliothèque cliente IRC moderne pour les applications Swift. NeedleTailIRC fournit une interface robuste et sûre pour se connecter aux serveurs IRC, gérer les canaux et gérer la communication en temps réel. Construite avec Swift Concurrency pour des performances optimales.",
  "connectionManagerKitTitle": "ConnectionManagerKit",
  "connectionManagerKitDescription": "Un framework complet de gestion de connexions pour les applications Swift. ConnectionManagerKit simplifie la connectivité réseau, le regroupement de connexions et la gestion du cycle de vie des connexions. Parfait pour les applications nécessitant une communication réseau fiable.",
  "postQuantumSolaceTitle": "PostQuantumSolace",
  "postQuantumSolaceDescription": "Une bibliothèque de cryptographie post-quantique pour les applications Swift. PostQuantumSolace fournit des algorithmes et protocoles cryptographiques résistants à l'informatique quantique, garantissant que vos applications restent sécurisées à l'ère de l'informatique quantique.",
  "whiteTippedSocketsTitle": "White Tipped Sockets",
  "whiteTippedSocketsDescription": "WhiteTippedSockets est une bibliothèque WebSocket native pour iOS et macOS, construite sur l'API Network.framework utilisant Swift Concurrency. Notre objectif est de fournir une solution moderne et efficace pour la communication WebSocket, et nous prévoyons également de développer un serveur entièrement fonctionnel et évolutif à l'avenir.",
  "swiftHlsTitle": "Swift HLS",
  "swiftHlsDescription": "HTTP Live Streaming (HLS) est une technologie clé pour le streaming média efficace, et SwiftHLS est conçu pour faciliter cela. Utilisant le même protocole qui alimente le web, HLS permet la livraison de contenu via des APIs REST et des CDN. Son but est de fournir la fiabilité et s'adapte dynamiquement aux conditions réseau.",
  "swiftIapTitle": "Swift IAP",
  "swiftIapDescription": "SwiftIAP est une bibliothèque complète d'Achats In-App pour les applications iOS et macOS. Elle fournit une interface moderne et type-safe pour gérer les achats in-app, les abonnements et la validation des reçus. Construite avec Swift Concurrency et conçue pour la facilité d'utilisation.",
  "stompTitle": "Stomp",
  "stompDescription": "Stomp est une bibliothèque Swift pour la communication de protocole STOMP. Elle fournit une interface moderne et type-safe pour se connecter aux serveurs STOMP et gérer le routage des messages. Parfait pour les applications qui ont besoin d'une infrastructure de messagerie fiable.",
  "privacy": "Politique de Confidentialité",
  "termsConditions": "Conditions Générales",
  "projectTitle_1": "Projets",
  "projectHeader_1": "PQSRTC",
  "projectTitleText_1": "Solution RTC VoIP",
  "projectTitle_2": "Projets",
  "projectHeader_2": "NeedleTailKit",
  "projectTitleText_2": "Solution de Messagerie Chiffrée de Bout en Bout",
  "projectTitle_3": "Projets",
  "projectHeader_3": "White Tipped Sockets",
  "projectTitleText_3": "Wrapper Swift Concurrent Network.framework",
  "projectTitle_4": "Projets",
  "projectHeader_4": "Swift Stomp",
  "projectTitleText_4": "Protocole STOMP Swift Concurrent",
  "projectTitle_5": "Projets",
  "projectHeader_5": "Swift HLS",
  "projectTitleText_5": "Projet Swift HLS",
  "pageNotFound": "Page Non Trouvée",
  "pageNotFoundDescription": "La page que vous recherchez n'existe pas ou a été déplacée. Laissez-nous vous remettre sur la bonne voie.",
  "goHome": "Accueil",
  "goBack": "Retour",
  "contact": "Contact",
  "contactUs": "Contactez-Nous",
  "becomeASponsor": "Devenir un Sponsor",
  "supportOpenSourceMessage": "Soutenez nos projets open source et aidez-nous à continuer de construire des logiciels incroyables.",
  "getStartedOnDigitalOcean": "Commencez sur Digital Ocean avec un crédit de 100$, 60 jours pour les nouveaux utilisateurs.",
  "readyToGetStarted": "Prêt à Commencer ?",
  "letsDiscussProject": "Discutons de votre projet et voyons comment nous pouvons vous aider à donner vie à vos idées avec des solutions alimentées par Swift.",
  "backToTop": "Retour en Haut",
  "needleTailsCopyright": "NeedleTails©",
  "pointsForConsideration": "Points de Considération",
  "responsiveDesign": "Responsive & Adaptive Design",
  "responsiveDesignDescription": "Layouts and components that adapt to all viewports and devices. We deliver consistent, high-quality experiences on desktop, tablet, and mobile so your web product works everywhere your users are.",
  "crossBrowserCompatibility": "Cross-Browser & Standards Compliance",
  "crossBrowserCompatibilityDescription": "Testing and compatibility across major browsers and standards. We ensure consistent behavior and appearance so your application works reliably for every user, regardless of browser or device.",
  "webPerformanceOptimizationDescription": "Performance budgets, lazy loading, and optimized assets. We minimize load times and resource usage through efficient code, caching, and CDN strategies so your site feels fast and remains cost-effective at scale.",
  "userExperience": "User Experience & Accessibility",
  "userExperienceDescription": "Clear information architecture, intuitive navigation, and WCAG-aligned accessibility. We design and implement UX that drives engagement and meets enterprise usability and compliance expectations.",
  "securityPractices": "Security & Data Protection",
  "securityPracticesDescription": "HTTPS, secure headers, input validation, and protection against OWASP-top risks including XSS and CSRF. We harden web applications so your data and your users stay secure in production.",
  "seoBestPractices": "SEO & Discoverability",
  "seoBestPracticesDescription": "Semantic structure, meta tags, and content strategy aligned with search best practices. We optimize for discoverability and ranking so your web presence supports your business and marketing goals.",
  "backendSolutionsHeader": "Server-Side Solutions",
  "backendSolutionsDescription": "We design and deliver production-grade backends that power your business. Our server-first approach ensures APIs, data pipelines, and integrations are built for reliability, compliance, and scale—so your applications perform under real-world load and security requirements.",
  "backendCapabilitiesOverview": "Our server-side practice is built on Swift (Vapor, Hummingbird, SwiftNIO) and proven cloud-native patterns. We deliver secure, high-performance backends—REST and custom APIs, event-driven systems, and seamless integration with your existing stack. From architecture through deployment and observability, we own the full lifecycle so your teams can focus on product, not infrastructure.",
  "scalability": "Scalability & Resilience",
  "scalabilityDescription": "Architectures designed for growth: horizontal scaling, stateless services, and resilient patterns. We apply microservices, serverless, and queue-based designs so your backend handles traffic spikes and data growth without rework.",
  "security": "Security & Compliance",
  "securityDescription": "Robust security by default: encryption at rest and in transit, identity and access control, audit trails, and alignment with common compliance frameworks. We harden backends so your data and your users stay protected.",
  "maintainability": "Maintainability & Standards",
  "maintainabilityDescription": "Clean, modular, and well-documented codebases with consistent patterns and version control. We adopt and document coding standards so your team can maintain and extend the system with confidence.",
  "testingAndQualityAssurance": "Testing & Quality Assurance",
  "testingAndQualityAssuranceDescription": "Rigorous testing strategies: unit, integration, and contract tests with CI/CD automation. We maintain high quality and regression safety so releases are predictable and low-risk.",
  "monitoringAndLogging": "Monitoring & Observability",
  "monitoringAndLoggingDescription": "Production-ready observability: structured logging, metrics, and alerting. We instrument backends so you have clear visibility into health, performance, and incidents—and can respond before users are affected.",
  "nativeAppDevelopmentHeader": "Native Application Development",
  "nativeAppDevelopmentDescription": "We deliver native applications built for performance, security, and great user experience—on every platform your business requires.",
  "nativeAppDevelopmentOverview": "We build production-ready native apps for the full Apple ecosystem (iOS, iPadOS, macOS, tvOS, watchOS, visionOS) and Android. Our work emphasizes type-safe Swift and Kotlin/Java, platform-appropriate UX, accessibility, and security-by-design. From MVPs to large-scale deployments, we handle architecture, store readiness, and ongoing support so your apps stay performant, compliant, and maintainable.",
  "designConsistency": "Design Systems & Consistency",
  "designConsistencyDescription": "Unified design systems and component libraries across platforms. We ensure consistent branding, interaction patterns, and accessibility so your product feels cohesive on every device.",
  "deviceFragmentation": "Device & Platform Coverage",
  "deviceFragmentationDescription": "Structured testing across device matrices, screen sizes, and OS versions. We validate behavior and performance so your app works reliably for all target users, including edge cases.",
  "userExperienceUX": "User Experience & Accessibility",
  "userExperienceUXDescription": "Intuitive flows, clear information architecture, and WCAG-aligned accessibility. We design and implement UX that serves all users and supports usability and compliance goals.",
  "distributionCompliance": "Distribution & Store Compliance",
  "distributionComplianceDescription": "App Store and Play Store readiness: guidelines, privacy labels, and review best practices. We prepare and maintain your apps for public and private distribution channels.",
  "webDevelopmentExpertiseHeader": "Web Application Development",
  "webDevelopmentExpertiseDescription": "We build and maintain web applications that support your business goals—from marketing sites and portals to full-stack web apps that integrate with your existing systems.",
  "webDevelopmentOverview": "We deliver production-grade web experiences: responsive sites, SPAs, and full-stack applications built with Vue.js, Nuxt, and TypeScript on the front end, and Vapor, Hummingbird, or your preferred backend. Our work covers corporate sites, customer portals, internal tools, and public-facing apps—with a focus on performance, security, SEO, and maintainability so your web presence scales with your organization.",
  "solutionsTitle": "Nos Solutions",
  "featuredApplications": "Applications en Vedette",
  "our": "Nos",
  "featuredApps": "Apps en Vedette",
  "featuredAppsDescription": "Découvrez nos applications innovantes qui montrent la puissance du développement Swift et de l'architecture logicielle moderne.",
  "nudgeTitle": "Secure Messaging You Control",
  "nudgeDescription": "End-to-end encrypted messaging with optional self-hosting. Your data stays yours—no third-party storage, no persistence risk. Run your own instance or scale globally.",
  "islandHoppersTitle": "Island Hoppers : Votre App de Tours Ultime pour des Aventures Sans Problème !",
  "islandHoppersDescription": "Island Hoppers est l'app tout-en-un conçue pour améliorer votre expérience de voyage, que vous soyez une entreprise organisant des tours inoubliables ou un client cherchant l'évasion parfaite. Pour les entreprises, notre app rationalise tout le processus de gestion des tours. Organisez et personnalisez vos tours sans effort, communiquez directement avec les guides touristiques et gardez vos clients informés avec des mises à jour en temps réel. Avec Island Hoppers, vous pouvez gérer les réservations, suivre les préférences des clients et vous assurer que chaque détail est pris en charge, vous permettant de vous concentrer sur la livraison d'expériences exceptionnelles. Pour les clients, Island Hoppers offre une gamme diversifiée de forfaits de tours adaptés à divers types de groupes, y compris les familles, les routards et les passionnés de fêtes. Parcourez notre sélection d'aventures organisée, choisissez le forfait parfait qui correspond à votre style et connectez-vous avec des voyageurs partageant les mêmes idées. Profitez d'une communication fluide avec vos guides touristiques, accédez aux informations essentielles et recevez des recommandations personnalisées pour tirer le meilleur parti de votre voyage. Avec Island Hoppers, embarquez pour des aventures inoubliables avec facilité et confiance, sachant que chaque aspect de votre tour n'est qu'à un clic !",
  "streamStackTitle": "Une Plateforme Éducative pour vos Solutions Logicielles",
  "streamStackDescription": "Diffusez, Lisez, Discutez. Que vous soyez nouveau en programmation ou que vous vouliez lire sur différentes solutions logicielles, nous vous facilitons la tâche avec notre application Nuxt propulsée par Vapor. Restez à jour avec les dernières tendances de codage.",
  "welcomeToNeedleTails": "Bienvenue chez NeedleTails - Votre Allié en Développement Logiciel",
  "accept": "J'accepte et j'accepte",
  "cookieConsentTitle": "Nous utilisons le stockage du navigateur",
  "cookieConsentMessage": "Nous utilisons le stockage du navigateur pour mémoriser votre préférence de langue et améliorer votre expérience de navigation. En cliquant sur 'Accepter Tout', vous consentez à notre utilisation du stockage du navigateur.",
  "cookieConsentAcceptAll": "Accepter Tout",
  "cookieConsentAcceptNecessary": "Nécessaires Seulement",
  "cookieConsentReject": "Rejeter Tout",
  "cookieConsentLearnMore": "En Savoir Plus",
  "cookieConsentNecessary": "Le stockage nécessaire inclut la détection de langue pour fournir du contenu dans votre langue préférée.",
  "cookieConsentAnalytics": "Nous n'utilisons actuellement pas de suivi d'analyse sur ce site web.",
  "cookieConsentPreferences": "Le stockage des préférences mémorise vos paramètres comme le thème et les préférences utilisateur pour personnaliser votre expérience.",
  "cookieConsentMarketing": "Nous n'utilisons actuellement pas de suivi marketing ou de publicité sur ce site web.",
  "brewhubWidgetTitle": "BrewHub",
  "brewhubWidgetDescription": "Plateforme professionnelle de cours et d'instruction en développement logiciel. Accédez à une formation guidée en direct avec des outils et des flux de travail de niveau production pour améliorer vos compétences en développement.",
  "brewhubWidgetCTA": "Cours de Formation",
  "brewhubComingSoonTitle": "Disponible",
  "brewhubComingSoonDescription": "BrewHub est désormais disponible. Visitez brewhub.needletails.com pour des cours et formations professionnels en développement logiciel.",
  "brewhubFeature1Title": "Cours d'experts",
  "brewhubFeature1Description": "Accédez à des cours professionnels de développement logiciel dispensés par des experts du secteur.",
  "brewhubFeature2Title": "Formation en direct",
  "brewhubFeature2Description": "Formation en direct individuelle ou en petit groupe avec accompagnement d'experts.",
  "brewhubFeature3Title": "Communauté",
  "brewhubFeature3Description": "Rejoignez une communauté de développeurs et apprenez ensemble.",
  "brewhubFeature4Title": "Outils de production",
  "brewhubFeature4Description": "Apprenez avec les mêmes outils et flux de travail utilisés en production.",
  "brewhubBackToMainSite": "Aller sur BrewHub",
  "brewhubMetaTitle": "BrewHub | NeedleTails",
  "brewhubMetaDescription": "BrewHub est la plateforme de NeedleTails pour des cours et des formations professionnels en développement logiciel.",
  "brewhubOgDescription": "Cours et formations professionnels en développement logiciel.",
  "brewhubLogoAlt": "Logo BrewHub",
  "needletailKitTitle": "NeedleTailKit",
  "needletailKitSubtitle": "Un SDK Swift complet et prêt pour la production pour créer des applications de messagerie sécurisées avec chiffrement de bout en bout et des fonctionnalités de sécurité de niveau entreprise.",
  "needletailKitPrivateBadge": "SDK Privé - Licence Requise",
  "needletailKitRequestLicense": "Demander une Licence",
  "needletailKitExploreFeatures": "Explorer les Fonctionnalités",
  "needletailKitFeaturesTitle": "Fonctionnalités de Niveau Entreprise",
  "needletailKitFeaturesDescription": "Construit pour la production avec une sécurité de pointe et une architecture Swift moderne.",
  "needletailKitSecurityTitle": "Sécurité Entreprise",
  "needletailKitSecurityPQ": "Cryptographie Post-Quantique - À l'épreuve des attaques quantiques",
  "needletailKitSecurityDoubleRatchet": "Protocole Double Ratchet - Secret direct parfait",
  "needletailKitSecurityE2E": "Chiffrement de Bout en Bout - Tous les messages chiffrés par défaut",
  "needletailKitSecurityDeviceVerification": "Vérification des Appareils - Liaison cryptographique des appareils",
  "needletailKitPlatformTitle": "Support Multi-Plateforme",
  "needletailKitPlatformIOS": "iOS 18.0+ - Support iOS natif complet",
  "needletailKitPlatformMacOS": "macOS 15.0+ - Intégration macOS complète",
  "needletailKitPlatformSwift6": "Swift 6.0+ - Dernières fonctionnalités du langage",
  "needletailKitPlatformAsync": "Async/Await - Concurrence moderne partout",
  "needletailKitTransportTitle": "Transport Intelligent",
  "needletailKitTransportMulti": "Routage Multi-Transport - Sélection automatique du chemin",
  "needletailKitTransportP2P": "P2P Réseau Local - Communication directe entre appareils",
  "needletailKitTransportDCC": "Protocole DCC - P2P basé sur IRC avec TLS",
  "needletailKitTransportFailover": "Basculement Automatique - Changement de transport transparent",
  "needletailKitMessagingTitle": "Messagerie Riche",
  "needletailKitMessagingText": "Messages Texte - Communication simple et sécurisée",
  "needletailKitMessagingMedia": "Messages Média - Images, vidéos, documents",
  "needletailKitMessagingSelfDestruct": "Messages Auto-Destructifs - Support temporaire",
  "needletailKitMessagingEdit": "Édition de Messages - Modifier les messages envoyés",
  "needletailKitVoiceVideoTitle": "Appels Vocaux et Vidéo",
  "needletailKitVoiceVideoWebRTC": "Intégration WebRTC - Appels de haute qualité",
  "needletailKitVoiceVideoSTUN": "Support STUN/TURN - Traversée NAT",
  "needletailKitVoiceVideoCallManagement": "Gestion des Appels - Gestion complète du cycle de vie",
  "needletailKitEnterpriseTitle": "Prêt pour l'Entreprise",
  "needletailKitEnterpriseProduction": "Prêt pour la Production - Testé dans des applications réelles",
  "needletailKitEnterpriseSupport": "Support Entreprise - Support professionnel disponible",
  "needletailKitEnterpriseCompliance": "Conformité - Construit pour la conformité réglementaire",
  "needletailKitEnterpriseScalability": "Évolutivité - Conçu pour des déploiements à grande échelle",
  "needletailKitQuickStartTitle": "Quick Start",
  "needletailKitQuickStartDescription": "Get started with NeedleTailKit in minutes. Follow these simple steps to integrate secure messaging into your application.",
  "needletailKitInstallTitle": "Installation",
  "needletailKitInstallCode": "dependencies: [\n    .package(url: \"https://github.com/needletails/needle-tail-kit.git\", from: \"1.0.0\")\n]",
  "needletailKitInitializeTitle": "Initialize Session",
  "needletailKitInitializeCode": "import NeedleTailKit\n\nlet session = NeedleTailSession.shared\ntry await session.createNewUserAccount(\n    authInfo: authInfo,\n    store: store,\n    eventObserver: eventObserver\n)",
  "needletailKitSendMessageTitle": "Send Your First Message",
  "needletailKitSendMessageCode": "let contact = try await session.createContact(contact: \"bob\")\ntry await session.sendMessage(\n    messageType: .text,\n    recipient: .nickname(\"bob\"),\n    text: \"Hello, World!\"\n)",
  "needletailKitContactTitle": "Demander une Licence",
  "needletailKitContactDescription": "NeedleTailKit est un SDK propriétaire à code source fermé. Contactez-nous pour discuter des options de licence pour votre projet.",
  "needletailKitContactButton": "Contacter pour Licence",
  "needletailKitMetaTitle": "NeedleTailKit - SDK de Messagerie Sécurisée Entreprise | NeedleTails",
  "needletailKitMetaDescription": "SDK Swift prêt pour la production pour créer des applications de messagerie sécurisées avec chiffrement de bout en bout. Cryptographie post-quantique, support multi-plateforme et sécurité de niveau entreprise.",
  "needletailKitOgDescription": "SDK Swift prêt pour la production pour la messagerie sécurisée avec des fonctionnalités de sécurité de niveau entreprise.",
  "needletailKitLogoAlt": "Logo NeedleTailKit",
  "needletailKitPlatformAndroid": "Android : API 24 (Android 7.0) ou ultérieur",
  "nudgeWidgetTitle": "Sécurisé avec Nudge",
  "nudgeWidgetDescription": "Optionnellement autosurveillé, messagerie avec chiffrement de bout en bout avec contrôle complet des données.",
  "nudgeWidgetCTA": "En Savoir Plus",
  "nudgeWidgetLogoAlt": "Logo Nudge",
  "nudgeFeature1Title": "End-to-End Encryption",
  "nudgeFeature1Description": "Every message encrypted by default. Full privacy.",
  "nudgeFeature2Title": "Your Data, Your Rules",
  "nudgeFeature2Description": "Optional self-hosting. No external data storage.",
  "nudgeFeature3Title": "Secure Channels",
  "nudgeFeature3Description": "Private messaging built for security.",
  "nudgeFeature4Title": "Global or Self-Hosted",
  "nudgeFeature4Description": "Scale globally or run your own instance—no data persistence risk.",
  "nudgeContactButton": "Découvrir Nudge",
  "nudgeMetaTitle": "Nudge - Messagerie Sécurisée avec Chiffrement de Bout en Bout | NeedleTails",
  "nudgeMetaDescription": "Application de messagerie avec chiffrement de bout en bout et données optionnellement autosurveillées avec contrôle complet des données. Communication sécurisée sans risques de persistance des données.",
  "nudgeOgDescription": "Messagerie avec chiffrement de bout en bout et données optionnellement autosurveillées avec contrôle complet des données et sécurité de niveau entreprise.",
  "nudgeMetaKeywords": "Nudge, messagerie sécurisée, chiffrement de bout en bout, application de messagerie chiffrée, messagerie optionnellement autosurveillée, messagerie privée, communication sécurisée, confidentialité des données, sécurité de la messagerie, chat chiffré, application de chat sécurisée, messagerie axée sur la confidentialité",
  "brewhubMetaKeywords": "BrewHub, cours de développement logiciel, cours de programmation, formation de développeurs, éducation logicielle, cours de codage, tutoriels de développement, formation technique, plateforme d'apprentissage logiciel, tutoriels de programmation, cours de développement web, cours de développement mobile, formation en développement backend",
  "needletailKitMetaKeywords": "NeedleTailKit, SDK Swift, chiffrement de bout en bout, messagerie sécurisée, SDK iOS, SDK macOS, SDK Android, cryptographie post-quantique",
  "heroTagline": "Nous relevons vos défis—apps, sites web et solutions logicielles intégrées.",
  "managementPageLabel": "Management",
  "managementPageTitle": "Product & Project Delivery",
  "managementPageLead": "We align vision, roadmap, and execution so your software projects stay on scope, schedule, and quality.",
  "managementCtaLead": "Ready to align your next project?",
  "consultationPageLabel": "Consultation",
  "consultationCtaLead": "Tell us about your goals and we'll outline a clear path forward."
}
