{
  "introHeaderTwo": "Vous avez la vision ; nous livrons la solution. Que ce soit une app mobile, un site web moderne ou un système logiciel complet, nous transformons vos défis en produits fiables et sécurisés. Avec une expérience entreprise sur Mobile, Web et Serveur, nous construisons et intégrons des solutions qui évoluent—pour que vous puissiez vous concentrer sur votre activité.",
  "menuItemOne": "Cours",
  "menuItemTwo": "Consultation",
  "menuItemThree": "Gestion",
  "getInTouch": "Nous Contacter",
  "projectsHeader": "Notre Logiciel",
  "projectsDescription": "Nous nous consacrons à vous fournir une large gamme de logiciels open-source. Pour soutenir cette mission, nous proposons également certains logiciels propriétaires. Nous vous invitons à explorer nos projets, qui incluent des options open-source et propriétaires. Si vous êtes intéressé par contribuer ou obtenir une licence pour nos logiciels propriétaires, n'hésitez pas à nous contacter.",
  "projectsOverview": "Voici une liste de ce que nous faisons et ce que nous avons fait",
  "businessOverviewTitle": "Spécialistes en Logiciel Swift",
  "badgeMobile": "Mobile",
  "badgeWeb": "Web",
  "badgeServer": "Serveur",
  "businessOverviewDescription": "Nous transformons vos défis logiciels en solutions prêtes pour la production. Que vous ayez besoin d'une nouvelle app, d'un site web moderne ou de systèmes qui s'intègrent parfaitement, nous livrons sur Mobile, Web et Serveur—dans la langue adaptée à votre projet. Notre expertise Swift apporte sécurité des types, performance et fiabilité ; nous nous intégrons aussi à votre stack existant. Faites équipe avec nous pour des solutions durables qui évoluent avec votre entreprise.",
  "serviceHeaderBackendDevelopment": "Backend et APIs",
  "serviceDescriptionBackendDevelopment": "Relevez les défis de scalabilité et d'intégration avec des solutions serveur robustes. Nous construisons et connectons APIs, bases de données et services pour que vos apps et sites fonctionnent de façon fiable à toute échelle.",
  "serviceHeaderMobileAppDevelopment": "Apps Mobiles",
  "serviceDescriptionMobileAppDevelopment": "Obtenez une app native que les utilisateurs adorent. Nous développons des apps iOS, Android et multiplateformes qui résolvent de vrais problèmes—à temps et prêtes pour les stores.",
  "serviceHeaderTraining": "BrewHub",
  "serviceDescriptionTraining": "Formez votre équipe avec des cours professionnels de développement logiciel. Formation guidée en direct avec des outils de niveau production pour que vous puissiez construire et maintenir des solutions en interne.",
  "serviceHeaderWebDevelopment": "Développement Web",
  "serviceDescriptionWebDevelopment": "Sites et applications web qui fonctionnent partout. Nous livrons des expériences réactives, rapides et sécurisées qui attirent les utilisateurs et soutiennent les objectifs de votre entreprise.",
  "openSourceHeader": "Open Source",
  "openSourceDescription": "Nous croyons en la puissance de l'open source. Explorez nos projets sur GitHub et contribuez à la communauté. Votre soutien nous aide à continuer de développer des solutions innovantes.",
  "whyChooseSwift": "Pourquoi Choisir Swift ?",
  "typeSafety": "Sécurité des Types",
  "typeSafetyDescription": "Le système de types de Swift prévient les erreurs au moment de la compilation, assurant que vos applications sont robustes et fiables dès le premier jour.",
  "performance": "Performance",
  "performanceDescription": "Une faible empreinte mémoire et des performances élevées rendent Swift idéal pour les environnements à ressources limitées et les applications exigeantes.",
  "threadSafety": "Sécurité des Threads",
  "threadSafetyDescription": "Le support de concurrence intégré assure que vos applications gèrent efficacement plusieurs tâches sans conditions de course.",
  "ourServices": "Comment Nous Relevons Vos Défis",
  "servicesDescription": "Du concept au lancement et au-delà, nous livrons les apps, sites web et intégrations dont vous avez besoin. Décrivez-nous votre défi—nous concevons, construisons et assurons le support de la solution.",
  "startYourProject": "Démarrer Votre Projet",
  "swiftNative": "Natif",
  "support": "Support",
  "possibilities": "Possibilités",
  "makingYour": "Rendre Vos",
  "ideasReality": "Idées en Réalité",
  "swiftSoftwareSpecialists": "Spécialistes en Logiciel Swift",
  "swift": "Swift",
  "swiftServer": "Swift-Serveur",
  "frequentlyAskedQuestions": "Questions Fréquemment Posées",
  "faqDescription": "Obtenez des réponses aux questions courantes sur nos services de développement logiciel",
  "faqTechnologies": "Dans quelles technologies vous spécialisez-vous ?",
  "faqTechnologiesAnswer": "Nous nous spécialisons dans le développement web moderne utilisant une large gamme de technologies incluant, mais sans s'y limiter, Nuxt, Vue, Vapor et SwiftNIO. Notre expertise linguistique inclut TypeScript et Swift. Nous travaillons également avec des solutions backend robustes, des services cloud, des APIs et une architecture évolutive pour livrer des applications haute performance.",
  "faqTimeline": "Combien de temps prend un projet typique ?",
  "faqTimelineAnswer": "Les délais de projet varient selon la complexité. Les applications web simples prennent 4-8 semaines, tandis que les solutions d'entreprise complexes peuvent prendre 3-6 mois. Nous fournissons des délais détaillés lors de la consultation.",
  "faqSupport": "Fournissez-vous un support et une maintenance continus ?",
  "faqSupportAnswer": "Oui, nous offrons des packages de support complets incluant une surveillance 24/7, des mises à jour régulières, des correctifs de sécurité et des améliorations de fonctionnalités pour assurer que votre application reste actuelle et sécurisée.",
  "faqProcess": "Quel est votre processus de développement ?",
  "faqProcessAnswer": "Nous suivons une approche collaborative avec une communication client régulière, un développement itératif et des tests continus. Notre processus inclut les phases de planification, conception, développement, test et déploiement.",
  "faqIntegration": "Pouvez-vous travailler avec des systèmes et APIs existants ?",
  "faqIntegrationAnswer": "Absolument ! Nous avons une vaste expérience d'intégration avec des systèmes existants, des APIs et des bases de données. Nous pouvons améliorer, moderniser ou complètement reconstruire votre infrastructure actuelle.",
  "faqSecurity": "Qu'en est-il de la sécurité et de la protection des données ?",
  "faqSecurityAnswer": "La sécurité est par défaut dans tout ce que nous construisons. Nous implémentons des pratiques de développement logiciel axées sur la sécurité, des mesures de sécurité conformes aux standards de l'industrie, le chiffrement des données et des audits de sécurité réguliers pour protéger vos données et les informations de vos utilisateurs.",
  "consultingTitle": "Vos défis, notre expertise",
  "consultingOverview": "Que vous définissiez un nouveau produit, modernisiez des systèmes legacy ou choisissiez stack et architecture—nous apportons un accompagnement structuré pour que vos décisions s’appuient sur l’expérience et soient alignées avec vos objectifs.",
  "consultWithUs": "Parlez-nous de votre initiative",
  "consultingWithUsMessage": "Partagez vos objectifs, contraintes et délais. Nous vous proposerons des options, des compromis et un chemin clair—périmètre, technologie et ce qu’il faut pour y arriver.",
  "whatToConsultAbout": "Ce sur quoi nous pouvons vous aider",
  "architectureDesign": "Architecture et conception système",
  "architectureDesignDescription": "Architectures évolutives et maintenables pour systèmes nouveaux et existants. Nous vous aidons à choisir les patterns, limites et approches d’intégration pour une solution prête pour la production et la croissance.",
  "technologySelection": "Technologie et choix de stack",
  "technologySelectionDescription": "Évaluation objective des technologies et fournisseurs selon vos besoins, compétences de l’équipe et maintenabilité à long terme.",
  "performanceOptimization": "Performance et scalabilité",
  "performanceOptimizationDescription": "Temps de réponse, débit et utilisation des ressources. Nous appliquons cache, répartition de charge, optimisation des requêtes et planification de capacité.",
  "securityReview": "Revue sécurité et conformité",
  "securityReviewDescription": "Posture de sécurité et alignement réglementaire. Nous évaluons la conception et l’implémentation face aux menaces et cadres courants.",
  "codeReview": "Revue de code et d’implémentation",
  "codeReviewDescription": "Revue experte de la qualité du code, des patterns et de la dette technique. Nous fournissons un retour actionnable pour une base maintenable et testable.",
  "bestPractices": "Processus et bonnes pratiques",
  "bestPracticesDescription": "Processus de développement, DevOps et pratiques de livraison. Nous vous aidons à adopter des flux qui améliorent la prévisibilité, la qualité et l’efficacité de l’équipe.",
  "trainingProgramsHeader": "Programmes de Formation",
  "trainingProgramsDescription": "Solutions de développement professionnel et de formation",
  "trainingOverview": "Programmes de formation complets pour améliorer les compétences de votre équipe",
  "trainingCourses": "Cours de Formation",
  "vueJsDevelopment": "Développement Vue.js",
  "vueJsDevelopmentDescription": "Apprenez les pratiques modernes de développement Vue.js avec Nuxt",
  "swiftBackendDevelopment": "Développement Backend Swift",
  "swiftBackendDevelopmentDescription": "Maîtrisez le développement backend Swift avec Vapor et SwiftNIO",
  "typescriptDevelopment": "Développement TypeScript",
  "typescriptDevelopmentDescription": "Construisez des applications robustes avec TypeScript",
  "securityFirstDevelopment": "Développement Sécurité-First",
  "securityFirstDevelopmentDescription": "Implémentez des pratiques de développement logiciel axées sur la sécurité",
  "productManagementExpertiseHeader": "Management de produit",
  "productManagementExpertiseDescription": "Management de produit structuré pour aligner vision, feuille de route et livraison avec les résultats métier.",
  "productManagementOverview": "Nous accompagnons les organisations orientées produit avec la découverte, la priorisation et les pratiques de cycle de vie. Des exigences et de l’insight marché à l’UX et à la planification de feuille de route.",
  "productManagementPoints": "Disciplines clés",
  "requirementsGathering": "Exigences et découverte",
  "requirementsGatheringDescription": "Recueil et documentation structurés des exigences fonctionnelles et non fonctionnelles.",
  "marketResearch": "Recherche marché et utilisateurs",
  "marketResearchDescription": "Compréhension fondée sur les preuves des utilisateurs, concurrents et du fit marché.",
  "userExperienceDesign": "Conception expérience utilisateur",
  "userExperienceDesignDescription": "Parcours centrés utilisateur, architecture de l’information et conception d’interaction.",
  "productStrategy": "Stratégie produit",
  "productStrategyDescription": "Vision, positionnement et feuille de route alignés avec les objectifs métier.",
  "featurePrioritization": "Priorisation des fonctionnalités",
  "featurePrioritizationDescription": "Priorisation basée sur des cadres (valeur, effort, risque). Nous vous aidons à décider quoi construire ensuite.",
  "stakeholderManagement": "Management des parties prenantes",
  "stakeholderManagementDescription": "Communication claire, attentes et alignement avec les parties prenantes internes et externes.",
  "projectManagementExpertiseHeader": "Management de projet",
  "projectManagementExpertiseDescription": "Discipline de livraison pour que vos projets logiciels respectent le périmètre, les délais et la qualité.",
  "projectManagementOverview": "Nous appliquons des pratiques éprouvées de management de projet—planification, suivi, gestion des risques et des ressources—adaptées à la taille et à la méthodologie de votre équipe.",
  "projectManagementPoints": "Disciplines clés",
  "projectPlanning": "Planification de projet",
  "projectPlanningDescription": "Plans avec périmètre, jalons et dépendances. Nous définissons des livrables et délais clairs.",
  "resourceManagement": "Gestion des ressources",
  "resourceManagementDescription": "Planification et allocation de la capacité sur les équipes et sprints.",
  "riskManagement": "Gestion des risques",
  "riskManagementDescription": "Identification, évaluation et mitigation des risques techniques et projet.",
  "qualityAssurance": "Assurance qualité",
  "qualityAssuranceDescription": "Critères de qualité, critères d’acceptation et préparation à la release.",
  "overview": "Aperçu",
  "privacyPolicyTitle": "Politique de Confidentialité",
  "effectiveDate": "Date d'Effet",
  "effectiveDateValue": "10/05/2024",
  "introduction": "Introduction",
  "informationWeDoNotCollect": "Informations Que Nous Ne Collectons Pas",
  "informationCollectedByServers": "Informations Collectées par les Serveurs et Technologies",
  "legalUse": "Utilisation Légale",
  "limitationOfLiability": "Limitation de Responsabilité",
  "changesToPolicy": "Modifications de Cette Politique de Confidentialité",
  "privacyWelcomeMessage": "Bienvenue sur NeedleTails.com. Votre confidentialité est importante pour nous.",
  "privacyPurpose": "Cette Politique de Confidentialité décrit nos pratiques concernant la collecte d'informations lorsque vous visitez notre site.",
  "personalInformation": "Nous ne collectons aucune information personnelle de nos utilisateurs.",
  "informationOverview": "Bien que nous ne collections pas d'informations personnelles, veuillez être conscient que les serveurs et autres technologies peuvent collecter certaines informations automatiquement.",
  "legalUseOverview": "En utilisant notre Site, vous acceptez de vous conformer à toutes les lois et réglementations locales applicables.",
  "userResponsibility": "Il est de votre responsabilité de vous assurer que votre utilisation du Site est légale dans votre juridiction.",
  "privacyLimitationOverview": "L'auteur de ce site web ne sera pas tenu responsable de tout dommage ou perte résultant de votre utilisation du Site.",
  "privacyUserAcknowledgment": "En utilisant le Site, vous reconnaissez que vous le faites à vos propres risques et que l'auteur n'est pas responsable de toute conséquence résultant de votre utilisation.",
  "privacyChangesToPolicy": "Nous pouvons mettre à jour notre Politique de Confidentialité de temps à autre. Nous vous informerons de tout changement en publiant la nouvelle Politique de Confidentialité sur cette page. Il vous est conseillé de réviser cette Politique de Confidentialité périodiquement pour tout changement.",
  "cookies": "Cookies",
  "cookiesDescription": "Les cookies peuvent être utilisés pour améliorer l'expérience utilisateur. Ceux-ci peuvent inclure :",
  "sessionCookies": "Cookies de Session : Cookies temporaires qui expirent lorsque vous fermez votre navigateur.",
  "persistentCookies": "Cookies Persistants : Cookies qui restent sur votre appareil pour une période définie ou jusqu'à suppression.",
  "analytics": "Analytics",
  "analyticsDescription": "Nous pouvons utiliser des services d'analytics tiers qui collectent des informations sur l'utilisation du site web, telles que :",
  "pageViews": "Pages Vues",
  "userInteractions": "Interactions Utilisateur",
  "trafficSources": "Sources de Trafic",
  "serverLogs": "Logs Serveur",
  "serverLogsDescription": "Les serveurs web peuvent enregistrer des informations sur votre visite, incluant :",
  "ipAddress": "Adresse IP",
  "browserType": "Type de Navigateur",
  "operatingSystem": "Système d'Exploitation",
  "referringUrl": "URL de Référence",
  "pagesVisited": "Pages Visitées",
  "timeAndDateOfAccess": "Heure et Date d'Accès",
  "termsTitle": "Conditions Générales",
  "termsEffectiveDate": "Date d'Effet : 10/05/2024",
  "userAgreement": "Accord Utilisateur",
  "prohibitedActivities": "Activités Interdites",
  "changesToTerms": "Modifications de Ces Conditions",
  "termsWelcomeMessage": "Bienvenue dans nos Conditions Générales.",
  "termsPurpose": "Ces conditions régissent votre utilisation de nos services.",
  "userAgreementText": "En utilisant nos services, vous acceptez ces conditions.",
  "prohibitedActivitiesOverview": "Les activités suivantes sont interdites :",
  "usingServiceForIllegalPurposes": "Utiliser le service à des fins illégales.",
  "engagingInHarassment": "Se livrer à toute forme de harcèlement ou d'abus.",
  "unauthorizedAccess": "Tenter d'obtenir un accès non autorisé à nos systèmes.",
  "distributingMalware": "Distribuer des logiciels malveillants ou des virus.",
  "termsLimitationOverview": "Nous ne sommes pas responsables de tout dommage indirect, incident ou consécutif.",
  "termsUserAcknowledgment": "Vous reconnaissez que vous utilisez nos services à vos propres risques.",
  "termsChangesToTerms": "Nous pouvons mettre à jour ces conditions de temps à autre. Veuillez les réviser régulièrement.",
  "spineTailedKitTitle": "PQSRTC",
  "spineTailedKitDescription": "PQSRTC vise à fournir un protocole RTC rationalisé en Swift, avec chiffrement post-quantique activé par défaut. Il s’agit d’un SDK basé sur WebRTC qui se concentre sur des solutions modernes, sûres et haute performance pour les applications vocales et vidéo sur les plateformes Android et Apple, avec une logique partagée écrite en Swift.",
  "needleTailKitTitle": "NeedleTailKit",
  "needleTailKitDescription": "Qu'est-ce que NeedleTailKit ? NTK est le SDK principal pour les Applications Client et Serveur NeedleTail, permettant la création d'applications belles et chiffrées de bout en bout. Il peut être utilisé pour diverses applications au-delà de la messagerie. Intéressé ? Contactez-nous pour en savoir plus !",
  "needleTailIRCTitle": "NeedleTailIRC",
  "needleTailIRCDescription": "Une bibliothèque cliente IRC moderne pour les applications Swift. NeedleTailIRC fournit une interface robuste et sûre pour se connecter aux serveurs IRC, gérer les canaux et gérer la communication en temps réel. Construite avec Swift Concurrency pour des performances optimales.",
  "connectionManagerKitTitle": "ConnectionManagerKit",
  "connectionManagerKitDescription": "Un framework complet de gestion de connexions pour les applications Swift. ConnectionManagerKit simplifie la connectivité réseau, le regroupement de connexions et la gestion du cycle de vie des connexions. Parfait pour les applications nécessitant une communication réseau fiable.",
  "postQuantumSolaceTitle": "PostQuantumSolace",
  "postQuantumSolaceDescription": "Une bibliothèque de cryptographie post-quantique pour les applications Swift. PostQuantumSolace fournit des algorithmes et protocoles cryptographiques résistants à l'informatique quantique, garantissant que vos applications restent sécurisées à l'ère de l'informatique quantique.",
  "doubleRatchetKitTitle": "DoubleRatchetKit",
  "doubleRatchetKitDescription": "A Swift implementation of the Double Ratchet Algorithm with Post-Quantum X3DH (PQXDH) integration. Provides forward secrecy and post-compromise security for secure messaging—implements the Signal protocol specification with hybrid PQXDH (MLKEM1024 and Curve25519), header encryption, and out-of-order message support. Cross-platform: macOS 15+, iOS 18+, Android, and Linux.",
  "whiteTippedSocketsTitle": "White Tipped Sockets",
  "whiteTippedSocketsDescription": "WhiteTippedSockets est une bibliothèque WebSocket native pour iOS et macOS, construite sur l'API Network.framework utilisant Swift Concurrency. Notre objectif est de fournir une solution moderne et efficace pour la communication WebSocket, et nous prévoyons également de développer un serveur entièrement fonctionnel et évolutif à l'avenir.",
  "swiftHlsTitle": "Swift HLS",
  "swiftHlsDescription": "HTTP Live Streaming (HLS) est une technologie clé pour le streaming média efficace, et SwiftHLS est conçu pour faciliter cela. Utilisant le même protocole qui alimente le web, HLS permet la livraison de contenu via des APIs REST et des CDN. Son but est de fournir la fiabilité et s'adapte dynamiquement aux conditions réseau.",
  "swiftIapTitle": "Swift IAP",
  "swiftIapDescription": "SwiftIAP est une bibliothèque complète d'Achats In-App pour les applications iOS et macOS. Elle fournit une interface moderne et type-safe pour gérer les achats in-app, les abonnements et la validation des reçus. Construite avec Swift Concurrency et conçue pour la facilité d'utilisation.",
  "stompTitle": "Stomp",
  "stompDescription": "Stomp est une bibliothèque Swift pour la communication de protocole STOMP. Elle fournit une interface moderne et type-safe pour se connecter aux serveurs STOMP et gérer le routage des messages. Parfait pour les applications qui ont besoin d'une infrastructure de messagerie fiable.",
  "privacy": "Politique de Confidentialité",
  "termsConditions": "Conditions Générales",
  "projectTitle_1": "Projets",
  "projectHeader_1": "PQSRTC",
  "projectTitleText_1": "Solution RTC VoIP",
  "projectTitle_2": "Projets",
  "projectHeader_2": "NeedleTailKit",
  "projectTitleText_2": "Solution de Messagerie Chiffrée de Bout en Bout",
  "projectTitle_3": "Projets",
  "projectHeader_3": "White Tipped Sockets",
  "projectTitleText_3": "Wrapper Swift Concurrent Network.framework",
  "projectTitle_4": "Projets",
  "projectHeader_4": "Swift Stomp",
  "projectTitleText_4": "Protocole STOMP Swift Concurrent",
  "projectTitle_5": "Projets",
  "projectHeader_5": "Swift HLS",
  "projectTitleText_5": "Projet Swift HLS",
  "pageNotFound": "Page Non Trouvée",
  "pageNotFoundDescription": "La page que vous recherchez n'existe pas ou a été déplacée. Laissez-nous vous remettre sur la bonne voie.",
  "goHome": "Accueil",
  "goBack": "Retour",
  "contact": "Contact",
  "contactUs": "Contactez-Nous",
  "becomeASponsor": "Devenir un Sponsor",
  "supportOpenSourceMessage": "Soutenez nos projets open source et aidez-nous à continuer de construire des logiciels incroyables.",
  "getStartedOnDigitalOcean": "Commencez sur Digital Ocean avec un crédit de 100$, 60 jours pour les nouveaux utilisateurs.",
  "readyToGetStarted": "Prêt à Commencer ?",
  "letsDiscussProject": "Discutons de votre projet et voyons comment nous pouvons vous aider à donner vie à vos idées avec des solutions alimentées par Swift.",
  "backToTop": "Retour en Haut",
  "needleTailsCopyright": "NeedleTails©",
  "pointsForConsideration": "Points de Considération",
  "responsiveDesign": "Design responsive et adaptatif",
  "responsiveDesignDescription": "Mises en page et composants qui s’adaptent à tous les viewports et appareils.",
  "crossBrowserCompatibility": "Compatibilité navigateurs et standards",
  "crossBrowserCompatibilityDescription": "Tests et compatibilité sur les principaux navigateurs et standards.",
  "webPerformanceOptimizationDescription": "Budgets de performance, chargement différé et assets optimisés. Nous minimisons les temps de chargement et l’utilisation des ressources.",
  "userExperience": "Expérience utilisateur et accessibilité",
  "userExperienceDescription": "Architecture de l’information claire, navigation intuitive et accessibilité alignée WCAG.",
  "securityPractices": "Sécurité et protection des données",
  "securityPracticesDescription": "HTTPS, en-têtes sécurisés, validation des entrées et protection contre les risques OWASP (XSS, CSRF).",
  "seoBestPractices": "SEO et découvrabilité",
  "seoBestPracticesDescription": "Structure sémantique, balises meta et stratégie de contenu alignée avec les bonnes pratiques de recherche.",
  "backendSolutionsHeader": "Solutions côté serveur",
  "backendSolutionsDescription": "Nous concevons et livrons des backends de niveau production qui font tourner votre activité. Notre approche serveur-first garantit que les APIs, pipelines de données et intégrations sont conçus pour la fiabilité, la conformité et l’échelle.",
  "backendCapabilitiesOverview": "Notre pratique côté serveur s’appuie sur Swift (Vapor, Hummingbird, SwiftNIO) et des patterns cloud-native éprouvés. Nous livrons des backends sécurisés et performants—APIs REST et sur mesure, systèmes événementiels et intégration à votre stack existant.",
  "scalability": "Scalabilité et résilience",
  "scalabilityDescription": "Architectures conçues pour la croissance : scalabilité horizontale, services sans état et patterns résilients.",
  "security": "Sécurité et conformité",
  "securityDescription": "Sécurité robuste par défaut : chiffrement au repos et en transit, identité et contrôle d’accès, pistes d’audit et alignement avec les cadres de conformité courants.",
  "maintainability": "Maintenabilité et standards",
  "maintainabilityDescription": "Bases de code propres, modulaires et bien documentées avec des patterns cohérents et du contrôle de version.",
  "testingAndQualityAssurance": "Tests et assurance qualité",
  "testingAndQualityAssuranceDescription": "Stratégies de test rigoureuses : tests unitaires, d’intégration et de contrat avec automatisation CI/CD.",
  "monitoringAndLogging": "Monitoring et observabilité",
  "monitoringAndLoggingDescription": "Observabilité prête pour la production : logs structurés, métriques et alertes. Nous instrumentons les backends pour une visibilité claire sur la santé, les performances et les incidents.",
  "nativeAppDevelopmentHeader": "Développement d’applications natives",
  "nativeAppDevelopmentDescription": "Nous livrons des applications natives conçues pour la performance, la sécurité et une excellente expérience utilisateur—sur chaque plateforme requise par votre activité.",
  "nativeAppDevelopmentOverview": "Nous construisons des apps natives prêtes pour la production pour tout l’écosystème Apple (iOS, iPadOS, macOS, tvOS, watchOS, visionOS) et Android. Notre travail met l’accent sur Swift et Kotlin/Java typés, une UX adaptée à la plateforme, l’accessibilité et la sécurité dès la conception.",
  "designConsistency": "Systèmes de design et cohérence",
  "designConsistencyDescription": "Systèmes de design et bibliothèques de composants unifiés sur toutes les plateformes.",
  "deviceFragmentation": "Couverture appareils et plateformes",
  "deviceFragmentationDescription": "Tests structurés sur matrices d’appareils, tailles d’écran et versions d’OS.",
  "userExperienceUX": "Expérience utilisateur et accessibilité",
  "userExperienceUXDescription": "Parcours intuitifs, architecture de l’information claire et accessibilité alignée WCAG.",
  "distributionCompliance": "Distribution et conformité stores",
  "distributionComplianceDescription": "Préparation App Store et Play Store : lignes directrices, étiquettes de confidentialité et bonnes pratiques de revue.",
  "webDevelopmentExpertiseHeader": "Développement d’applications web",
  "webDevelopmentExpertiseDescription": "Nous construisons et maintenons des applications web qui soutiennent vos objectifs—des sites marketing et portails aux applications web full-stack intégrées à vos systèmes.",
  "webDevelopmentOverview": "Nous livrons des expériences web de niveau production : sites responsives, SPAs et applications full-stack construites avec Vue.js, Nuxt et TypeScript côté front, et Vapor, Hummingbird ou votre backend préféré.",
  "solutionsTitle": "Nos Solutions",
  "featuredApplications": "Applications en Vedette",
  "our": "Nos",
  "featuredApps": "Apps en Vedette",
  "featuredAppsDescription": "Découvrez nos applications innovantes qui montrent la puissance du développement Swift et de l'architecture logicielle moderne.",
  "nudgeTitle": "Messagerie sécurisée sous votre contrôle",
  "nudgeDescription": "Messagerie chiffrée de bout en bout avec auto-hébergement optionnel. Vos données restent les vôtres—pas de stockage tiers, pas de risque de persistance. Exécutez votre propre instance ou scalez globalement.",
  "islandHoppersTitle": "Island Hoppers : Votre App de Tours Ultime pour des Aventures Sans Problème !",
  "islandHoppersDescription": "Island Hoppers est l'app tout-en-un conçue pour améliorer votre expérience de voyage, que vous soyez une entreprise organisant des tours inoubliables ou un client cherchant l'évasion parfaite. Pour les entreprises, notre app rationalise tout le processus de gestion des tours. Organisez et personnalisez vos tours sans effort, communiquez directement avec les guides touristiques et gardez vos clients informés avec des mises à jour en temps réel. Avec Island Hoppers, vous pouvez gérer les réservations, suivre les préférences des clients et vous assurer que chaque détail est pris en charge, vous permettant de vous concentrer sur la livraison d'expériences exceptionnelles. Pour les clients, Island Hoppers offre une gamme diversifiée de forfaits de tours adaptés à divers types de groupes, y compris les familles, les routards et les passionnés de fêtes. Parcourez notre sélection d'aventures organisée, choisissez le forfait parfait qui correspond à votre style et connectez-vous avec des voyageurs partageant les mêmes idées. Profitez d'une communication fluide avec vos guides touristiques, accédez aux informations essentielles et recevez des recommandations personnalisées pour tirer le meilleur parti de votre voyage. Avec Island Hoppers, embarquez pour des aventures inoubliables avec facilité et confiance, sachant que chaque aspect de votre tour n'est qu'à un clic !",
  "streamStackTitle": "Une Plateforme Éducative pour vos Solutions Logicielles",
  "streamStackDescription": "Diffusez, Lisez, Discutez. Que vous soyez nouveau en programmation ou que vous vouliez lire sur différentes solutions logicielles, nous vous facilitons la tâche avec notre application Nuxt propulsée par Vapor. Restez à jour avec les dernières tendances de codage.",
  "welcomeToNeedleTails": "Bienvenue chez NeedleTails - Votre Allié en Développement Logiciel",
  "accept": "J'accepte et j'accepte",
  "cookieConsentTitle": "Nous utilisons le stockage du navigateur",
  "cookieConsentMessage": "Nous utilisons le stockage du navigateur pour mémoriser votre préférence de langue et améliorer votre expérience de navigation. En cliquant sur 'Accepter Tout', vous consentez à notre utilisation du stockage du navigateur.",
  "cookieConsentAcceptAll": "Accepter Tout",
  "cookieConsentAcceptNecessary": "Nécessaires Seulement",
  "cookieConsentReject": "Rejeter Tout",
  "cookieConsentLearnMore": "En Savoir Plus",
  "cookieConsentNecessary": "Le stockage nécessaire inclut la détection de langue pour fournir du contenu dans votre langue préférée.",
  "cookieConsentAnalytics": "Nous n'utilisons actuellement pas de suivi d'analyse sur ce site web.",
  "cookieConsentPreferences": "Le stockage des préférences mémorise vos paramètres comme le thème et les préférences utilisateur pour personnaliser votre expérience.",
  "cookieConsentMarketing": "Nous n'utilisons actuellement pas de suivi marketing ou de publicité sur ce site web.",
  "brewhubWidgetTitle": "BrewHub",
  "brewhubWidgetDescription": "Plateforme professionnelle de cours et d'instruction en développement logiciel. Accédez à une formation guidée en direct avec des outils et des flux de travail de niveau production pour améliorer vos compétences en développement.",
  "brewhubWidgetCTA": "Cours de Formation",
  "brewhubComingSoonTitle": "Disponible",
  "brewhubComingSoonDescription": "BrewHub est désormais disponible. Visitez brewhub.needletails.com pour des cours et formations professionnels en développement logiciel.",
  "brewhubFeature1Title": "Cours d'experts",
  "brewhubFeature1Description": "Accédez à des cours professionnels de développement logiciel dispensés par des experts du secteur.",
  "brewhubFeature2Title": "Formation en direct",
  "brewhubFeature2Description": "Formation en direct individuelle ou en petit groupe avec accompagnement d'experts.",
  "brewhubFeature3Title": "Communauté",
  "brewhubFeature3Description": "Rejoignez une communauté de développeurs et apprenez ensemble.",
  "brewhubFeature4Title": "Outils de production",
  "brewhubFeature4Description": "Apprenez avec les mêmes outils et flux de travail utilisés en production.",
  "brewhubBackToMainSite": "Aller sur BrewHub",
  "brewhubMetaTitle": "BrewHub | NeedleTails",
  "brewhubMetaDescription": "BrewHub est la plateforme de NeedleTails pour des cours et des formations professionnels en développement logiciel.",
  "brewhubOgDescription": "Cours et formations professionnels en développement logiciel.",
  "brewhubLogoAlt": "Logo BrewHub",
  "needletailKitTitle": "NeedleTailKit",
  "needletailKitSubtitle": "Un SDK Swift complet et prêt pour la production pour créer des applications de messagerie sécurisées avec chiffrement de bout en bout et des fonctionnalités de sécurité de niveau entreprise.",
  "needletailKitPrivateBadge": "SDK Privé - Licence Requise",
  "needletailKitRequestLicense": "Demander une Licence",
  "needletailKitExploreFeatures": "Explorer les Fonctionnalités",
  "needletailKitFeaturesTitle": "Fonctionnalités de Niveau Entreprise",
  "needletailKitFeaturesDescription": "Construit pour la production avec une sécurité de pointe et une architecture Swift moderne.",
  "needletailKitSecurityTitle": "Sécurité Entreprise",
  "needletailKitSecurityPQ": "Cryptographie Post-Quantique - À l'épreuve des attaques quantiques",
  "needletailKitSecurityDoubleRatchet": "Protocole Double Ratchet - Secret direct parfait",
  "needletailKitSecurityE2E": "Chiffrement de Bout en Bout - Tous les messages chiffrés par défaut",
  "needletailKitSecurityDeviceVerification": "Vérification des Appareils - Liaison cryptographique des appareils",
  "needletailKitPlatformTitle": "Support Multi-Plateforme",
  "needletailKitPlatformIOS": "iOS 18.0+ - Support iOS natif complet",
  "needletailKitPlatformMacOS": "macOS 15.0+ - Intégration macOS complète",
  "needletailKitPlatformSwift6": "Swift 6.0+ - Dernières fonctionnalités du langage",
  "needletailKitPlatformAsync": "Async/Await - Concurrence moderne partout",
  "needletailKitTransportTitle": "Transport Intelligent",
  "needletailKitTransportMulti": "Routage Multi-Transport - Sélection automatique du chemin",
  "needletailKitTransportP2P": "P2P Réseau Local - Communication directe entre appareils",
  "needletailKitTransportDCC": "Protocole DCC - P2P basé sur IRC avec TLS",
  "needletailKitTransportFailover": "Basculement Automatique - Changement de transport transparent",
  "needletailKitMessagingTitle": "Messagerie Riche",
  "needletailKitMessagingText": "Messages Texte - Communication simple et sécurisée",
  "needletailKitMessagingMedia": "Messages Média - Images, vidéos, documents",
  "needletailKitMessagingSelfDestruct": "Messages Auto-Destructifs - Support temporaire",
  "needletailKitMessagingEdit": "Édition de Messages - Modifier les messages envoyés",
  "needletailKitVoiceVideoTitle": "Appels Vocaux et Vidéo",
  "needletailKitVoiceVideoWebRTC": "Intégration WebRTC - Appels de haute qualité",
  "needletailKitVoiceVideoSTUN": "Support STUN/TURN - Traversée NAT",
  "needletailKitVoiceVideoCallManagement": "Gestion des Appels - Gestion complète du cycle de vie",
  "needletailKitEnterpriseTitle": "Prêt pour l'Entreprise",
  "needletailKitEnterpriseProduction": "Prêt pour la Production - Testé dans des applications réelles",
  "needletailKitEnterpriseSupport": "Support Entreprise - Support professionnel disponible",
  "needletailKitEnterpriseCompliance": "Conformité - Construit pour la conformité réglementaire",
  "needletailKitEnterpriseScalability": "Évolutivité - Conçu pour des déploiements à grande échelle",
  "needletailKitQuickStartTitle": "Quick Start",
  "needletailKitQuickStartDescription": "Get started with NeedleTailKit in minutes. Follow these simple steps to integrate secure messaging into your application.",
  "needletailKitInstallTitle": "Installation",
  "needletailKitInstallCode": "dependencies: [\n    .package(url: \"https://github.com/needletails/needle-tail-kit.git\", from: \"1.0.0\")\n]",
  "needletailKitInitializeTitle": "Initialize Session",
  "needletailKitInitializeCode": "import NeedleTailKit\n\nlet session = NeedleTailSession.shared\ntry await session.createNewUserAccount(\n    authInfo: authInfo,\n    store: store,\n    eventObserver: eventObserver\n)",
  "needletailKitSendMessageTitle": "Send Your First Message",
  "needletailKitSendMessageCode": "let contact = try await session.createContact(contact: \"bob\")\ntry await session.sendMessage(\n    messageType: .text,\n    recipient: .nickname(\"bob\"),\n    text: \"Hello, World!\"\n)",
  "needletailKitContactTitle": "Demander une Licence",
  "needletailKitContactDescription": "NeedleTailKit est un SDK propriétaire à code source fermé. Contactez-nous pour discuter des options de licence pour votre projet.",
  "needletailKitContactButton": "Contacter pour Licence",
  "needletailKitMetaTitle": "NeedleTailKit - SDK de Messagerie Sécurisée Entreprise | NeedleTails",
  "needletailKitMetaDescription": "SDK Swift prêt pour la production pour créer des applications de messagerie sécurisées avec chiffrement de bout en bout. Cryptographie post-quantique, support multi-plateforme et sécurité de niveau entreprise.",
  "needletailKitOgDescription": "SDK Swift prêt pour la production pour la messagerie sécurisée avec des fonctionnalités de sécurité de niveau entreprise.",
  "needletailKitLogoAlt": "Logo NeedleTailKit",
  "needletailKitPlatformAndroid": "Android : API 24 (Android 7.0) ou ultérieur",
  "nudgeWidgetTitle": "Sécurisé avec Nudge",
  "nudgeWidgetDescription": "Optionnellement autosurveillé, messagerie avec chiffrement de bout en bout avec contrôle complet des données.",
  "nudgeWidgetCTA": "En Savoir Plus",
  "nudgeWidgetLogoAlt": "Logo Nudge",
  "nudgeFeature1Title": "Chiffrement de bout en bout",
  "nudgeFeature1Description": "Chaque message chiffré par défaut. Confidentialité totale.",
  "nudgeFeature2Title": "Vos données, vos règles",
  "nudgeFeature2Description": "Auto-hébergement optionnel. Aucun stockage de données externe.",
  "nudgeFeature3Title": "Canaux sécurisés",
  "nudgeFeature3Description": "Messagerie privée conçue pour la sécurité.",
  "nudgeFeature4Title": "Global ou auto-hébergé",
  "nudgeFeature4Description": "Scalez globalement ou exécutez votre propre instance—aucun risque de persistance des données.",
  "nudgeContactButton": "Découvrir Nudge",
  "nudgeMetaTitle": "Nudge - Messagerie Sécurisée avec Chiffrement de Bout en Bout | NeedleTails",
  "nudgeMetaDescription": "Application de messagerie avec chiffrement de bout en bout et données optionnellement autosurveillées avec contrôle complet des données. Communication sécurisée sans risques de persistance des données.",
  "nudgeOgDescription": "Messagerie avec chiffrement de bout en bout et données optionnellement autosurveillées avec contrôle complet des données et sécurité de niveau entreprise.",
  "nudgeMetaKeywords": "Nudge, messagerie sécurisée, chiffrement de bout en bout, application de messagerie chiffrée, messagerie optionnellement autosurveillée, messagerie privée, communication sécurisée, confidentialité des données, sécurité de la messagerie, chat chiffré, application de chat sécurisée, messagerie axée sur la confidentialité",
  "brewhubMetaKeywords": "BrewHub, cours de développement logiciel, cours de programmation, formation de développeurs, éducation logicielle, cours de codage, tutoriels de développement, formation technique, plateforme d'apprentissage logiciel, tutoriels de programmation, cours de développement web, cours de développement mobile, formation en développement backend",
  "needletailKitMetaKeywords": "NeedleTailKit, SDK Swift, chiffrement de bout en bout, messagerie sécurisée, SDK iOS, SDK macOS, SDK Android, cryptographie post-quantique",
  "heroTagline": "Nous relevons vos défis—apps, sites web et solutions logicielles intégrées.",
  "managementPageLabel": "Management",
  "managementPageTitle": "Produit et livraison de projets",
  "managementPageLead": "Nous alignons vision, feuille de route et exécution pour que vos projets logiciels respectent le périmètre, les délais et la qualité.",
  "managementCtaLead": "Prêt à aligner votre prochain projet ?",
  "consultationPageLabel": "Consultation",
  "consultationCtaLead": "Parlez-nous de vos objectifs et nous vous proposerons un chemin clair.",
  "costSavingsBadge": "Économisez",
  "costSavingsHeadline": "Réduisez les coûts serveur",
  "costSavingsIntro": "En production, le choix du runtime influence directement ce que vous payez pour le calcul. Swift côté serveur (Vapor, Hummingbird, SwiftNIO) utilise généralement moins de mémoire et sert plus de requêtes par cœur que beaucoup de runtimes populaires. Vous pouvez donc servir le même trafic avec des instances plus petites ou moins nombreuses—et réduire la facture cloud sans sacrifier la fiabilité.",
  "costSavingsSubhead": "Même charge : une API typique servant environ 1–2 millions de requêtes par mois sur un petit serveur.",
  "costSavingsColRuntime": "Technologie",
  "costSavingsColMemory": "Utilisation mémoire",
  "costSavingsColThroughput": "Capacité de trafic",
  "costSavingsColMonthlyCost": "Coût serveur mensuel estimé",
  "costSavingsSwift": "Swift (Vapor / SwiftNIO)",
  "costSavingsSwiftMemory": "Très faible (30–80 Mo). Un petit serveur suffit souvent pour un trafic modéré.",
  "costSavingsSwiftThroughput": "Élevé. Un serveur peut gérer un trafic important ; moins de serveurs pour scaler.",
  "costSavingsSwiftCost": "12–24 €/mois (petites instances souvent suffisantes)",
  "costSavingsNode": "Node.js",
  "costSavingsNodeMemory": "Modéré (80–150 Mo par processus). Il faut souvent un palier de taille supérieur.",
  "costSavingsNodeThroughput": "Bon. Un serveur gère un trafic solide ; davantage de serveurs si le trafic augmente.",
  "costSavingsNodeCost": "24–48 €/mois",
  "costSavingsPython": "Python (ex. FastAPI)",
  "costSavingsPythonMemory": "Plus élevé (100–250 Mo par worker). Souvent plus de RAM pour plusieurs workers.",
  "costSavingsPythonThroughput": "Bon avec plusieurs workers. Souvent plus ou de plus gros serveurs pour le même trafic.",
  "costSavingsPythonCost": "24–48 €/mois (quelques workers)",
  "costSavingsJava": "Java (ex. Spring Boot)",
  "costSavingsJavaMemory": "Le plus élevé (200–500 Mo typique). Serveur plus gros souvent nécessaire dès le départ.",
  "costSavingsJavaThroughput": "Bon une fois en marche. Plus de mémoire de base = serveur plus gros pour le même trafic.",
  "costSavingsJavaCost": "48–96 €/mois (instance plus grande généralement requise)",
  "costSavingsDisclaimer": "Les chiffres réels dépendent de votre app, du trafic, de l’usage base de données et du fournisseur cloud. Ces chiffres sont indicatifs ; nous pouvons vous aider à estimer les coûts pour votre charge.",
  "costSavingsCta": "Collaborez avec nous pour des backends moins coûteux à faire tourner.",
  "costSavingsWhyItMatters": "Sur un an, un runtime plus efficace peut réduire la facture serveur de centaines ou milliers d’euros pour la même charge. Le tableau ci-dessous donne un ordre de grandeur réaliste pour une API JSON simple servant environ 1–2 millions de requêtes par mois sur une petite instance cloud.",
  "costSavingsTableHowToRead": "L’utilisation mémoire détermine la taille du serveur. La capacité de trafic est le nombre de requêtes qu’un serveur peut traiter. Moins de mémoire + plus de capacité = facture mensuelle plus basse pour le même trafic.",
  "costSavingsColMemoryHelp": "Détermine la taille minimale du serveur ; plus bas = serveur plus petit/économique",
  "costSavingsColThroughputHelp": "Trafic qu’un serveur peut traiter ; plus élevé = moins de serveurs nécessaires",
  "costSavingsProductionHeadline": "À quoi ressemblent les backends à l’échelle production",
  "costSavingsProductionIntro": "Différents produits nécessitent différents profils serveur. Le tableau ci-dessous présente des types de charge typiques à l’échelle—et pourquoi un runtime efficace (comme Swift côté serveur) peut réduire les coûts et simplifier les opérations.",
  "costSavingsProductionColWorkload": "Type de charge",
  "costSavingsProductionColNeeds": "Échelle et besoins typiques",
  "costSavingsProductionColWhy": "Pourquoi l’efficacité serveur compte",
  "costSavingsProductionEnterprise": "Sites d’entreprise et institutionnels",
  "costSavingsProductionEnterpriseNeeds": "Trafic modéré à élevé ; fiabilité, conformité et disponibilité. APIs, contenu et intégrations.",
  "costSavingsProductionEnterpriseWhy": "Coût par requête plus bas ; flotte plus petite pour la même capacité. Facturation prévisible quand le trafic augmente.",
  "costSavingsProductionMessaging": "Messagerie sécurisée et chat temps réel",
  "costSavingsProductionMessagingNeeds": "Livraison temps réel, chiffrement de bout en bout, forte concurrence. Beaucoup de connexions par serveur.",
  "costSavingsProductionMessagingWhy": "Peu de mémoire par connexion ; fort débit par cœur. Moins de serveurs pour des millions d’utilisateurs.",
  "costSavingsProductionVideo": "Visioconférence et médias temps réel",
  "costSavingsProductionVideoNeeds": "Signalisation, plans de contrôle et coordination. Les médias peuvent utiliser une infra dédiée ; les APIs doivent scaler.",
  "costSavingsProductionVideoWhy": "Couches de signalisation et API efficaces réduisent les coûts. Plus de capacité par serveur pour le trafic de contrôle.",
  "costSavingsProductionSocial": "Plateformes sociales et de contenu",
  "costSavingsProductionSocialNeeds": "Très fort volume de requêtes, flux, métadonnées médias, distribution globale. Le coût par requête s’accumule.",
  "costSavingsProductionSocialWhy": "Fort débit et faible mémoire réduisent le coût par million de requêtes. Flotte plus petite à l’échelle."
}
