{
  "introHeaderTwo": "לכם יש את החזון; אנחנו מספקים את הפתרון. בין אם אתם צריכים אפליקציית מובייל, אתר מודרני או מערכת תוכנה מלאה—אנחנו הופכים את האתגרים שלכם למוצרים אמינים ומאובטחים. עם ניסיון ארגוני במובייל, Web ושרת, אנחנו בונים ומשלבים פתרונות שצומחים—כדי שתוכלו להתמקד בעסק.",
  "menuItemOne": "קורסים",
  "menuItemTwo": "ייעוץ",
  "menuItemThree": "ניהול",
  "getInTouch": "צור קשר",
  "projectsHeader": "התוכנה שלנו",
  "projectsDescription": "אנו מחויבים לספק לכם מגוון רחב של תוכנה בקוד פתוח. כדי לתמוך במשימה זו, אנו מציעים גם תוכנה בקוד סגור. אנו מזמינים אתכם לחקור את הפרויקטים שלנו, הכוללים אפשרויות בקוד פתוח ובקוד סגור. אם אתם מעוניינים לתרום או לקבל רישיון לתוכנה בקוד הסגור שלנו, אנא אל תהססו ליצור איתנו קשר.",
  "projectsOverview": "הנה רשימה של מה שאנו עושים ומה שעשינו",
  "businessOverviewTitle": "מומחי תוכנה ב-Swift",
  "badgeMobile": "נייד",
  "badgeWeb": "אינטרנט",
  "badgeServer": "שרת",
  "businessOverviewDescription": "אנחנו הופכים את אתגרי התוכנה הקשים ביותר לפתרונות מוכנים לייצור. בין אם אתם צריכים אפליקציה חדשה, אתר מודרני או מערכות שמשתלבות בצורה חלקה—אנחנו מספקים במובייל, Web ושרת, בשפה הנכונה לפרויקט. המומחיות שלנו ב-Swift מביאה בטיחות טיפוסים, ביצועים ואמינות; אנחנו גם משתלבים עם המחסנית הקיימת שלכם. שותפו איתנו לפתרונות שנבנו להחזיק מעמד ולצמוח עם העסק.",
  "serviceHeaderBackendDevelopment": "Backend ו-API",
  "serviceDescriptionBackendDevelopment": "פתרו אתגרי סקלביליות ואינטגרציה עם פתרונות צד שרת robust. אנחנו בונים ומחברים API, מסדי נתונים ושירותים כדי שהאפליקציות והאתרים שלכם ירוצו באמינות בכל קנה מידה.",
  "serviceHeaderMobileAppDevelopment": "אפליקציות מובייל",
  "serviceDescriptionMobileAppDevelopment": "קבלו אפליקציה native שהמשתמשים אוהבים. אנחנו בונים אפליקציות iOS, Android ו-cross-platform שפותרות בעיות אמיתיות—בזמן ומוכנות לחנות.",
  "serviceHeaderTraining": "BrewHub",
  "serviceDescriptionTraining": "שדרגו את הצוות עם קורסי פיתוח תוכנה מקצועיים. הדרכה חיה מודרכת עם כלים ברמת production כדי שתוכלו לבנות ולתחזק פתרונות בפנים.",
  "serviceHeaderWebDevelopment": "פיתוח Web",
  "serviceDescriptionWebDevelopment": "אתרים ואפליקציות web שעובדים בכל מקום. אנחנו מספקים חוויות רספונסיביות, מהירות ומאובטחות שמושכות משתמשים ותומכות ביעדי העסק.",
  "openSourceHeader": "קוד פתוח",
  "openSourceDescription": "אנו מאמינים בכוח של קוד פתוח. חקרו את הפרויקטים שלנו ב-GitHub ותרמו לקהילה. התמיכה שלכם עוזרת לנו להמשיך לפתח פתרונות חדשניים.",
  "whyChooseSwift": "למה לבחור ב-Swift?",
  "typeSafety": "בטיחות סוגים",
  "typeSafetyDescription": "מערכת הסוגים של Swift מונעת שגיאות בזמן קומפילציה, מבטיחה שהאפליקציות שלכם חזקות ואמינות מהיום הראשון.",
  "performance": "ביצועים",
  "performanceDescription": "טביעת רגל נמוכה בזיכרון וביצועים גבוהים הופכים את Swift לאידיאלי לסביבות מוגבלות משאבים ואפליקציות תובעניות.",
  "threadSafety": "בטיחות Thread",
  "threadSafetyDescription": "תמיכה מובנית במקבילות מבטיחה שהאפליקציות שלכם מטפלות במשימות מרובות ביעילות ללא תנאי מרוץ.",
  "ourServices": "איך אנחנו פותרים את האתגרים שלכם",
  "servicesDescription": "מהרעיון להשקה ומעבר—אנחנו מספקים את האפליקציות, האתרים והאינטגרציות שאתם צריכים. תספרו לנו את האתגר—אנחנו מתכננים, בונים ותומכים בפתרון.",
  "startYourProject": "התחל את הפרויקט שלך",
  "swiftNative": "Native",
  "support": "תמיכה",
  "possibilities": "אפשרויות",
  "makingYour": "הפיכת",
  "ideasReality": "רעיונות למציאות",
  "swiftSoftwareSpecialists": "מומחי תוכנה ב-Swift",
  "swift": "Swift",
  "swiftServer": "Swift-Server",
  "frequentlyAskedQuestions": "שאלות נפוצות",
  "faqDescription": "קבלו תשובות לשאלות נפוצות על שירותי פיתוח התוכנה שלנו",
  "faqTechnologies": "באילו טכנולוגיות אתם מתמחים?",
  "faqTechnologiesAnswer": "אנו מתמחים בפיתוח web מודרני באמצעות מגוון רחב של טכנולוגיות כולל, אך לא מוגבל ל-Nuxt, Vue, Vapor ו-SwiftNIO. מומחיות השפה שלנו כוללת TypeScript ו-Swift. אנו עובדים גם עם פתרונות backend חזקים, שירותי ענן, API וארכיטקטורה מדרגית כדי לספק אפליקציות בעלות ביצועים גבוהים.",
  "faqTimeline": "כמה זמן לוקח פרויקט טיפוסי?",
  "faqTimelineAnswer": "זמני פרויקט משתנים בהתאם למורכבות. אפליקציות web פשוטות לוקחות 4-8 שבועות, בעוד שפתרונות ארגוניים מורכבים יכולים לקחת 3-6 חודשים. אנו מספקים לוחות זמנים מפורטים במהלך הייעוץ.",
  "faqSupport": "האם אתם מספקים תמיכה ותחזוקה מתמשכים?",
  "faqSupportAnswer": "כן, אנו מציעים חבילות תמיכה מקיפות כולל ניטור 24/7, עדכונים קבועים, תיקוני אבטחה ושיפורי תכונות כדי להבטיח שהאפליקציה שלכם נשארת עדכנית ובטוחה.",
  "faqProcess": "מהו תהליך הפיתוח שלכם?",
  "faqProcessAnswer": "אנו עוקבים אחר גישה שיתופית עם תקשורת לקוח קבועה, פיתוח איטרטיבי ובדיקה מתמשכת. התהליך שלנו כולל שלבי תכנון, עיצוב, פיתוח, בדיקה ופריסה.",
  "faqIntegration": "האם אתם יכולים לעבוד עם מערכות ו-API קיימים?",
  "faqIntegrationAnswer": "בהחלט! יש לנו ניסיון נרחב בשילוב עם מערכות קיימות, API ומסדי נתונים. אנו יכולים לשפר, למודרניזציה או לבנות מחדש לחלוטין את התשתית הנוכחית שלכם.",
  "faqSecurity": "מה לגבי אבטחה והגנה על נתונים?",
  "faqSecurityAnswer": "אבטחה היא ברירת המחדל בכל מה שאנו בונים. אנו מיישמים שיטות פיתוח תוכנה מונעות אבטחה, אמצעי אבטחה בסטנדרט תעשייתי, הצפנת נתונים ובדיקות אבטחה קבועות כדי להגן על הנתונים שלכם ועל המידע של המשתמשים שלכם.",
  "consultingTitle": "Your Challenges, Our Expertise",
  "consultingOverview": "Whether you're defining a new product, modernizing legacy systems, or choosing stack and architecture—we provide structured guidance so your decisions are informed by experience and aligned with your business goals.",
  "consultWithUs": "Discuss Your Initiative",
  "consultingWithUsMessage": "Share your goals, constraints, and timeline. We'll outline options, trade-offs, and a clear path forward—including scope, technology, and what it takes to get there.",
  "whatToConsultAbout": "What We Can Help With",
  "architectureDesign": "Architecture & System Design",
  "architectureDesignDescription": "Scalable, maintainable architectures for new and existing systems. We help you choose patterns, boundaries, and integration approaches so your solution is fit for production and future growth.",
  "technologySelection": "Technology & Stack Selection",
  "technologySelectionDescription": "Objective evaluation of technologies and vendors against your requirements, team skills, and long-term maintainability. We help you select a stack that balances delivery speed, cost, and risk.",
  "performanceOptimization": "Performance & Scalability",
  "performanceOptimizationDescription": "Response times, throughput, and resource usage. We apply caching, load balancing, query optimization, and capacity planning so your systems perform under load and stay cost-effective.",
  "securityReview": "Security & Compliance Review",
  "securityReviewDescription": "Security posture and compliance alignment. We assess design and implementation against common threats and frameworks so your applications and data meet business and regulatory expectations.",
  "codeReview": "Code & Implementation Review",
  "codeReviewDescription": "Expert review of code quality, patterns, and technical debt. We provide actionable feedback so your codebase stays maintainable, testable, and aligned with best practices.",
  "bestPractices": "Process & Best Practices",
  "bestPracticesDescription": "Development process, DevOps, and delivery practices. We help you adopt workflows that improve predictability, quality, and team efficiency.",
  "trainingProgramsHeader": "תכניות הכשרה",
  "trainingProgramsDescription": "פתרונות פיתוח מקצועי והכשרה",
  "trainingOverview": "תכניות הכשרה מקיפות לשיפור המיומנויות של הצוות שלכם",
  "trainingCourses": "קורסי הכשרה",
  "vueJsDevelopment": "פיתוח Vue.js",
  "vueJsDevelopmentDescription": "למדו שיטות פיתוח Vue.js מודרניות עם Nuxt",
  "swiftBackendDevelopment": "פיתוח Backend ב-Swift",
  "swiftBackendDevelopmentDescription": "שלטו בפיתוח backend ב-Swift עם Vapor ו-SwiftNIO",
  "typescriptDevelopment": "פיתוח TypeScript",
  "typescriptDevelopmentDescription": "בנו אפליקציות חזקות עם TypeScript",
  "securityFirstDevelopment": "פיתוח מונע אבטחה",
  "securityFirstDevelopmentDescription": "יישמו שיטות פיתוח תוכנה מונעות אבטחה",
  "productManagementExpertiseHeader": "Product Management",
  "productManagementExpertiseDescription": "Structured product management to align vision, roadmap, and delivery with business outcomes.",
  "productManagementOverview": "We support product-led organizations with discovery, prioritization, and lifecycle practices. From requirements and market insight through UX and roadmap planning, we help you ship the right features at the right time and keep stakeholders aligned.",
  "productManagementPoints": "Key Disciplines",
  "requirementsGathering": "Requirements & Discovery",
  "requirementsGatheringDescription": "Structured elicitation and documentation of functional and non-functional requirements. We capture clear, actionable specs so development and stakeholders share a single source of truth.",
  "marketResearch": "Market & User Research",
  "marketResearchDescription": "Evidence-based understanding of users, competitors, and market fit. We support product decisions with research so roadmaps are grounded in real demand and usage.",
  "userExperienceDesign": "User Experience Design",
  "userExperienceDesignDescription": "User-centered flows, information architecture, and interaction design. We align UX with business goals and accessibility so products are usable and compliant.",
  "productStrategy": "Product Strategy",
  "productStrategyDescription": "Vision, positioning, and roadmap aligned with business objectives. We help define and communicate strategy so teams and stakeholders move in the same direction.",
  "featurePrioritization": "Feature Prioritization",
  "featurePrioritizationDescription": "Framework-driven prioritization (value, effort, risk). We help you decide what to build next so capacity is focused on the highest-impact work.",
  "stakeholderManagement": "Stakeholder Management",
  "stakeholderManagementDescription": "Clear communication, expectations, and alignment with internal and external stakeholders. We keep everyone informed and bought in so delivery stays on track.",
  "projectManagementExpertiseHeader": "Project Management",
  "projectManagementExpertiseDescription": "Delivery discipline so your software projects stay on scope, schedule, and quality.",
  "projectManagementOverview": "We apply proven project management practices—planning, tracking, risk and resource management—tailored to your team size and methodology. We keep projects visible and predictable so you can deliver on commitments and adapt when priorities change.",
  "projectManagementPoints": "Key Disciplines",
  "projectPlanning": "Project Planning",
  "projectPlanningDescription": "Scoped plans, milestones, and dependencies. We define clear deliverables and timelines so execution is predictable and aligned with business goals.",
  "resourceManagement": "Resource Management",
  "resourceManagementDescription": "Capacity planning and allocation across teams and sprints. We help balance workload and skills so delivery stays sustainable and on track.",
  "riskManagement": "Risk Management",
  "riskManagementDescription": "Identification, assessment, and mitigation of technical and project risks. We surface and address risks early so issues don’t derail delivery.",
  "qualityAssurance": "Quality Assurance",
  "qualityAssuranceDescription": "Quality gates, acceptance criteria, and release readiness. We ensure standards are met so releases are reliable and supportable.",
  "overview": "סקירה כללית",
  "privacyPolicyTitle": "מדיניות פרטיות",
  "effectiveDate": "תאריך יעיל",
  "effectiveDateValue": "10/05/2024",
  "introduction": "מבוא",
  "informationWeDoNotCollect": "מידע שאנו לא אוספים",
  "informationCollectedByServers": "מידע שנאסף על ידי שרתים וטכנולוגיות",
  "legalUse": "שימוש חוקי",
  "limitationOfLiability": "הגבלת אחריות",
  "changesToPolicy": "שינויים במדיניות פרטיות זו",
  "privacyWelcomeMessage": "ברוכים הבאים ל-NeedleTails.com. הפרטיות שלכם חשובה לנו.",
  "privacyPurpose": "מדיניות פרטיות זו מתארת את הפרקטיקות שלנו לגבי איסוף מידע כאשר אתם מבקרים באתר שלנו.",
  "personalInformation": "אנו לא אוספים שום מידע אישי מהמשתמשים שלנו.",
  "informationOverview": "בעוד שאנו לא אוספים מידע אישי, אנא היו מודעים לכך ששרתים וטכנולוגיות אחרות עשויות לאסוף מידע מסוים באופן אוטומטי.",
  "legalUseOverview": "על ידי שימוש באתר שלנו, אתם מסכימים לציית לכל החוקים והתקנות המקומיים החלים.",
  "userResponsibility": "זוהי האחריות שלכם לוודא שהשימוש שלכם באתר חוקי בתחום השיפוט שלכם.",
  "privacyLimitationOverview": "מחבר אתר זה לא יהיה אחראי לכל נזק או הפסד הנובע מהשימוש שלכם באתר.",
  "privacyUserAcknowledgment": "על ידי שימוש באתר, אתם מכירים בכך שאתם עושים זאת על אחריותכם ומחבר האתר אינו אחראי לכל תוצאה הנובעת מהשימוש שלכם.",
  "privacyChangesToPolicy": "אנו עשויים לעדכן את מדיניות הפרטיות שלנו מעת לעת. אנו נודיע לכם על כל שינוי על ידי פרסום מדיניות הפרטיות החדשה בעמוד זה. מומלץ לכם לבדוק מדיניות פרטיות זו מעת לעת לכל שינוי.",
  "cookies": "עוגיות",
  "cookiesDescription": "עוגיות עשויות לשמש לשיפור חווית המשתמש. אלה עשויות לכלול:",
  "sessionCookies": "עוגיות סשן: עוגיות זמניות שפגות כאשר אתם סוגרים את הדפדפן שלכם.",
  "persistentCookies": "עוגיות מתמשכות: עוגיות שנשארות במכשיר שלכם לתקופה מוגדרת או עד למחיקה.",
  "analytics": "אנליטיקה",
  "analyticsDescription": "אנו עשויים להשתמש בשירותי אנליטיקה של צד שלישי שאוספים מידע על שימוש באתר, כגון:",
  "pageViews": "צפיות בדף",
  "userInteractions": "אינטראקציות משתמש",
  "trafficSources": "מקורות תעבורה",
  "serverLogs": "יומני שרת",
  "serverLogsDescription": "שרתי web עשויים לרשום מידע על הביקור שלכם, כולל:",
  "ipAddress": "כתובת IP",
  "browserType": "סוג דפדפן",
  "operatingSystem": "מערכת הפעלה",
  "referringUrl": "URL הפניה",
  "pagesVisited": "דפים שבוקרו",
  "timeAndDateOfAccess": "זמן ותאריך גישה",
  "termsTitle": "תנאים ותנאים",
  "termsEffectiveDate": "תאריך יעיל: 10/05/2024",
  "userAgreement": "הסכם משתמש",
  "prohibitedActivities": "פעילויות אסורות",
  "changesToTerms": "שינויים בתנאים אלה",
  "termsWelcomeMessage": "ברוכים הבאים לתנאים והתנאים שלנו.",
  "termsPurpose": "תנאים אלה מגדירים את השימוש שלכם בשירותים שלנו.",
  "userAgreementText": "על ידי שימוש בשירותים שלנו, אתם מסכימים לתנאים אלה.",
  "prohibitedActivitiesOverview": "הפעילויות הבאות אסורות:",
  "usingServiceForIllegalPurposes": "שימוש בשירות למטרות בלתי חוקיות.",
  "engagingInHarassment": "עיסוק בכל צורה של הטרדה או התעללות.",
  "unauthorizedAccess": "ניסיון להשיג גישה בלתי מורשית למערכות שלנו.",
  "distributingMalware": "הפצת תוכנה זדונית או וירוסים.",
  "termsLimitationOverview": "אנו לא אחראים לכל נזק עקיף, מקרי או תוצאתי.",
  "termsUserAcknowledgment": "אתם מכירים בכך שאתם משתמשים בשירותים שלנו על אחריותכם.",
  "termsChangesToTerms": "אנו עשויים לעדכן תנאים אלה מעת לעת. אנא בדקו אותם באופן קבוע.",
  "spineTailedKitTitle": "PQSRTC",
  "spineTailedKitDescription": "PQSRTC שואף לספק פרוטוקול RTC ממוקד ויעיל ב‑Swift, עם הצפנה פוסט‑קוונטית כברירת מחדל. זהו SDK המבוסס על WebRTC, המתמקד במתן פתרון מודרני, מאובטח ובעל ביצועים גבוהים לאפליקציות קול ווידאו על גבי פלטפורמות Android ו‑Apple, עם לוגיקה משותפת הכתובה ב‑Swift.",
  "needleTailKitTitle": "NeedleTailKit",
  "needleTailIRCTitle": "NeedleTailIRC",
  "needleTailIRCDescription": "ספריית לקוח IRC מודרנית עבור אפליקציות Swift. NeedleTailIRC מספקת ממשק חזק ובטוח-טיפוס לחיבור לשרתי IRC, ניהול ערוצים וניהול תקשורת בזמן אמת. נבנתה עם Swift Concurrency לביצועים מיטביים.",
  "connectionManagerKitTitle": "ConnectionManagerKit",
  "connectionManagerKitDescription": "מסגרת ניהול חיבורים מקיפה עבור אפליקציות Swift. ConnectionManagerKit מפשטת חיבוריות רשת, איגום חיבורים וניהול מחזור החיים של חיבורים. מושלמת עבור אפליקציות הדורשות תקשורת רשת אמינה.",
  "postQuantumSolaceTitle": "PostQuantumSolace",
  "postQuantumSolaceDescription": "ספריית קריפטוגרפיה פוסט-קוונטית עבור אפליקציות Swift. PostQuantumSolace מספקת אלגוריתמים ופרוטוקולים קריפטוגרפיים עמידים למחשוב קוונטי, ומבטיחה שאפליקציות שלך יישארו בטוחות בעידן המחשוב הקוונטי.",
  "needleTailKitDescription": "מה זה NeedleTailKit? NTK הוא ה-SDK המרכזי עבור אפליקציות NeedleTail Client ו-Server, המאפשר יצירת אפליקציות מוצפנות מקצה לקצה יפות. זה יכול לשמש למגוון אפליקציות מעבר למסרים. מעוניינים? צרו איתנו קשר כדי ללמוד יותר!",
  "whiteTippedSocketsTitle": "White Tipped Sockets",
  "whiteTippedSocketsDescription": "WhiteTippedSockets היא ספריית WebSocket מקורית עבור iOS ו-macOS, בנויה על API של Network.framework באמצעות Swift Concurrency. המטרה שלנו היא לספק פתרון מודרני ויעיל לתקשורת WebSocket, ואנו גם מתכננים לפתח שרת פונקציונלי ומדרגי במלואו בעתיד.",
  "swiftHlsTitle": "Swift HLS",
  "swiftHlsDescription": "HTTP Live Streaming (HLS) היא טכנולוגיה מפתח לזרמת מדיה יעילה, ו-SwiftHLS נועדה להקל על כך. שימוש באותו פרוטוקול שמפעיל את ה-web, HLS מאפשר אספקת תוכן באמצעות REST API ו-CDN. מטרתה היא לספק אמינות ולהתאים את עצמה באופן דינמי לתנאי הרשת.",
  "swiftIapTitle": "Swift IAP",
  "swiftIapDescription": "SwiftIAP היא ספריית רכישות בתוך אפליקציה מקיפה עבור אפליקציות iOS ו-macOS. היא מספקת ממשק מודרני ובטוח לסוגים לטיפול ברכישות בתוך אפליקציה, מנויים ואימות קבלות. בנויה עם Swift Concurrency ומעוצבת לקלות שימוש.",
  "stompTitle": "Stomp",
  "stompDescription": "Stomp היא ספריית Swift לתקשורת פרוטוקול STOMP. היא מספקת ממשק מודרני ובטוח לסוגים לחיבור לשרתי STOMP וטיפול בניתוב הודעות. מושלם עבור אפליקציות שצריכות תשתית מסרים אמינה.",
  "privacy": "מדיניות פרטיות",
  "termsConditions": "תנאים ותנאים",
  "projectTitle_1": "פרויקטים",
  "projectHeader_1": "PQSRTC",
  "projectTitleText_1": "פתרון RTC VoIP",
  "projectTitle_2": "פרויקטים",
  "projectHeader_2": "NeedleTailKit",
  "projectTitleText_2": "פתרון מסרים מוצפן מקצה לקצה",
  "projectTitle_3": "פרויקטים",
  "projectHeader_3": "White Tipped Sockets",
  "projectTitleText_3": "עטיפת Swift Concurrent Network.framework",
  "projectTitle_4": "פרויקטים",
  "projectHeader_4": "Swift Stomp",
  "projectTitleText_4": "פרוטוקול Swift Concurrent STOMP",
  "projectTitle_5": "פרויקטים",
  "projectHeader_5": "Swift HLS",
  "projectTitleText_5": "פרויקט Swift HLS",
  "pageNotFound": "הדף לא נמצא",
  "pageNotFoundDescription": "הדף שאתם מחפשים לא קיים או הועבר. בואו נחזיר אתכם למסלול.",
  "goHome": "לך הביתה",
  "goBack": "חזור",
  "contact": "צור קשר",
  "contactUs": "צור איתנו קשר",
  "becomeASponsor": "הפוך לספונסר",
  "supportOpenSourceMessage": "תמכו בפרויקטי הקוד הפתוח שלנו ועזרו לנו להמשיך לבנות תוכנה מדהימה.",
  "getStartedOnDigitalOcean": "התחל ב-Digital Ocean עם קרדיט של 100$ ל-60 ימים למשתמשים חדשים.",
  "readyToGetStarted": "מוכן להתחיל?",
  "letsDiscussProject": "בואו נדון בפרויקט שלכם ונראה איך אנו יכולים לעזור להפוך את הרעיונות שלכם למציאות עם פתרונות מונעי Swift.",
  "backToTop": "חזור למעלה",
  "needleTailsCopyright": "NeedleTails©",
  "pointsForConsideration": "נקודות לשיקול",
  "responsiveDesign": "Responsive & Adaptive Design",
  "responsiveDesignDescription": "Layouts and components that adapt to all viewports and devices. We deliver consistent, high-quality experiences on desktop, tablet, and mobile so your web product works everywhere your users are.",
  "crossBrowserCompatibility": "Cross-Browser & Standards Compliance",
  "crossBrowserCompatibilityDescription": "Testing and compatibility across major browsers and standards. We ensure consistent behavior and appearance so your application works reliably for every user, regardless of browser or device.",
  "webPerformanceOptimizationDescription": "Performance budgets, lazy loading, and optimized assets. We minimize load times and resource usage through efficient code, caching, and CDN strategies so your site feels fast and remains cost-effective at scale.",
  "userExperience": "User Experience & Accessibility",
  "userExperienceDescription": "Clear information architecture, intuitive navigation, and WCAG-aligned accessibility. We design and implement UX that drives engagement and meets enterprise usability and compliance expectations.",
  "securityPractices": "Security & Data Protection",
  "securityPracticesDescription": "HTTPS, secure headers, input validation, and protection against OWASP-top risks including XSS and CSRF. We harden web applications so your data and your users stay secure in production.",
  "seoBestPractices": "SEO & Discoverability",
  "seoBestPracticesDescription": "Semantic structure, meta tags, and content strategy aligned with search best practices. We optimize for discoverability and ranking so your web presence supports your business and marketing goals.",
  "backendSolutionsHeader": "Server-Side Solutions",
  "backendSolutionsDescription": "We design and deliver production-grade backends that power your business. Our server-first approach ensures APIs, data pipelines, and integrations are built for reliability, compliance, and scale—so your applications perform under real-world load and security requirements.",
  "backendCapabilitiesOverview": "Our server-side practice is built on Swift (Vapor, Hummingbird, SwiftNIO) and proven cloud-native patterns. We deliver secure, high-performance backends—REST and custom APIs, event-driven systems, and seamless integration with your existing stack. From architecture through deployment and observability, we own the full lifecycle so your teams can focus on product, not infrastructure.",
  "scalability": "Scalability & Resilience",
  "scalabilityDescription": "Architectures designed for growth: horizontal scaling, stateless services, and resilient patterns. We apply microservices, serverless, and queue-based designs so your backend handles traffic spikes and data growth without rework.",
  "security": "Security & Compliance",
  "securityDescription": "Robust security by default: encryption at rest and in transit, identity and access control, audit trails, and alignment with common compliance frameworks. We harden backends so your data and your users stay protected.",
  "maintainability": "Maintainability & Standards",
  "maintainabilityDescription": "Clean, modular, and well-documented codebases with consistent patterns and version control. We adopt and document coding standards so your team can maintain and extend the system with confidence.",
  "testingAndQualityAssurance": "Testing & Quality Assurance",
  "testingAndQualityAssuranceDescription": "Rigorous testing strategies: unit, integration, and contract tests with CI/CD automation. We maintain high quality and regression safety so releases are predictable and low-risk.",
  "monitoringAndLogging": "Monitoring & Observability",
  "monitoringAndLoggingDescription": "Production-ready observability: structured logging, metrics, and alerting. We instrument backends so you have clear visibility into health, performance, and incidents—and can respond before users are affected.",
  "nativeAppDevelopmentHeader": "Native Application Development",
  "nativeAppDevelopmentDescription": "We deliver native applications built for performance, security, and great user experience—on every platform your business requires.",
  "nativeAppDevelopmentOverview": "We build production-ready native apps for the full Apple ecosystem (iOS, iPadOS, macOS, tvOS, watchOS, visionOS) and Android. Our work emphasizes type-safe Swift and Kotlin/Java, platform-appropriate UX, accessibility, and security-by-design. From MVPs to large-scale deployments, we handle architecture, store readiness, and ongoing support so your apps stay performant, compliant, and maintainable.",
  "designConsistency": "Design Systems & Consistency",
  "designConsistencyDescription": "Unified design systems and component libraries across platforms. We ensure consistent branding, interaction patterns, and accessibility so your product feels cohesive on every device.",
  "deviceFragmentation": "Device & Platform Coverage",
  "deviceFragmentationDescription": "Structured testing across device matrices, screen sizes, and OS versions. We validate behavior and performance so your app works reliably for all target users, including edge cases.",
  "userExperienceUX": "User Experience & Accessibility",
  "userExperienceUXDescription": "Intuitive flows, clear information architecture, and WCAG-aligned accessibility. We design and implement UX that serves all users and supports usability and compliance goals.",
  "distributionCompliance": "Distribution & Store Compliance",
  "distributionComplianceDescription": "App Store and Play Store readiness: guidelines, privacy labels, and review best practices. We prepare and maintain your apps for public and private distribution channels.",
  "webDevelopmentExpertiseHeader": "Web Application Development",
  "webDevelopmentExpertiseDescription": "We build and maintain web applications that support your business goals—from marketing sites and portals to full-stack web apps that integrate with your existing systems.",
  "webDevelopmentOverview": "We deliver production-grade web experiences: responsive sites, SPAs, and full-stack applications built with Vue.js, Nuxt, and TypeScript on the front end, and Vapor, Hummingbird, or your preferred backend. Our work covers corporate sites, customer portals, internal tools, and public-facing apps—with a focus on performance, security, SEO, and maintainability so your web presence scales with your organization.",
  "solutionsTitle": "הפתרונות שלנו",
  "featuredApplications": "אפליקציות מובילות",
  "our": "שלנו",
  "featuredApps": "אפליקציות מובילות",
  "featuredAppsDescription": "גלו את האפליקציות החדשניות שלנו שמציגות את כוח הפיתוח של Swift וארכיטקטורת התוכנה המודרנית.",
  "nudgeTitle": "Secure Messaging You Control",
  "nudgeDescription": "End-to-end encrypted messaging with optional self-hosting. Your data stays yours—no third-party storage, no persistence risk. Run your own instance or scale globally.",
  "islandHoppersTitle": "Island Hoppers: אפליקציית הסיורים האולטימטיבית שלכם להרפתקאות חלקות!",
  "islandHoppersDescription": "Island Hoppers היא האפליקציה הכל-באחת שנועדה לשפר את חוויית הנסיעה שלכם, בין אם אתם חברה המארגנת סיורים בלתי נשכחים או לקוח המחפש את הבריחה המושלמת. עבור חברות, האפליקציה שלנו מפשטת את כל תהליך ניהול הסיורים. ארגנו והתאימו את הסיורים שלכם ללא מאמץ, תקשרו ישירות עם מדריכי סיורים ושמרו על הלקוחות שלכם מעודכנים עם עדכונים בזמן אמת. עם Island Hoppers, אתם יכולים לנהל הזמנות, לעקוב אחר העדפות לקוחות ולהבטיח שכל פרט מטופל, המאפשר לכם להתמקד במסירת חוויות יוצאות דופן. עבור לקוחות, Island Hoppers מציעה מגוון רחב של חבילות סיורים המותאמות לסוגים שונים של קבוצות, כולל משפחות, תרמילאים וחובבי מסיבות. עברו על הבחירה המאורגנת שלנו של הרפתקאות, בחרו את החבילה המושלמת שמתאימה לסגנון שלכם והתחברו עם נוסעים בעלי דעות דומות. נהנו מתקשורת חלקה עם מדריכי הסיורים שלכם, גשו למידע חיוני וקבלו המלצות מותאמות אישית כדי להפיק את המרב מהמסע שלכם. עם Island Hoppers, צאו להרפתקאות בלתי נשכחות בקלות וביטחון, בידיעה שכל היבט של הסיור שלכם נמצא במרחק נגיעה!",
  "streamStackTitle": "פלטפורמה חינוכית לפתרונות התוכנה שלכם",
  "streamStackDescription": "הזרמה, קריאה, דיון. בין אם אתם חדשים בתכנות או רוצים לקרוא על פתרונות תוכנה שונים, אנו מקלים עליכם לעשות זאת עם אפליקציית Nuxt הנתמכת על ידי Vapor. הישארו מעודכנים עם מגמות הקידוד האחרונות.",
  "welcomeToNeedleTails": "ברוכים הבאים ל-NeedleTails - בעל ברית פיתוח התוכנה שלכם",
  "accept": "אני מסכים ומקבל",
  "cookieConsentTitle": "אנו משתמשים באחסון דפדפן",
  "cookieConsentMessage": "אנו משתמשים באחסון דפדפן כדי לזכור את העדפת השפה שלך ולשפר את חווית הגלישה שלך. בלחיצה על 'קבל הכל', אתה מסכים לשימוש שלנו באחסון דפדפן.",
  "cookieConsentAcceptAll": "קבל הכל",
  "cookieConsentAcceptNecessary": "רק הכרחיות",
  "cookieConsentReject": "דחה הכל",
  "cookieConsentLearnMore": "למידע נוסף",
  "cookieConsentNecessary": "אחסון הכרחי כולל זיהוי שפה כדי לספק תוכן בשפה המועדפת שלך.",
  "cookieConsentAnalytics": "אנו כרגע לא משתמשים במעקב אנליטיקה באתר זה.",
  "cookieConsentPreferences": "אחסון העדפות זוכר את ההגדרות שלך כמו ערכת נושא והעדפות משתמש כדי להתאים אישית את החוויה שלך.",
  "cookieConsentMarketing": "אנו כרגע לא משתמשים במעקב שיווק או פרסום באתר זה.",
  "brewhubWidgetTitle": "BrewHub",
  "brewhubWidgetDescription": "פלטפורמה מקצועית לקורסים והדרכה בפיתוח תוכנה. גישה להדרכה מודרכת בשידור חי עם כלים וזרימות עבודה ברמת ייצור לשיפור כישורי הפיתוח שלכם.",
  "brewhubWidgetCTA": "קורסי הכשרה",
  "brewhubComingSoonTitle": "זמין",
  "brewhubComingSoonDescription": "BrewHub זמין עכשיו. בקרו ב-brewhub.needletails.com לקורסים והכשרה מקצועיים בפיתוח תוכנה.",
  "brewhubFeature1Title": "קורסים עם מומחים",
  "brewhubFeature1Description": "גישה לקורסים מקצועיים בפיתוח תוכנה המועברים על ידי מומחים מהתעשייה.",
  "brewhubFeature2Title": "הדרכה חיה",
  "brewhubFeature2Description": "הדרכה חיה אחד על אחד או בקבוצות קטנות עם ליווי ישיר של מומחים.",
  "brewhubFeature3Title": "קהילה",
  "brewhubFeature3Description": "הצטרפו לקהילת מפתחים ולמדו יחד.",
  "brewhubFeature4Title": "כלי ייצור",
  "brewhubFeature4Description": "למדו עם אותם כלים ותהליכי עבודה המשמשים בסביבות ייצור.",
  "brewhubBackToMainSite": "לעבור ל-BrewHub",
  "brewhubMetaTitle": "BrewHub | NeedleTails",
  "brewhubMetaDescription": "BrewHub היא הפלטפורמה של NeedleTails לקורסים והכשרה מקצועיים בפיתוח תוכנה.",
  "brewhubOgDescription": "קורסים והכשרה מקצועיים בפיתוח תוכנה.",
  "brewhubLogoAlt": "לוגו BrewHub",
  "needletailKitTitle": "NeedleTailKit",
  "needletailKitSubtitle": "SDK Swift מקיף ומוכן לייצור לבניית אפליקציות הודעות מאובטחות עם הצפנה מקצה לקצה ותכונות אבטחה ברמת ארגון.",
  "needletailKitPrivateBadge": "SDK פרטי - נדרש רישיון",
  "needletailKitRequestLicense": "בקש רישיון",
  "needletailKitExploreFeatures": "חקור תכונות",
  "needletailKitFeaturesTitle": "תכונות ברמת ארגון",
  "needletailKitFeaturesDescription": "נבנה לייצור עם אבטחה מתקדמת וארכיטקטורת Swift מודרנית.",
  "needletailKitSecurityTitle": "אבטחה ארגונית",
  "needletailKitSecurityPQ": "קריפטוגרפיה פוסט-קוונטית - מוגן מפני התקפות קוונטיות עתידיות",
  "needletailKitSecurityDoubleRatchet": "פרוטוקול Double Ratchet - סודיות קדימה מושלמת",
  "needletailKitSecurityE2E": "הצפנה מקצה לקצה - כל ההודעות מוצפנות כברירת מחדל",
  "needletailKitSecurityDeviceVerification": "אימות מכשיר - קישור קריפטוגרפי של מכשירים",
  "needletailKitPlatformTitle": "תמיכה בפלטפורמות מרובות",
  "needletailKitPlatformIOS": "iOS 18.0+ - תמיכה מקורית מלאה ב-iOS",
  "needletailKitPlatformMacOS": "macOS 15.0+ - אינטגרציה מלאה של macOS",
  "needletailKitPlatformSwift6": "Swift 6.0+ - תכונות שפה אחרונות",
  "needletailKitPlatformAsync": "Async/Await - מקביליות מודרנית בכל מקום",
  "needletailKitTransportTitle": "תחבורה חכמה",
  "needletailKitTransportMulti": "ניתוב רב-תחבורה - בחירת נתיב אוטומטית",
  "needletailKitTransportP2P": "P2P רשת מקומית - תקשורת ישירה בין מכשירים",
  "needletailKitTransportDCC": "פרוטוקול DCC - P2P מבוסס IRC עם TLS",
  "needletailKitTransportFailover": "גיבוי אוטומטי - החלפת תחבורה חלקה",
  "needletailKitMessagingTitle": "הודעות עשירות",
  "needletailKitMessagingText": "הודעות טקסט - תקשורת פשוטה ומאובטחת",
  "needletailKitMessagingMedia": "הודעות מדיה - תמונות, סרטונים, מסמכים",
  "needletailKitMessagingSelfDestruct": "הודעות המתפוצצות עצמית - תמיכה זמנית",
  "needletailKitMessagingEdit": "עריכת הודעות - ערוך הודעות שנשלחו",
  "needletailKitVoiceVideoTitle": "שיחות קול ווידאו",
  "needletailKitVoiceVideoWebRTC": "אינטגרציה WebRTC - שיחות באיכות גבוהה",
  "needletailKitVoiceVideoSTUN": "תמיכה STUN/TURN - מעבר NAT",
  "needletailKitVoiceVideoCallManagement": "ניהול שיחות - טיפול מלא במחזור החיים",
  "needletailKitEnterpriseTitle": "מוכן לארגון",
  "needletailKitEnterpriseProduction": "מוכן לייצור - נבדק באפליקציות אמיתיות",
  "needletailKitEnterpriseSupport": "תמיכה ארגונית - תמיכה מקצועית זמינה",
  "needletailKitEnterpriseCompliance": "עמידה בתקנות - נבנה לעמידה רגולטורית",
  "needletailKitEnterpriseScalability": "מדרגיות - מתוכנן לפריסות בקנה מידה גדול",
  "needletailKitQuickStartTitle": "Quick Start",
  "needletailKitQuickStartDescription": "Get started with NeedleTailKit in minutes. Follow these simple steps to integrate secure messaging into your application.",
  "needletailKitInstallTitle": "Installation",
  "needletailKitInstallCode": "dependencies: [\n    .package(url: \"https://github.com/needletails/needle-tail-kit.git\", from: \"1.0.0\")\n]",
  "needletailKitInitializeTitle": "Initialize Session",
  "needletailKitInitializeCode": "import NeedleTailKit\n\nlet session = NeedleTailSession.shared\ntry await session.createNewUserAccount(\n    authInfo: authInfo,\n    store: store,\n    eventObserver: eventObserver\n)",
  "needletailKitSendMessageTitle": "Send Your First Message",
  "needletailKitSendMessageCode": "let contact = try await session.createContact(contact: \"bob\")\ntry await session.sendMessage(\n    messageType: .text,\n    recipient: .nickname(\"bob\"),\n    text: \"Hello, World!\"\n)",
  "needletailKitContactTitle": "בקש רישיון",
  "needletailKitContactDescription": "NeedleTailKit הוא SDK קנייני בקוד סגור. צור איתנו קשר כדי לדון באפשרויות רישוי לפרויקט שלך.",
  "needletailKitContactButton": "צור קשר לרישיון",
  "needletailKitMetaTitle": "NeedleTailKit - SDK הודעות מאובטחות ארגוני | NeedleTails",
  "needletailKitMetaDescription": "SDK Swift מוכן לייצור לבניית אפליקציות הודעות מאובטחות עם הצפנה מקצה לקצה. קריפטוגרפיה פוסט-קוונטית, תמיכה בפלטפורמות מרובות ואבטחה ברמת ארגון.",
  "needletailKitOgDescription": "SDK Swift מוכן לייצור להודעות מאובטחות עם תכונות אבטחה ברמת ארגון.",
  "needletailKitLogoAlt": "לוגו NeedleTailKit",
  "needletailKitPlatformAndroid": "Android: API 24 (Android 7.0) ומעלה",
  "nudgeWidgetTitle": "מאובטח עם Nudge",
  "nudgeWidgetDescription": "מנוטר עצמית באופן אופציונלי, הודעות מוצפנות מקצה לקצה עם שליטה מלאה בנתונים.",
  "nudgeWidgetCTA": "מידע נוסף",
  "nudgeWidgetLogoAlt": "לוגו Nudge",
  "nudgeFeature1Title": "End-to-End Encryption",
  "nudgeFeature1Description": "Every message encrypted by default. Full privacy.",
  "nudgeFeature2Title": "Your Data, Your Rules",
  "nudgeFeature2Description": "Optional self-hosting. No external data storage.",
  "nudgeFeature3Title": "Secure Channels",
  "nudgeFeature3Description": "Private messaging built for security.",
  "nudgeFeature4Title": "Global or Self-Hosted",
  "nudgeFeature4Description": "Scale globally or run your own instance—no data persistence risk.",
  "nudgeContactButton": "בדוק את Nudge",
  "nudgeMetaTitle": "Nudge - הודעות מאובטחות מוצפנות מקצה לקצה | NeedleTails",
  "nudgeMetaDescription": "אפליקציית הודעות מוצפנת מקצה לקצה עם נתונים מנוטרים עצמית באופן אופציונלי עם שליטה מלאה בנתונים. תקשורת מאובטחת ללא סיכוני הישארות נתונים.",
  "nudgeOgDescription": "הודעות מוצפנות מקצה לקצה עם נתונים מנוטרים עצמית באופן אופציונלי, שליטה מלאה בנתונים ואבטחה ברמת ארגון.",
  "nudgeMetaKeywords": "Nudge, הודעות מאובטחות, הצפנה מקצה לקצה, אפליקציית הודעות מוצפנת, הודעות מנוטרות עצמית באופן אופציונלי, הודעות פרטיות, תקשורת מאובטחת, פרטיות נתונים, אבטחת הודעות, צ'אט מוצפן, אפליקציית צ'אט מאובטחת, הודעות ממוקדות פרטיות",
  "brewhubMetaKeywords": "BrewHub, קורסי פיתוח תוכנה, קורסי תכנות, הכשרת מפתחים, חינוך תוכנה, קורסי קוד, מדריכי פיתוח, הכשרה טכנית, פלטפורמת למידת תוכנה, מדריכי תכנות, קורסי פיתוח אינטרנט, קורסי פיתוח נייד, הכשרה בפיתוח backend",
  "needletailKitMetaKeywords": "NeedleTailKit, SDK Swift, הצפנה מקצה לקצה, הודעות מאובטחות, SDK iOS, SDK macOS, SDK Android, קריפטוגרפיה פוסט-קוונטית",
  "heroTagline": "אנחנו פותרים את האתגרים שלכם—אפליקציות, אתרים ופתרונות תוכנה משולבים.",
  "managementPageLabel": "Management",
  "managementPageTitle": "Product & Project Delivery",
  "managementPageLead": "We align vision, roadmap, and execution so your software projects stay on scope, schedule, and quality.",
  "managementCtaLead": "Ready to align your next project?",
  "consultationPageLabel": "Consultation",
  "consultationCtaLead": "Tell us about your goals and we'll outline a clear path forward."
}
