{
  "introHeaderTwo": "Tu hai la visione; noi forniamo la soluzione. Che sia un'app mobile, un sito moderno o un sistema software completo, trasformiamo le tue sfide in prodotti affidabili e sicuri. Con esperienza enterprise su Mobile, Web e Server, costruiamo e integriamo soluzioni che scalano—così puoi concentrarti sul business.",
  "menuItemOne": "Corsi",
  "menuItemTwo": "Consulenza",
  "menuItemThree": "Gestione",
  "getInTouch": "Mettiti in Contatto",
  "projectsHeader": "Il Nostro Software",
  "projectsDescription": "Ci dedichiamo a fornirti una vasta gamma di software open-source. Per supportare questa missione, offriamo anche alcuni software proprietari. Ti invitiamo a esplorare i nostri progetti, che includono sia opzioni open-source che proprietarie. Se sei interessato a contribuire o ottenere una licenza per il nostro software proprietario, non esitare a metterti in contatto con noi.",
  "projectsOverview": "Ecco una lista di quello che facciamo e quello che abbiamo fatto",
  "businessOverviewTitle": "Specialisti Software Swift",
  "badgeMobile": "Mobile",
  "badgeWeb": "Web",
  "badgeServer": "Server",
  "businessOverviewDescription": "Trasformiamo le tue sfide software più difficili in soluzioni pronte per la produzione. Che tu abbia bisogno di una nuova app, un sito moderno o sistemi che si integrano senza attriti, forniamo su Mobile, Web e Server—nel linguaggio giusto per il tuo progetto. La nostra expertise Swift porta type safety, performance e affidabilità; ci integriamo anche con il tuo stack esistente. Collabora con noi per soluzioni fatte per durare e scalare con il tuo business.",
  "serviceHeaderBackendDevelopment": "Backend e API",
  "serviceDescriptionBackendDevelopment": "Risolvi sfide di scalabilità e integrazione con soluzioni server robuste. Costruiamo e colleghiamo API, database e servizi così le tue app e i tuoi siti funzionano in modo affidabile a qualsiasi scala.",
  "serviceHeaderMobileAppDevelopment": "App Mobile",
  "serviceDescriptionMobileAppDevelopment": "Ottieni un'app nativa che gli utenti amano. Costruiamo app iOS, Android e cross-platform che risolvono problemi reali—in tempo e pronte per lo store.",
  "serviceHeaderTraining": "BrewHub",
  "serviceDescriptionTraining": "Forma il tuo team con corsi professionali di sviluppo software. Formazione live guidata con tooling di livello production per costruire e mantenere soluzioni in-house.",
  "serviceHeaderWebDevelopment": "Sviluppo Web",
  "serviceDescriptionWebDevelopment": "Siti e web app che funzionano ovunque. Forniamo esperienze responsive, veloci e sicure che attirano utenti e supportano gli obiettivi del tuo business.",
  "openSourceHeader": "Open Source",
  "openSourceDescription": "Crediamo nel potere dell'open source. Esplora i nostri progetti su GitHub e contribuisci alla comunità. Il tuo supporto ci aiuta a continuare a sviluppare soluzioni innovative.",
  "whyChooseSwift": "Perché Scegliere Swift?",
  "typeSafety": "Type Safety",
  "typeSafetyDescription": "Il sistema di tipi di Swift previene errori al momento della compilazione, assicurando che le tue applicazioni siano robuste e affidabili fin dal primo giorno.",
  "performance": "Prestazioni",
  "performanceDescription": "Impronta di memoria ridotta e alte prestazioni rendono Swift ideale per ambienti con risorse limitate e applicazioni impegnative.",
  "threadSafety": "Thread Safety",
  "threadSafetyDescription": "Il supporto integrato per la concorrenza assicura che le tue applicazioni gestiscano più compiti in modo efficiente senza condizioni di gara.",
  "ourServices": "Come Risolviamo le Tue Sfide",
  "servicesDescription": "Dal concept al lancio e oltre, forniamo le app, i siti e le integrazioni di cui hai bisogno. Raccontaci la tua sfida—progettiamo, costruiamo e supportiamo la soluzione.",
  "startYourProject": "Inizia il Tuo Progetto",
  "swiftNative": "Native",
  "support": "Supporto",
  "possibilities": "Possibilità",
  "makingYour": "Trasformare le Tue",
  "ideasReality": "Idee in Realtà",
  "swiftSoftwareSpecialists": "Specialisti Software Swift",
  "swift": "Swift",
  "swiftServer": "Swift-Server",
  "frequentlyAskedQuestions": "Domande Frequenti",
  "faqDescription": "Ottieni risposte alle domande comuni sui nostri servizi di sviluppo software",
  "faqTechnologies": "In quali tecnologie ti specializzi?",
  "faqTechnologiesAnswer": "Ci specializziamo nello sviluppo web moderno utilizzando una vasta gamma di tecnologie inclusi, ma non limitati a Nuxt, Vue, Vapor e SwiftNIO. La nostra competenza linguistica include TypeScript e Swift. Lavoriamo anche con soluzioni backend robuste, servizi cloud, API e architettura scalabile per fornire applicazioni ad alte prestazioni.",
  "faqTimeline": "Quanto tempo richiede un progetto tipico?",
  "faqTimelineAnswer": "I tempi del progetto variano in base alla complessità. Le applicazioni web semplici richiedono 4-8 settimane, mentre le soluzioni enterprise complesse possono richiedere 3-6 mesi. Forniamo tempistiche dettagliate durante la consulenza.",
  "faqSupport": "Fornite supporto e manutenzione continua?",
  "faqSupportAnswer": "Sì, offriamo pacchetti di supporto completi inclusi monitoraggio 24/7, aggiornamenti regolari, patch di sicurezza e miglioramenti delle funzionalità per assicurare che la tua applicazione rimanga attuale e sicura.",
  "faqProcess": "Qual è il vostro processo di sviluppo?",
  "faqProcessAnswer": "Seguiamo un approccio collaborativo con comunicazione regolare con il cliente, sviluppo iterativo e test continui. Il nostro processo include fasi di pianificazione, progettazione, sviluppo, test e deployment.",
  "faqIntegration": "Potete lavorare con sistemi e API esistenti?",
  "faqIntegrationAnswer": "Assolutamente! Abbiamo un'esperienza estesa nell'integrazione con sistemi esistenti, API e database. Possiamo migliorare, modernizzare o ricostruire completamente la tua infrastruttura attuale.",
  "faqSecurity": "E la sicurezza e la protezione dei dati?",
  "faqSecurityAnswer": "La sicurezza è il default in tutto quello che costruiamo. Implementiamo pratiche di sviluppo software guidate dalla sicurezza, misure di sicurezza standard del settore, crittografia dei dati e audit di sicurezza regolari per proteggere i tuoi dati e le informazioni dei tuoi utenti.",
  "consultingTitle": "Your Challenges, Our Expertise",
  "consultingOverview": "Whether you're defining a new product, modernizing legacy systems, or choosing stack and architecture—we provide structured guidance so your decisions are informed by experience and aligned with your business goals.",
  "consultWithUs": "Discuss Your Initiative",
  "consultingWithUsMessage": "Share your goals, constraints, and timeline. We'll outline options, trade-offs, and a clear path forward—including scope, technology, and what it takes to get there.",
  "whatToConsultAbout": "What We Can Help With",
  "architectureDesign": "Architecture & System Design",
  "architectureDesignDescription": "Scalable, maintainable architectures for new and existing systems. We help you choose patterns, boundaries, and integration approaches so your solution is fit for production and future growth.",
  "technologySelection": "Technology & Stack Selection",
  "technologySelectionDescription": "Objective evaluation of technologies and vendors against your requirements, team skills, and long-term maintainability. We help you select a stack that balances delivery speed, cost, and risk.",
  "performanceOptimization": "Performance & Scalability",
  "performanceOptimizationDescription": "Response times, throughput, and resource usage. We apply caching, load balancing, query optimization, and capacity planning so your systems perform under load and stay cost-effective.",
  "securityReview": "Security & Compliance Review",
  "securityReviewDescription": "Security posture and compliance alignment. We assess design and implementation against common threats and frameworks so your applications and data meet business and regulatory expectations.",
  "codeReview": "Code & Implementation Review",
  "codeReviewDescription": "Expert review of code quality, patterns, and technical debt. We provide actionable feedback so your codebase stays maintainable, testable, and aligned with best practices.",
  "bestPractices": "Process & Best Practices",
  "bestPracticesDescription": "Development process, DevOps, and delivery practices. We help you adopt workflows that improve predictability, quality, and team efficiency.",
  "trainingProgramsHeader": "Programmi di Formazione",
  "trainingProgramsDescription": "Soluzioni di sviluppo professionale e formazione",
  "trainingOverview": "Programmi di formazione completi per migliorare le competenze del tuo team",
  "trainingCourses": "Corsi di Formazione",
  "vueJsDevelopment": "Sviluppo Vue.js",
  "vueJsDevelopmentDescription": "Impara le moderne pratiche di sviluppo Vue.js con Nuxt",
  "swiftBackendDevelopment": "Sviluppo Backend Swift",
  "swiftBackendDevelopmentDescription": "Padroneggia lo sviluppo backend Swift con Vapor e SwiftNIO",
  "typescriptDevelopment": "Sviluppo TypeScript",
  "typescriptDevelopmentDescription": "Costruisci applicazioni robuste con TypeScript",
  "securityFirstDevelopment": "Sviluppo Sicurezza-Prima",
  "securityFirstDevelopmentDescription": "Implementa pratiche di sviluppo software guidate dalla sicurezza",
  "productManagementExpertiseHeader": "Product Management",
  "productManagementExpertiseDescription": "Structured product management to align vision, roadmap, and delivery with business outcomes.",
  "productManagementOverview": "We support product-led organizations with discovery, prioritization, and lifecycle practices. From requirements and market insight through UX and roadmap planning, we help you ship the right features at the right time and keep stakeholders aligned.",
  "productManagementPoints": "Key Disciplines",
  "requirementsGathering": "Requirements & Discovery",
  "requirementsGatheringDescription": "Structured elicitation and documentation of functional and non-functional requirements. We capture clear, actionable specs so development and stakeholders share a single source of truth.",
  "marketResearch": "Market & User Research",
  "marketResearchDescription": "Evidence-based understanding of users, competitors, and market fit. We support product decisions with research so roadmaps are grounded in real demand and usage.",
  "userExperienceDesign": "User Experience Design",
  "userExperienceDesignDescription": "User-centered flows, information architecture, and interaction design. We align UX with business goals and accessibility so products are usable and compliant.",
  "productStrategy": "Product Strategy",
  "productStrategyDescription": "Vision, positioning, and roadmap aligned with business objectives. We help define and communicate strategy so teams and stakeholders move in the same direction.",
  "featurePrioritization": "Feature Prioritization",
  "featurePrioritizationDescription": "Framework-driven prioritization (value, effort, risk). We help you decide what to build next so capacity is focused on the highest-impact work.",
  "stakeholderManagement": "Stakeholder Management",
  "stakeholderManagementDescription": "Clear communication, expectations, and alignment with internal and external stakeholders. We keep everyone informed and bought in so delivery stays on track.",
  "projectManagementExpertiseHeader": "Project Management",
  "projectManagementExpertiseDescription": "Delivery discipline so your software projects stay on scope, schedule, and quality.",
  "projectManagementOverview": "We apply proven project management practices—planning, tracking, risk and resource management—tailored to your team size and methodology. We keep projects visible and predictable so you can deliver on commitments and adapt when priorities change.",
  "projectManagementPoints": "Key Disciplines",
  "projectPlanning": "Project Planning",
  "projectPlanningDescription": "Scoped plans, milestones, and dependencies. We define clear deliverables and timelines so execution is predictable and aligned with business goals.",
  "resourceManagement": "Resource Management",
  "resourceManagementDescription": "Capacity planning and allocation across teams and sprints. We help balance workload and skills so delivery stays sustainable and on track.",
  "riskManagement": "Risk Management",
  "riskManagementDescription": "Identification, assessment, and mitigation of technical and project risks. We surface and address risks early so issues don’t derail delivery.",
  "qualityAssurance": "Quality Assurance",
  "qualityAssuranceDescription": "Quality gates, acceptance criteria, and release readiness. We ensure standards are met so releases are reliable and supportable.",
  "overview": "Panoramica",
  "privacyPolicyTitle": "Informativa sulla Privacy",
  "effectiveDate": "Data di Entrata in Vigore",
  "effectiveDateValue": "10/05/2024",
  "introduction": "Introduzione",
  "informationWeDoNotCollect": "Informazioni che Non Raccogliamo",
  "informationCollectedByServers": "Informazioni Raccolte da Server e Tecnologie",
  "legalUse": "Uso Legale",
  "limitationOfLiability": "Limitazione di Responsabilità",
  "changesToPolicy": "Modifiche a Questa Informativa sulla Privacy",
  "privacyWelcomeMessage": "Benvenuto su NeedleTails.com. La tua privacy è importante per noi.",
  "privacyPurpose": "Questa Informativa sulla Privacy delinea le nostre pratiche riguardo alla raccolta di informazioni quando visiti il nostro sito.",
  "personalInformation": "Non raccogliamo alcuna informazione personale dai nostri utenti.",
  "informationOverview": "Mentre non raccogliamo informazioni personali, sii consapevole che server e altre tecnologie possono raccogliere automaticamente determinate informazioni.",
  "legalUseOverview": "Utilizzando il nostro Sito, accetti di rispettare tutte le leggi e i regolamenti locali applicabili.",
  "userResponsibility": "È tua responsabilità assicurarti che il tuo uso del Sito sia legale nella tua giurisdizione.",
  "privacyLimitationOverview": "L'autore di questo sito web non sarà ritenuto responsabile per eventuali danni o perdite derivanti dal tuo uso del Sito.",
  "privacyUserAcknowledgment": "Utilizzando il Sito, riconosci di farlo a tuo rischio e che l'autore non è responsabile per eventuali conseguenze derivanti dal tuo uso.",
  "privacyChangesToPolicy": "Potremmo aggiornare la nostra Informativa sulla Privacy di tanto in tanto. Ti notificheremo eventuali modifiche pubblicando la nuova Informativa sulla Privacy su questa pagina. Ti consigliamo di rivedere questa Informativa sulla Privacy periodicamente per eventuali modifiche.",
  "cookies": "Cookie",
  "cookiesDescription": "I cookie possono essere utilizzati per migliorare l'esperienza utente. Questi possono includere:",
  "sessionCookies": "Cookie di Sessione: Cookie temporanei che scadono quando chiudi il browser.",
  "persistentCookies": "Cookie Persistenti: Cookie che rimangono sul tuo dispositivo per un periodo stabilito o fino alla cancellazione.",
  "analytics": "Analytics",
  "analyticsDescription": "Potremmo utilizzare servizi di analytics di terze parti che raccolgono informazioni sull'uso del sito web, come:",
  "pageViews": "Visualizzazioni Pagina",
  "userInteractions": "Interazioni Utente",
  "trafficSources": "Fonti di Traffico",
  "serverLogs": "Log del Server",
  "serverLogsDescription": "I server web possono registrare informazioni sulla tua visita, inclusi:",
  "ipAddress": "Indirizzo IP",
  "browserType": "Tipo di Browser",
  "operatingSystem": "Sistema Operativo",
  "referringUrl": "URL di Riferimento",
  "pagesVisited": "Pagine Visitate",
  "timeAndDateOfAccess": "Ora e Data di Accesso",
  "termsTitle": "Termini e Condizioni",
  "termsEffectiveDate": "Data di Entrata in Vigore: 10/05/2024",
  "userAgreement": "Accordo Utente",
  "prohibitedActivities": "Attività Proibite",
  "changesToTerms": "Modifiche a Questi Termini",
  "termsWelcomeMessage": "Benvenuto nei nostri Termini e Condizioni.",
  "termsPurpose": "Questi termini governano il tuo uso dei nostri servizi.",
  "userAgreementText": "Utilizzando i nostri servizi, accetti questi termini.",
  "prohibitedActivitiesOverview": "Le seguenti attività sono proibite:",
  "usingServiceForIllegalPurposes": "Utilizzare il servizio per scopi illegali.",
  "engagingInHarassment": "Impegnarsi in qualsiasi forma di molestia o abuso.",
  "unauthorizedAccess": "Tentare di ottenere accesso non autorizzato ai nostri sistemi.",
  "distributingMalware": "Distribuire software malevolo o virus.",
  "termsLimitationOverview": "Non siamo responsabili per eventuali danni indiretti, incidentali o consequenziali.",
  "termsUserAcknowledgment": "Riconosci di utilizzare i nostri servizi a tuo rischio.",
  "termsChangesToTerms": "Potremmo aggiornare questi termini di tanto in tanto. Ti preghiamo di rivederli regolarmente.",
  "spineTailedKitTitle": "PQSRTC",
  "spineTailedKitDescription": "PQSRTC mira a offrire un protocollo RTC snello in Swift, con crittografia post-quantistica impostata come predefinita. È un SDK basato su WebRTC che si concentra nel fornire una soluzione moderna, sicura e ad alte prestazioni per applicazioni vocali e video su piattaforme Android e Apple, con logica condivisa scritta in Swift.",
  "needleTailKitTitle": "NeedleTailKit",
  "needleTailKitDescription": "Cos'è NeedleTailKit? NTK è l'SDK core per le Applicazioni Client e Server NeedleTail, abilitando la creazione di belle applicazioni crittografate end-to-end. Può essere utilizzato per varie applicazioni oltre alla messaggistica. Interessato? Contattaci per saperne di più!",
  "whiteTippedSocketsTitle": "White Tipped Sockets",
  "whiteTippedSocketsDescription": "WhiteTippedSockets è una libreria WebSocket nativa per iOS e macOS, costruita sull'API Network.framework utilizzando Swift Concurrency. Il nostro obiettivo è fornire una soluzione moderna ed efficiente per la comunicazione WebSocket, e pianifichiamo anche di sviluppare un server completamente funzionale e scalabile in futuro.",
  "swiftHlsTitle": "Swift HLS",
  "swiftHlsDescription": "HTTP Live Streaming (HLS) è una tecnologia chiave per lo streaming di media efficiente, e SwiftHLS è progettato per facilitare questo. Utilizzando lo stesso protocollo che alimenta il web, HLS permette la consegna di contenuti tramite API REST e CDN. Il suo scopo è fornire affidabilità e si adatta dinamicamente alle condizioni di rete.",
  "swiftIapTitle": "Swift IAP",
  "swiftIapDescription": "SwiftIAP è una libreria completa di In-App Purchase per applicazioni iOS e macOS. Fornisce un'interfaccia moderna e type-safe per gestire acquisti in-app, abbonamenti e validazione delle ricevute. Costruita con Swift Concurrency e progettata per facilità d'uso.",
  "stompTitle": "Stomp",
  "stompDescription": "Stomp è una libreria Swift per la comunicazione del protocollo STOMP. Fornisce un'interfaccia moderna e type-safe per connettersi a server STOMP e gestire il routing dei messaggi. Perfetto per applicazioni che necessitano di infrastruttura di messaggistica affidabile.",
  "privacy": "Informativa sulla Privacy",
  "termsConditions": "Termini e Condizioni",
  "projectTitle_1": "Progetti",
  "projectHeader_1": "PQSRTC",
  "projectTitleText_1": "Soluzione RTC VoIP",
  "projectTitle_2": "Progetti",
  "projectHeader_2": "NeedleTailKit",
  "projectTitleText_2": "Soluzione di Messaggistica Crittografata End-to-End",
  "projectTitle_3": "Progetti",
  "projectHeader_3": "White Tipped Sockets",
  "projectTitleText_3": "Wrapper Swift Concurrent Network.framework",
  "projectTitle_4": "Progetti",
  "projectHeader_4": "Swift Stomp",
  "projectTitleText_4": "Protocollo STOMP Swift Concurrent",
  "projectTitle_5": "Progetti",
  "projectHeader_5": "Swift HLS",
  "projectTitleText_5": "Progetto Swift HLS",
  "pageNotFound": "Pagina Non Trovata",
  "pageNotFoundDescription": "La pagina che stai cercando non esiste o è stata spostata. Ti aiutiamo a tornare sulla strada giusta.",
  "goHome": "Vai alla Home",
  "goBack": "Torna Indietro",
  "contact": "Contatto",
  "contactUs": "Contattaci",
  "becomeASponsor": "Diventa un Sponsor",
  "supportOpenSourceMessage": "Supporta i nostri progetti open source e aiutaci a continuare a costruire software straordinario.",
  "getStartedOnDigitalOcean": "Inizia su Digital Ocean con un credito di $100 per 60 giorni per nuovi utenti.",
  "readyToGetStarted": "Pronto a Iniziare?",
  "letsDiscussProject": "Discutiamo del tuo progetto e vediamo come possiamo aiutarti a realizzare le tue idee con soluzioni alimentate da Swift.",
  "backToTop": "Torna in Cima",
  "needleTailsCopyright": "NeedleTails©",
  "pointsForConsideration": "Punti da Considerare",
  "responsiveDesign": "Responsive & Adaptive Design",
  "responsiveDesignDescription": "Layouts and components that adapt to all viewports and devices. We deliver consistent, high-quality experiences on desktop, tablet, and mobile so your web product works everywhere your users are.",
  "crossBrowserCompatibility": "Cross-Browser & Standards Compliance",
  "crossBrowserCompatibilityDescription": "Testing and compatibility across major browsers and standards. We ensure consistent behavior and appearance so your application works reliably for every user, regardless of browser or device.",
  "webPerformanceOptimizationDescription": "Performance budgets, lazy loading, and optimized assets. We minimize load times and resource usage through efficient code, caching, and CDN strategies so your site feels fast and remains cost-effective at scale.",
  "userExperience": "User Experience & Accessibility",
  "userExperienceDescription": "Clear information architecture, intuitive navigation, and WCAG-aligned accessibility. We design and implement UX that drives engagement and meets enterprise usability and compliance expectations.",
  "securityPractices": "Security & Data Protection",
  "securityPracticesDescription": "HTTPS, secure headers, input validation, and protection against OWASP-top risks including XSS and CSRF. We harden web applications so your data and your users stay secure in production.",
  "seoBestPractices": "SEO & Discoverability",
  "seoBestPracticesDescription": "Semantic structure, meta tags, and content strategy aligned with search best practices. We optimize for discoverability and ranking so your web presence supports your business and marketing goals.",
  "backendSolutionsHeader": "Server-Side Solutions",
  "backendSolutionsDescription": "We design and deliver production-grade backends that power your business. Our server-first approach ensures APIs, data pipelines, and integrations are built for reliability, compliance, and scale—so your applications perform under real-world load and security requirements.",
  "backendCapabilitiesOverview": "Our server-side practice is built on Swift (Vapor, Hummingbird, SwiftNIO) and proven cloud-native patterns. We deliver secure, high-performance backends—REST and custom APIs, event-driven systems, and seamless integration with your existing stack. From architecture through deployment and observability, we own the full lifecycle so your teams can focus on product, not infrastructure.",
  "scalability": "Scalability & Resilience",
  "scalabilityDescription": "Architectures designed for growth: horizontal scaling, stateless services, and resilient patterns. We apply microservices, serverless, and queue-based designs so your backend handles traffic spikes and data growth without rework.",
  "security": "Security & Compliance",
  "securityDescription": "Robust security by default: encryption at rest and in transit, identity and access control, audit trails, and alignment with common compliance frameworks. We harden backends so your data and your users stay protected.",
  "maintainability": "Maintainability & Standards",
  "maintainabilityDescription": "Clean, modular, and well-documented codebases with consistent patterns and version control. We adopt and document coding standards so your team can maintain and extend the system with confidence.",
  "testingAndQualityAssurance": "Testing & Quality Assurance",
  "testingAndQualityAssuranceDescription": "Rigorous testing strategies: unit, integration, and contract tests with CI/CD automation. We maintain high quality and regression safety so releases are predictable and low-risk.",
  "monitoringAndLogging": "Monitoring & Observability",
  "monitoringAndLoggingDescription": "Production-ready observability: structured logging, metrics, and alerting. We instrument backends so you have clear visibility into health, performance, and incidents—and can respond before users are affected.",
  "nativeAppDevelopmentHeader": "Native Application Development",
  "nativeAppDevelopmentDescription": "We deliver native applications built for performance, security, and great user experience—on every platform your business requires.",
  "nativeAppDevelopmentOverview": "We build production-ready native apps for the full Apple ecosystem (iOS, iPadOS, macOS, tvOS, watchOS, visionOS) and Android. Our work emphasizes type-safe Swift and Kotlin/Java, platform-appropriate UX, accessibility, and security-by-design. From MVPs to large-scale deployments, we handle architecture, store readiness, and ongoing support so your apps stay performant, compliant, and maintainable.",
  "designConsistency": "Design Systems & Consistency",
  "designConsistencyDescription": "Unified design systems and component libraries across platforms. We ensure consistent branding, interaction patterns, and accessibility so your product feels cohesive on every device.",
  "deviceFragmentation": "Device & Platform Coverage",
  "deviceFragmentationDescription": "Structured testing across device matrices, screen sizes, and OS versions. We validate behavior and performance so your app works reliably for all target users, including edge cases.",
  "userExperienceUX": "User Experience & Accessibility",
  "userExperienceUXDescription": "Intuitive flows, clear information architecture, and WCAG-aligned accessibility. We design and implement UX that serves all users and supports usability and compliance goals.",
  "distributionCompliance": "Distribution & Store Compliance",
  "distributionComplianceDescription": "App Store and Play Store readiness: guidelines, privacy labels, and review best practices. We prepare and maintain your apps for public and private distribution channels.",
  "webDevelopmentExpertiseHeader": "Web Application Development",
  "webDevelopmentExpertiseDescription": "We build and maintain web applications that support your business goals—from marketing sites and portals to full-stack web apps that integrate with your existing systems.",
  "webDevelopmentOverview": "We deliver production-grade web experiences: responsive sites, SPAs, and full-stack applications built with Vue.js, Nuxt, and TypeScript on the front end, and Vapor, Hummingbird, or your preferred backend. Our work covers corporate sites, customer portals, internal tools, and public-facing apps—with a focus on performance, security, SEO, and maintainability so your web presence scales with your organization.",
  "solutionsTitle": "Le Nostre Soluzioni",
  "featuredApplications": "Applicazioni in Evidenza",
  "our": "Le Nostre",
  "featuredApps": "App in Evidenza",
  "featuredAppsDescription": "Scopri le nostre applicazioni innovative che mostrano la potenza dello sviluppo Swift e dell'architettura software moderna.",
  "nudgeTitle": "Secure Messaging You Control",
  "nudgeDescription": "End-to-end encrypted messaging with optional self-hosting. Your data stays yours—no third-party storage, no persistence risk. Run your own instance or scale globally.",
  "islandHoppersTitle": "Island Hoppers: La Tua App di Tour Definitiva per Avventure Senza Problemi!",
  "islandHoppersDescription": "Island Hoppers è l'app tutto-in-uno progettata per migliorare la tua esperienza di viaggio, che tu sia un'azienda che organizza tour indimenticabili o un cliente che cerca la fuga perfetta. Per le aziende, la nostra app semplifica l'intero processo di gestione dei tour. Organizza e personalizza i tuoi tour senza sforzo, comunica direttamente con le guide turistiche e mantieni i tuoi clienti informati con aggiornamenti in tempo reale. Con Island Hoppers, puoi gestire prenotazioni, tracciare le preferenze dei clienti e assicurarti che ogni dettaglio sia curato, permettendoti di concentrarti sulla consegna di esperienze eccezionali. Per i clienti, Island Hoppers offre una gamma diversificata di pacchetti tour adattati a vari tipi di gruppi, incluse famiglie, backpacker ed entusiasti delle feste. Sfoglia la nostra selezione curata di avventure, scegli il pacchetto perfetto che si adatta al tuo stile e connettiti con viaggiatori affini. Goditi una comunicazione fluida con le tue guide turistiche, accedi a informazioni essenziali e ricevi raccomandazioni personalizzate per ottenere il massimo dal tuo viaggio. Con Island Hoppers, imbarcati in avventure indimenticabili con facilità e fiducia, sapendo che ogni aspetto del tuo tour è a portata di clic!",
  "streamStackTitle": "Una Piattaforma Educativa per le Tue Soluzioni Software",
  "streamStackDescription": "Stream, Leggi, Discuti. Che tu sia nuovo alla programmazione o voglia leggere su diverse soluzioni software, ti rendiamo facile farlo con la nostra app Nuxt supportata da Vapor. Rimani aggiornato con le ultime tendenze di codifica.",
  "welcomeToNeedleTails": "Benvenuto a NeedleTails - Il Tuo Alleato nello Sviluppo Software",
  "accept": "Accetto e sono d'accordo",
  "cookieConsentTitle": "Utilizziamo l'archiviazione del browser",
  "cookieConsentMessage": "Utilizziamo l'archiviazione del browser per ricordare la tua preferenza di lingua e migliorare la tua esperienza di navigazione. Cliccando su 'Accetta Tutto', acconsenti al nostro utilizzo dell'archiviazione del browser.",
  "cookieConsentAcceptAll": "Accetta Tutto",
  "cookieConsentAcceptNecessary": "Solo Necessari",
  "cookieConsentReject": "Rifiuta Tutto",
  "cookieConsentLearnMore": "Scopri di Più",
  "cookieConsentNecessary": "L'archiviazione necessaria include il rilevamento della lingua per fornire contenuti nella tua lingua preferita.",
  "cookieConsentAnalytics": "Attualmente non utilizziamo il tracciamento analitico su questo sito web.",
  "cookieConsentPreferences": "L'archiviazione delle preferenze ricorda le tue impostazioni come tema e preferenze utente per personalizzare la tua esperienza.",
  "cookieConsentMarketing": "Attualmente non utilizziamo il tracciamento marketing o la pubblicità su questo sito web.",
  "brewhubWidgetTitle": "BrewHub",
  "brewhubWidgetDescription": "Piattaforma professionale di corsi e istruzione per lo sviluppo software. Accedi a formazione guidata in diretta con strumenti e flussi di lavoro di livello produzione per migliorare le tue competenze di sviluppo.",
  "brewhubWidgetCTA": "Corsi di Formazione",
  "brewhubComingSoonTitle": "Disponibile",
  "brewhubComingSoonDescription": "BrewHub è ora disponibile. Visita brewhub.needletails.com per corsi e formazione professionale nello sviluppo software.",
  "brewhubFeature1Title": "Corsi con esperti",
  "brewhubFeature1Description": "Accedi a corsi professionali di sviluppo software tenuti da esperti del settore.",
  "brewhubFeature2Title": "Formazione dal vivo",
  "brewhubFeature2Description": "Formazione dal vivo individuale o in piccoli gruppi con guida diretta di esperti.",
  "brewhubFeature3Title": "Community",
  "brewhubFeature3Description": "Unisciti a una community di sviluppatori e impara insieme.",
  "brewhubFeature4Title": "Strumenti di produzione",
  "brewhubFeature4Description": "Impara con gli stessi strumenti e flussi di lavoro usati negli ambienti di produzione.",
  "brewhubBackToMainSite": "Vai a BrewHub",
  "brewhubMetaTitle": "BrewHub | NeedleTails",
  "brewhubMetaDescription": "BrewHub è la piattaforma di NeedleTails per corsi e formazione professionale nello sviluppo software.",
  "brewhubOgDescription": "Corsi e formazione professionale nello sviluppo software.",
  "brewhubLogoAlt": "Logo BrewHub",
  "needletailKitTitle": "NeedleTailKit",
  "needletailKitSubtitle": "Un SDK Swift completo e pronto per la produzione per creare applicazioni di messaggistica sicure con crittografia end-to-end e funzionalità di sicurezza di livello aziendale.",
  "needletailKitPrivateBadge": "SDK Privato - Licenza Richiesta",
  "needletailKitRequestLicense": "Richiedi Licenza",
  "needletailKitExploreFeatures": "Esplora Funzionalità",
  "needletailKitFeaturesTitle": "Funzionalità di Livello Aziendale",
  "needletailKitFeaturesDescription": "Costruito per la produzione con sicurezza all'avanguardia e architettura Swift moderna.",
  "needletailKitSecurityTitle": "Sicurezza Aziendale",
  "needletailKitSecurityPQ": "Crittografia Post-Quantistica - A prova di attacchi quantistici futuri",
  "needletailKitSecurityDoubleRatchet": "Protocollo Double Ratchet - Segretezza diretta perfetta",
  "needletailKitSecurityE2E": "Crittografia End-to-End - Tutti i messaggi crittografati di default",
  "needletailKitSecurityDeviceVerification": "Verifica Dispositivi - Collegamento crittografico dei dispositivi",
  "needletailKitPlatformTitle": "Supporto Multi-Piattaforma",
  "needletailKitPlatformIOS": "iOS 18.0+ - Supporto nativo completo per iOS",
  "needletailKitPlatformMacOS": "macOS 15.0+ - Integrazione completa di macOS",
  "needletailKitPlatformSwift6": "Swift 6.0+ - Funzionalità linguistiche più recenti",
  "needletailKitPlatformAsync": "Async/Await - Concorrenza moderna ovunque",
  "needletailKitTransportTitle": "Trasporto Intelligente",
  "needletailKitTransportMulti": "Instradamento Multi-Trasporto - Selezione automatica del percorso",
  "needletailKitTransportP2P": "P2P Rete Locale - Comunicazione diretta tra dispositivi",
  "needletailKitTransportDCC": "Protocollo DCC - P2P basato su IRC con TLS",
  "needletailKitTransportFailover": "Failover Automatico - Cambio di trasporto senza interruzioni",
  "needletailKitMessagingTitle": "Messaggistica Ricca",
  "needletailKitMessagingText": "Messaggi di Testo - Comunicazione semplice e sicura",
  "needletailKitMessagingMedia": "Messaggi Multimediali - Immagini, video, documenti",
  "needletailKitMessagingSelfDestruct": "Messaggi Auto-Distruttivi - Supporto temporaneo",
  "needletailKitMessagingEdit": "Modifica Messaggi - Modificare i messaggi inviati",
  "needletailKitVoiceVideoTitle": "Chiamate Vocali e Video",
  "needletailKitVoiceVideoWebRTC": "Integrazione WebRTC - Chiamate di alta qualità",
  "needletailKitVoiceVideoSTUN": "Supporto STUN/TURN - Traversata NAT",
  "needletailKitVoiceVideoCallManagement": "Gestione Chiamate - Gestione completa del ciclo di vita",
  "needletailKitEnterpriseTitle": "Pronto per Aziende",
  "needletailKitEnterpriseProduction": "Pronto per la Produzione - Testato in applicazioni reali",
  "needletailKitEnterpriseSupport": "Supporto Aziendale - Supporto professionale disponibile",
  "needletailKitEnterpriseCompliance": "Conformità - Costruito per la conformità normativa",
  "needletailKitEnterpriseScalability": "Scalabilità - Progettato per distribuzioni su larga scala",
  "needletailKitQuickStartTitle": "Quick Start",
  "needletailKitQuickStartDescription": "Get started with NeedleTailKit in minutes. Follow these simple steps to integrate secure messaging into your application.",
  "needletailKitInstallTitle": "Installation",
  "needletailKitInstallCode": "dependencies: [\n    .package(url: \"https://github.com/needletails/needle-tail-kit.git\", from: \"1.0.0\")\n]",
  "needletailKitInitializeTitle": "Initialize Session",
  "needletailKitInitializeCode": "import NeedleTailKit\n\nlet session = NeedleTailSession.shared\ntry await session.createNewUserAccount(\n    authInfo: authInfo,\n    store: store,\n    eventObserver: eventObserver\n)",
  "needletailKitSendMessageTitle": "Send Your First Message",
  "needletailKitSendMessageCode": "let contact = try await session.createContact(contact: \"bob\")\ntry await session.sendMessage(\n    messageType: .text,\n    recipient: .nickname(\"bob\"),\n    text: \"Hello, World!\"\n)",
  "needletailKitContactTitle": "Richiedi una Licenza",
  "needletailKitContactDescription": "NeedleTailKit è un SDK proprietario a codice chiuso. Contattaci per discutere le opzioni di licenza per il tuo progetto.",
  "needletailKitContactButton": "Contatta per Licenza",
  "needletailKitMetaTitle": "NeedleTailKit - SDK di Messaggistica Sicura Aziendale | NeedleTails",
  "needletailKitMetaDescription": "SDK Swift pronto per la produzione per creare applicazioni di messaggistica sicure con crittografia end-to-end. Crittografia post-quantistica, supporto multi-piattaforma e sicurezza di livello aziendale.",
  "needletailKitOgDescription": "SDK Swift pronto per la produzione per messaggistica sicura con funzionalità di sicurezza di livello aziendale.",
  "needletailKitLogoAlt": "Logo NeedleTailKit",
  "needletailKitPlatformAndroid": "Android: API 24 (Android 7.0) o successivo",
  "nudgeWidgetTitle": "Sicuro con Nudge",
  "nudgeWidgetDescription": "Opcionalmente automonitorato, messaggistica con crittografia end-to-end con controllo completo dei dati.",
  "nudgeWidgetCTA": "Scopri di Più",
  "nudgeWidgetLogoAlt": "Logo Nudge",
  "nudgeFeature1Title": "End-to-End Encryption",
  "nudgeFeature1Description": "Every message encrypted by default. Full privacy.",
  "nudgeFeature2Title": "Your Data, Your Rules",
  "nudgeFeature2Description": "Optional self-hosting. No external data storage.",
  "nudgeFeature3Title": "Secure Channels",
  "nudgeFeature3Description": "Private messaging built for security.",
  "nudgeFeature4Title": "Global or Self-Hosted",
  "nudgeFeature4Description": "Scale globally or run your own instance—no data persistence risk.",
  "nudgeContactButton": "Scopri Nudge",
  "nudgeMetaTitle": "Nudge - Messaggistica Sicura con Crittografia End-to-End | NeedleTails",
  "nudgeMetaDescription": "Applicazione di messaggistica con crittografia end-to-end e dati opzionalmente automonitorati con controllo completo dei dati. Comunicazione sicura senza rischi di persistenza dei dati.",
  "nudgeOgDescription": "Messaggistica con crittografia end-to-end e dati opzionalmente automonitorati con controllo completo dei dati e sicurezza di livello aziendale.",
  "nudgeMetaKeywords": "Nudge, messaggistica sicura, crittografia end-to-end, app di messaggistica crittografata, messaggistica opzionalmente automonitorata, messaggistica privata, comunicazione sicura, privacy dei dati, sicurezza della messaggistica, chat crittografata, app di chat sicura, messaggistica orientata alla privacy",
  "brewhubMetaKeywords": "BrewHub, corsi di sviluppo software, corsi di programmazione, formazione per sviluppatori, educazione software, corsi di codifica, tutorial di sviluppo, formazione tecnica, piattaforma di apprendimento software, tutorial di programmazione, corsi di sviluppo web, corsi di sviluppo mobile, formazione in sviluppo backend",
  "needletailKitMetaKeywords": "NeedleTailKit, SDK Swift, crittografia end-to-end, messaggistica sicura, SDK iOS, SDK macOS, SDK Android, crittografia post-quantistica",
  "heroTagline": "Risolviamo le tue sfide—app, siti web e soluzioni software integrate.",
  "managementPageLabel": "Management",
  "managementPageTitle": "Product & Project Delivery",
  "managementPageLead": "We align vision, roadmap, and execution so your software projects stay on scope, schedule, and quality.",
  "managementCtaLead": "Ready to align your next project?",
  "consultationPageLabel": "Consultation",
  "consultationCtaLead": "Tell us about your goals and we'll outline a clear path forward."
}
