{
  "introHeaderTwo": "U heeft de visie; wij leveren de oplossing. Of het nu een mobiele app, een moderne website of een volledig softwaresysteem is—wij maken van uw uitdagingen betrouwbare, veilige producten. Met enterprise-ervaring op Mobile, Web en Server bouwen en integreren wij oplossingen die meeschalen—zodat u zich op uw bedrijf kunt richten.",
  "menuItemOne": "Cursussen",
  "menuItemTwo": "Consultancy",
  "menuItemThree": "Management",
  "getInTouch": "Neem Contact Op",
  "projectsHeader": "Onze Software",
  "projectsDescription": "We zijn toegewijd aan het leveren van een breed scala aan open-source software. Om deze missie te ondersteunen, bieden we ook enkele closed-source software aan. We nodigen u uit om onze projecten te verkennen, die zowel open-source als closed-source opties omvatten. Als u geïnteresseerd bent in het bijdragen of het verkrijgen van een licentie voor onze closed-source software, aarzel dan niet om contact met ons op te nemen.",
  "projectsOverview": "Hier is een lijst van wat we doen en wat we hebben gedaan",
  "businessOverviewTitle": "Swift Software Specialisten",
  "badgeMobile": "Mobiel",
  "badgeWeb": "Web",
  "badgeServer": "Server",
  "businessOverviewDescription": "Wij maken van uw lastigste software-uitdagingen productieklare oplossingen. Of u nu een nieuwe app, een moderne website of naadloos geïntegreerde systemen nodig heeft—wij leveren op Mobile, Web en Server, in de juiste taal voor uw project. Onze Swift-expertise brengt type safety, performance en betrouwbaarheid; we integreren ook met uw bestaande stack. Werk met ons samen voor oplossingen die meegroeien met uw bedrijf.",
  "serviceHeaderBackendDevelopment": "Backend & API's",
  "serviceDescriptionBackendDevelopment": "Los schaal- en integratie-uitdagingen op met robuuste server-side oplossingen. Wij bouwen en koppelen API's, databases en diensten zodat uw apps en websites betrouwbaar draaien op elke schaal.",
  "serviceHeaderMobileAppDevelopment": "Mobiele Apps",
  "serviceDescriptionMobileAppDevelopment": "Krijg een native app waar gebruikers van houden. Wij bouwen iOS-, Android- en cross-platform apps die echte problemen oplossen—op tijd en store-klaar.",
  "serviceHeaderTraining": "BrewHub",
  "serviceDescriptionTraining": "School uw team met professionele software-ontwikkelcursussen. Begeleide live training met production-grade tooling zodat u oplossingen intern kunt bouwen en onderhouden.",
  "serviceHeaderWebDevelopment": "Webontwikkeling",
  "serviceDescriptionWebDevelopment": "Websites en web-apps die overal werken. Wij leveren responsive, snelle en veilige ervaringen die gebruikers aantrekken en uw bedrijfsdoelen ondersteunen.",
  "openSourceHeader": "Open Source",
  "openSourceDescription": "We geloven in de kracht van open source. Verken onze projecten op GitHub en draag bij aan de community. Uw steun helpt ons om door te gaan met het ontwikkelen van innovatieve oplossingen.",
  "whyChooseSwift": "Waarom Swift Kiezen?",
  "typeSafety": "Type Veiligheid",
  "typeSafetyDescription": "Swift's typesysteem voorkomt fouten tijdens compilatie, waardoor uw applicaties robuust en betrouwbaar zijn vanaf dag één.",
  "performance": "Prestaties",
  "performanceDescription": "Lage geheugenvoetafdruk en hoge prestaties maken Swift ideaal voor omgevingen met beperkte middelen en veeleisende applicaties.",
  "threadSafety": "Thread Veiligheid",
  "threadSafetyDescription": "Ingebouwde concurrency-ondersteuning zorgt ervoor dat uw applicaties meerdere taken efficiënt kunnen afhandelen zonder race conditions.",
  "ourServices": "Hoe Wij Uw Uitdagingen Oplossen",
  "servicesDescription": "Van concept tot lancering en verder leveren wij de apps, websites en integraties die u nodig heeft. Vertel ons uw uitdaging—wij ontwerpen, bouwen en ondersteunen de oplossing.",
  "startYourProject": "Start Uw Project",
  "swiftNative": "Native",
  "support": "Ondersteuning",
  "possibilities": "Mogelijkheden",
  "makingYour": "Uw Ideeën",
  "ideasReality": "Ideeën Werkelijkheid",
  "swiftSoftwareSpecialists": "Swift Software Specialisten",
  "swift": "Swift",
  "swiftServer": "Swift-Server",
  "frequentlyAskedQuestions": "Veelgestelde Vragen",
  "faqDescription": "Krijg antwoorden op veelgestelde vragen over onze softwareontwikkelingsdiensten",
  "faqTechnologies": "In welke technologieën bent u gespecialiseerd?",
  "faqTechnologiesAnswer": "We zijn gespecialiseerd in moderne webontwikkeling met een breed scala aan technologieën, waaronder maar niet beperkt tot Nuxt, Vue, Vapor en SwiftNIO. Onze taalexpertise omvat TypeScript en Swift. We werken ook met robuuste backend-oplossingen, clouddiensten, API's en schaalbare architectuur om hoogwaardige applicaties te leveren.",
  "faqTimeline": "Hoe lang duurt een typisch project?",
  "faqTimelineAnswer": "Projecttijdlijnen variëren op basis van complexiteit. Eenvoudige webapplicaties nemen 4-8 weken in beslag, terwijl complexe enterprise-oplossingen 3-6 maanden kunnen duren. We geven gedetailleerde tijdlijnen tijdens consultatie.",
  "faqSupport": "Biedt u doorlopende ondersteuning en onderhoud?",
  "faqSupportAnswer": "Ja, we bieden uitgebreide ondersteuningspakketten aan, inclusief 24/7 monitoring, regelmatige updates, beveiligingspatches en functieverbeteringen om ervoor te zorgen dat uw applicatie actueel en veilig blijft.",
  "faqProcess": "Wat is uw ontwikkelingsproces?",
  "faqProcessAnswer": "We volgen een collaboratieve aanpak met regelmatige klantcommunicatie, iteratieve ontwikkeling en continue testing. Ons proces omvat plannings-, ontwerp-, ontwikkelings-, test- en implementatiefases.",
  "faqIntegration": "Kunt u werken met bestaande systemen en API's?",
  "faqIntegrationAnswer": "Absoluut! We hebben uitgebreide ervaring met het integreren van bestaande systemen, API's en databases. We kunnen uw huidige infrastructuur verbeteren, moderniseren of volledig herbouwen.",
  "faqSecurity": "Hoe zit het met beveiliging en gegevensbescherming?",
  "faqSecurityAnswer": "Beveiliging is standaard in alles wat we bouwen. We implementeren beveiligingsgedreven softwareontwikkelingspraktijken, industrie-standaard beveiligingsmaatregelen, gegevensversleuteling en regelmatige beveiligingsaudits om uw gegevens en de informatie van uw gebruikers te beschermen.",
  "consultingTitle": "Your Challenges, Our Expertise",
  "consultingOverview": "Whether you're defining a new product, modernizing legacy systems, or choosing stack and architecture—we provide structured guidance so your decisions are informed by experience and aligned with your business goals.",
  "consultWithUs": "Discuss Your Initiative",
  "consultingWithUsMessage": "Share your goals, constraints, and timeline. We'll outline options, trade-offs, and a clear path forward—including scope, technology, and what it takes to get there.",
  "whatToConsultAbout": "What We Can Help With",
  "architectureDesign": "Architecture & System Design",
  "architectureDesignDescription": "Scalable, maintainable architectures for new and existing systems. We help you choose patterns, boundaries, and integration approaches so your solution is fit for production and future growth.",
  "technologySelection": "Technology & Stack Selection",
  "technologySelectionDescription": "Objective evaluation of technologies and vendors against your requirements, team skills, and long-term maintainability. We help you select a stack that balances delivery speed, cost, and risk.",
  "performanceOptimization": "Performance & Scalability",
  "performanceOptimizationDescription": "Response times, throughput, and resource usage. We apply caching, load balancing, query optimization, and capacity planning so your systems perform under load and stay cost-effective.",
  "securityReview": "Security & Compliance Review",
  "securityReviewDescription": "Security posture and compliance alignment. We assess design and implementation against common threats and frameworks so your applications and data meet business and regulatory expectations.",
  "codeReview": "Code & Implementation Review",
  "codeReviewDescription": "Expert review of code quality, patterns, and technical debt. We provide actionable feedback so your codebase stays maintainable, testable, and aligned with best practices.",
  "bestPractices": "Process & Best Practices",
  "bestPracticesDescription": "Development process, DevOps, and delivery practices. We help you adopt workflows that improve predictability, quality, and team efficiency.",
  "trainingProgramsHeader": "Trainingsprogramma's",
  "trainingProgramsDescription": "Professionele ontwikkeling en trainingsoplossingen",
  "trainingOverview": "Uitgebreide trainingsprogramma's om de vaardigheden van uw team te verbeteren",
  "trainingCourses": "Training Cursussen",
  "vueJsDevelopment": "Vue.js Ontwikkeling",
  "vueJsDevelopmentDescription": "Leer moderne Vue.js ontwikkelingspraktijken met Nuxt",
  "swiftBackendDevelopment": "Swift Backend Ontwikkeling",
  "swiftBackendDevelopmentDescription": "Beheers Swift backend-ontwikkeling met Vapor en SwiftNIO",
  "typescriptDevelopment": "TypeScript Ontwikkeling",
  "typescriptDevelopmentDescription": "Bouw robuuste applicaties met TypeScript",
  "securityFirstDevelopment": "Beveiligings-Eerste Ontwikkeling",
  "securityFirstDevelopmentDescription": "Implementeer beveiligingsgedreven softwareontwikkelingspraktijken",
  "productManagementExpertiseHeader": "Product Management",
  "productManagementExpertiseDescription": "Structured product management to align vision, roadmap, and delivery with business outcomes.",
  "productManagementOverview": "We support product-led organizations with discovery, prioritization, and lifecycle practices. From requirements and market insight through UX and roadmap planning, we help you ship the right features at the right time and keep stakeholders aligned.",
  "productManagementPoints": "Key Disciplines",
  "requirementsGathering": "Requirements & Discovery",
  "requirementsGatheringDescription": "Structured elicitation and documentation of functional and non-functional requirements. We capture clear, actionable specs so development and stakeholders share a single source of truth.",
  "marketResearch": "Market & User Research",
  "marketResearchDescription": "Evidence-based understanding of users, competitors, and market fit. We support product decisions with research so roadmaps are grounded in real demand and usage.",
  "userExperienceDesign": "User Experience Design",
  "userExperienceDesignDescription": "User-centered flows, information architecture, and interaction design. We align UX with business goals and accessibility so products are usable and compliant.",
  "productStrategy": "Product Strategy",
  "productStrategyDescription": "Vision, positioning, and roadmap aligned with business objectives. We help define and communicate strategy so teams and stakeholders move in the same direction.",
  "featurePrioritization": "Feature Prioritization",
  "featurePrioritizationDescription": "Framework-driven prioritization (value, effort, risk). We help you decide what to build next so capacity is focused on the highest-impact work.",
  "stakeholderManagement": "Stakeholder Management",
  "stakeholderManagementDescription": "Clear communication, expectations, and alignment with internal and external stakeholders. We keep everyone informed and bought in so delivery stays on track.",
  "projectManagementExpertiseHeader": "Project Management",
  "projectManagementExpertiseDescription": "Delivery discipline so your software projects stay on scope, schedule, and quality.",
  "projectManagementOverview": "We apply proven project management practices—planning, tracking, risk and resource management—tailored to your team size and methodology. We keep projects visible and predictable so you can deliver on commitments and adapt when priorities change.",
  "projectManagementPoints": "Key Disciplines",
  "projectPlanning": "Project Planning",
  "projectPlanningDescription": "Scoped plans, milestones, and dependencies. We define clear deliverables and timelines so execution is predictable and aligned with business goals.",
  "resourceManagement": "Resource Management",
  "resourceManagementDescription": "Capacity planning and allocation across teams and sprints. We help balance workload and skills so delivery stays sustainable and on track.",
  "riskManagement": "Risk Management",
  "riskManagementDescription": "Identification, assessment, and mitigation of technical and project risks. We surface and address risks early so issues don’t derail delivery.",
  "qualityAssurance": "Quality Assurance",
  "qualityAssuranceDescription": "Quality gates, acceptance criteria, and release readiness. We ensure standards are met so releases are reliable and supportable.",
  "overview": "Overzicht",
  "privacyPolicyTitle": "Privacybeleid",
  "effectiveDate": "Ingangsdatum",
  "effectiveDateValue": "10/05/2024",
  "introduction": "Inleiding",
  "informationWeDoNotCollect": "Informatie Die We Niet Verzamelen",
  "informationCollectedByServers": "Informatie Verzameld Door Servers En Technologieën",
  "legalUse": "Wettig Gebruik",
  "limitationOfLiability": "Aansprakelijkheidsbeperking",
  "changesToPolicy": "Wijzigingen In Dit Privacybeleid",
  "privacyWelcomeMessage": "Welkom bij NeedleTails.com. Uw privacy is belangrijk voor ons.",
  "privacyPurpose": "Dit Privacybeleid beschrijft onze praktijken met betrekking tot het verzamelen van informatie wanneer u onze site bezoekt.",
  "personalInformation": "We verzamelen geen persoonlijke informatie van onze gebruikers.",
  "informationOverview": "Hoewel we geen persoonlijke informatie verzamelen, wees u ervan bewust dat servers en andere technologieën automatisch bepaalde informatie kunnen verzamelen.",
  "legalUseOverview": "Door onze site te gebruiken, gaat u akkoord met het naleven van alle toepasselijke lokale wetten en voorschriften.",
  "userResponsibility": "Het is uw verantwoordelijkheid om ervoor te zorgen dat uw gebruik van de site wettig is in uw rechtsgebied.",
  "privacyLimitationOverview": "De auteur van deze website kan niet aansprakelijk worden gesteld voor eventuele schade of verliezen die voortvloeien uit uw gebruik van de site.",
  "privacyUserAcknowledgment": "Door de site te gebruiken, erkent u dat u dit op eigen risico doet en dat de auteur niet verantwoordelijk is voor eventuele gevolgen die voortvloeien uit uw gebruik.",
  "privacyChangesToPolicy": "We kunnen ons Privacybeleid van tijd tot tijd bijwerken. We zullen u op de hoogte stellen van eventuele wijzigingen door het nieuwe Privacybeleid op deze pagina te plaatsen. U wordt geadviseerd om dit Privacybeleid periodiek te controleren op wijzigingen.",
  "cookies": "Cookies",
  "cookiesDescription": "Cookies kunnen worden gebruikt om de gebruikerservaring te verbeteren. Deze kunnen omvatten:",
  "sessionCookies": "Sessie Cookies: Tijdelijke cookies die verlopen wanneer u uw browser sluit.",
  "persistentCookies": "Persistente Cookies: Cookies die gedurende een bepaalde periode of tot verwijdering op uw apparaat blijven.",
  "analytics": "Analytics",
  "analyticsDescription": "We kunnen third-party analytics-diensten gebruiken die informatie verzamelen over website-gebruik, zoals:",
  "pageViews": "Paginaweergaven",
  "userInteractions": "Gebruikersinteracties",
  "trafficSources": "Verkeersbronnen",
  "serverLogs": "Server Logs",
  "serverLogsDescription": "Webservers kunnen informatie loggen over uw bezoek, inclusief:",
  "ipAddress": "IP-adres",
  "browserType": "Browsertype",
  "operatingSystem": "Besturingssysteem",
  "referringUrl": "Verwijzende URL",
  "pagesVisited": "Bezochte Pagina's",
  "timeAndDateOfAccess": "Tijd En Datum Van Toegang",
  "termsTitle": "Algemene Voorwaarden",
  "termsEffectiveDate": "Ingangsdatum: 10/05/2024",
  "userAgreement": "Gebruikersovereenkomst",
  "prohibitedActivities": "Verboden Activiteiten",
  "changesToTerms": "Wijzigingen In Deze Voorwaarden",
  "termsWelcomeMessage": "Welkom bij onze Algemene Voorwaarden.",
  "termsPurpose": "Deze voorwaarden regelen uw gebruik van onze diensten.",
  "userAgreementText": "Door onze diensten te gebruiken, gaat u akkoord met deze voorwaarden.",
  "prohibitedActivitiesOverview": "De volgende activiteiten zijn verboden:",
  "usingServiceForIllegalPurposes": "De dienst gebruiken voor illegale doeleinden.",
  "engagingInHarassment": "Deelnemen aan elke vorm van intimidatie of misbruik.",
  "unauthorizedAccess": "Pogingen om ongeautoriseerde toegang tot onze systemen te krijgen.",
  "distributingMalware": "Distribueren van kwaadaardige software of virussen.",
  "termsLimitationOverview": "We zijn niet aansprakelijk voor eventuele indirecte, incidentele of gevolgschade.",
  "termsUserAcknowledgment": "U erkent dat u onze diensten op eigen risico gebruikt.",
  "termsChangesToTerms": "We kunnen deze voorwaarden van tijd tot tijd bijwerken. Controleer ze regelmatig.",
  "spineTailedKitTitle": "PQSRTC",
  "spineTailedKitDescription": "PQSRTC heeft als doel een gestroomlijnd RTC-protocol in Swift te leveren, met post-quantumversleuteling als standaard. Het is een op WebRTC gebaseerd SDK dat zich richt op moderne, veilige en hoogpresterende spraak- en videoapplicaties voor zowel Android- als Apple-platformen, met gedeelde logica die in Swift is geschreven.",
  "needleTailKitTitle": "NeedleTailKit",
  "needleTailIRCTitle": "NeedleTailIRC",
  "needleTailIRCDescription": "Een moderne IRC-client bibliotheek voor Swift applicaties. NeedleTailIRC biedt een robuuste, type-veilige interface voor het verbinden met IRC-servers, het beheren van kanalen en het beheren van real-time communicatie. Gebouwd met Swift Concurrency voor optimale prestaties.",
  "connectionManagerKitTitle": "ConnectionManagerKit",
  "connectionManagerKitDescription": "Een uitgebreid connection management framework voor Swift applicaties. ConnectionManagerKit vereenvoudigt netwerkconnectiviteit, connection pooling en connection lifecycle management. Perfect voor applicaties die betrouwbare netwerkcommunicatie nodig hebben.",
  "postQuantumSolaceTitle": "PostQuantumSolace",
  "postQuantumSolaceDescription": "Een post-quantum cryptografie bibliotheek voor Swift applicaties. PostQuantumSolace biedt quantum-resistente cryptografische algoritmes en protocollen, waardoor je applicaties veilig blijven in het quantum computing tijdperk.",
  "needleTailKitDescription": "Wat is NeedleTailKit? NTK is de core SDK voor NeedleTail Client en Server Applications, die de creatie van prachtige end-to-end versleutelde applicaties mogelijk maakt. Het kan worden gebruikt voor verschillende applicaties naast messaging. Geïnteresseerd? Neem contact met ons op om meer te weten te komen!",
  "whiteTippedSocketsTitle": "White Tipped Sockets",
  "whiteTippedSocketsDescription": "WhiteTippedSockets is een native WebSocket-bibliotheek voor iOS en macOS, gebouwd op de Network.framework API met Swift Concurrency. Ons doel is om een moderne, efficiënte oplossing te bieden voor WebSocket-communicatie, en we plannen ook om in de toekomst een volledig functionele, schaalbare server te ontwikkelen.",
  "swiftHlsTitle": "Swift HLS",
  "swiftHlsDescription": "HTTP Live Streaming (HLS) is een belangrijke technologie voor efficiënte mediastreaming, en SwiftHLS is ontworpen om dit te faciliteren. Door gebruik te maken van hetzelfde protocol dat het web aandrijft, stelt HLS content delivery mogelijk via REST API's en CDN's. Het doel is om betrouwbaarheid te bieden en zich dynamisch aan te passen aan netwerkcondities.",
  "swiftIapTitle": "Swift IAP",
  "swiftIapDescription": "SwiftIAP is een uitgebreide In-App Purchase bibliotheek voor iOS en macOS applicaties. Het biedt een moderne, type-veilige interface voor het afhandelen van in-app aankopen, abonnementen en receipt validatie. Gebouwd met Swift Concurrency en ontworpen voor gebruiksgemak.",
  "stompTitle": "Stomp",
  "stompDescription": "Stomp is een Swift-bibliotheek voor STOMP-protocol communicatie. Het biedt een moderne, type-veilige interface voor het verbinden met STOMP-servers en het afhandelen van berichtrouting. Perfect voor applicaties die betrouwbare messaging-infrastructuur nodig hebben.",
  "privacy": "Privacybeleid",
  "termsConditions": "Algemene Voorwaarden",
  "projectTitle_1": "Projecten",
  "projectHeader_1": "PQSRTC",
  "projectTitleText_1": "RTC VoIP Oplossing",
  "projectTitle_2": "Projecten",
  "projectHeader_2": "NeedleTailKit",
  "projectTitleText_2": "End-to-End Versleutelde Messaging Oplossing",
  "projectTitle_3": "Projecten",
  "projectHeader_3": "White Tipped Sockets",
  "projectTitleText_3": "Swift Concurrent Network.framework Wrapper",
  "projectTitle_4": "Projecten",
  "projectHeader_4": "Swift Stomp",
  "projectTitleText_4": "Swift Concurrent STOMP Protocol",
  "projectTitle_5": "Projecten",
  "projectHeader_5": "Swift HLS",
  "projectTitleText_5": "Swift HLS Project",
  "pageNotFound": "Pagina Niet Gevonden",
  "pageNotFoundDescription": "De pagina die u zoekt bestaat niet of is verplaatst. Laten we u weer op het juiste spoor krijgen.",
  "goHome": "Ga Naar Home",
  "goBack": "Ga Terug",
  "contact": "Contact",
  "contactUs": "Neem Contact Met Ons Op",
  "becomeASponsor": "Word Een Sponsor",
  "supportOpenSourceMessage": "Ondersteun onze open source projecten en help ons om door te gaan met het bouwen van geweldige software.",
  "getStartedOnDigitalOcean": "Begin op Digital Ocean met een $100, 60-daagse krediet voor nieuwe gebruikers.",
  "readyToGetStarted": "Klaar Om Te Beginnen?",
  "letsDiscussProject": "Laten we uw project bespreken en kijken hoe we kunnen helpen om uw ideeën tot leven te brengen met Swift-aangedreven oplossingen.",
  "backToTop": "Terug Naar Boven",
  "needleTailsCopyright": "NeedleTails©",
  "pointsForConsideration": "Punten Voor Overweging",
  "responsiveDesign": "Responsive & Adaptive Design",
  "responsiveDesignDescription": "Layouts and components that adapt to all viewports and devices. We deliver consistent, high-quality experiences on desktop, tablet, and mobile so your web product works everywhere your users are.",
  "crossBrowserCompatibility": "Cross-Browser & Standards Compliance",
  "crossBrowserCompatibilityDescription": "Testing and compatibility across major browsers and standards. We ensure consistent behavior and appearance so your application works reliably for every user, regardless of browser or device.",
  "webPerformanceOptimizationDescription": "Performance budgets, lazy loading, and optimized assets. We minimize load times and resource usage through efficient code, caching, and CDN strategies so your site feels fast and remains cost-effective at scale.",
  "userExperience": "User Experience & Accessibility",
  "userExperienceDescription": "Clear information architecture, intuitive navigation, and WCAG-aligned accessibility. We design and implement UX that drives engagement and meets enterprise usability and compliance expectations.",
  "securityPractices": "Security & Data Protection",
  "securityPracticesDescription": "HTTPS, secure headers, input validation, and protection against OWASP-top risks including XSS and CSRF. We harden web applications so your data and your users stay secure in production.",
  "seoBestPractices": "SEO & Discoverability",
  "seoBestPracticesDescription": "Semantic structure, meta tags, and content strategy aligned with search best practices. We optimize for discoverability and ranking so your web presence supports your business and marketing goals.",
  "backendSolutionsHeader": "Server-Side Solutions",
  "backendSolutionsDescription": "We design and deliver production-grade backends that power your business. Our server-first approach ensures APIs, data pipelines, and integrations are built for reliability, compliance, and scale—so your applications perform under real-world load and security requirements.",
  "backendCapabilitiesOverview": "Our server-side practice is built on Swift (Vapor, Hummingbird, SwiftNIO) and proven cloud-native patterns. We deliver secure, high-performance backends—REST and custom APIs, event-driven systems, and seamless integration with your existing stack. From architecture through deployment and observability, we own the full lifecycle so your teams can focus on product, not infrastructure.",
  "scalability": "Scalability & Resilience",
  "scalabilityDescription": "Architectures designed for growth: horizontal scaling, stateless services, and resilient patterns. We apply microservices, serverless, and queue-based designs so your backend handles traffic spikes and data growth without rework.",
  "security": "Security & Compliance",
  "securityDescription": "Robust security by default: encryption at rest and in transit, identity and access control, audit trails, and alignment with common compliance frameworks. We harden backends so your data and your users stay protected.",
  "maintainability": "Maintainability & Standards",
  "maintainabilityDescription": "Clean, modular, and well-documented codebases with consistent patterns and version control. We adopt and document coding standards so your team can maintain and extend the system with confidence.",
  "testingAndQualityAssurance": "Testing & Quality Assurance",
  "testingAndQualityAssuranceDescription": "Rigorous testing strategies: unit, integration, and contract tests with CI/CD automation. We maintain high quality and regression safety so releases are predictable and low-risk.",
  "monitoringAndLogging": "Monitoring & Observability",
  "monitoringAndLoggingDescription": "Production-ready observability: structured logging, metrics, and alerting. We instrument backends so you have clear visibility into health, performance, and incidents—and can respond before users are affected.",
  "nativeAppDevelopmentHeader": "Native Application Development",
  "nativeAppDevelopmentDescription": "We deliver native applications built for performance, security, and great user experience—on every platform your business requires.",
  "nativeAppDevelopmentOverview": "We build production-ready native apps for the full Apple ecosystem (iOS, iPadOS, macOS, tvOS, watchOS, visionOS) and Android. Our work emphasizes type-safe Swift and Kotlin/Java, platform-appropriate UX, accessibility, and security-by-design. From MVPs to large-scale deployments, we handle architecture, store readiness, and ongoing support so your apps stay performant, compliant, and maintainable.",
  "designConsistency": "Design Systems & Consistency",
  "designConsistencyDescription": "Unified design systems and component libraries across platforms. We ensure consistent branding, interaction patterns, and accessibility so your product feels cohesive on every device.",
  "deviceFragmentation": "Device & Platform Coverage",
  "deviceFragmentationDescription": "Structured testing across device matrices, screen sizes, and OS versions. We validate behavior and performance so your app works reliably for all target users, including edge cases.",
  "userExperienceUX": "User Experience & Accessibility",
  "userExperienceUXDescription": "Intuitive flows, clear information architecture, and WCAG-aligned accessibility. We design and implement UX that serves all users and supports usability and compliance goals.",
  "distributionCompliance": "Distribution & Store Compliance",
  "distributionComplianceDescription": "App Store and Play Store readiness: guidelines, privacy labels, and review best practices. We prepare and maintain your apps for public and private distribution channels.",
  "webDevelopmentExpertiseHeader": "Web Application Development",
  "webDevelopmentExpertiseDescription": "We build and maintain web applications that support your business goals—from marketing sites and portals to full-stack web apps that integrate with your existing systems.",
  "webDevelopmentOverview": "We deliver production-grade web experiences: responsive sites, SPAs, and full-stack applications built with Vue.js, Nuxt, and TypeScript on the front end, and Vapor, Hummingbird, or your preferred backend. Our work covers corporate sites, customer portals, internal tools, and public-facing apps—with a focus on performance, security, SEO, and maintainability so your web presence scales with your organization.",
  "solutionsTitle": "Onze Oplossingen",
  "featuredApplications": "Uitgelichte Applicaties",
  "our": "Onze",
  "featuredApps": "Uitgelichte Apps",
  "featuredAppsDescription": "Ontdek onze innovatieve applicaties die de kracht van Swift-ontwikkeling en moderne software-architectuur tonen.",
  "nudgeTitle": "Secure Messaging You Control",
  "nudgeDescription": "End-to-end encrypted messaging with optional self-hosting. Your data stays yours—no third-party storage, no persistence risk. Run your own instance or scale globally.",
  "islandHoppersTitle": "Island Hoppers: Je Ultieme Tour App voor Naadloze Avonturen!",
  "islandHoppersDescription": "Island Hoppers is de all-in-one app die is ontworpen om je reiservaring te verbeteren, of je nu een bedrijf bent dat onvergetelijke tours organiseert of een klant die de perfecte vakantie zoekt. Voor bedrijven stroomlijnt onze app het hele tourmanagementproces. Organiseer en pas je tours moeiteloos aan, communiceer rechtstreeks met tourgidsen en houd je klanten op de hoogte met real-time updates. Met Island Hoppers kun je boekingen beheren, klantvoorkeuren bijhouden en ervoor zorgen dat elk detail wordt verzorgd, zodat je je kunt concentreren op het leveren van buitengewone ervaringen. Voor klanten biedt Island Hoppers een diverse reeks tourpakketten die zijn afgestemd op verschillende groepssoorten, inclusief gezinnen, rugzakreizigers en feestliefhebbers. Blader door onze gecureerde selectie van avonturen, kies het perfecte pakket dat bij je stijl past en maak contact met gelijkgestemde reizigers. Geniet van naadloze communicatie met je tourgidsen, krijg toegang tot essentiële informatie en ontvang gepersonaliseerde aanbevelingen om het meeste uit je reis te halen. Met Island Hoppers ga je met gemak en vertrouwen op onvergetelijke avonturen, wetende dat elk aspect van je tour slechts een tik verwijderd is!",
  "streamStackTitle": "Een Educatief Platform voor je Software Oplossingen",
  "streamStackDescription": "Stream, Lees, Bespreek. Of je nu nieuw bent in programmeren of wilt lezen over verschillende software-oplossingen, we maken het je gemakkelijk met onze door Vapor ondersteunde Nuxt-app. Blijf op de hoogte van de nieuwste coding trends.",
  "welcomeToNeedleTails": "Welkom bij NeedleTails - Uw Bondgenoot in Softwareontwikkeling",
  "accept": "Ik ga akkoord en accepteer",
  "cookieConsentTitle": "We gebruiken browseropslag",
  "cookieConsentMessage": "We gebruiken browseropslag om uw taalvoorkeur te onthouden en uw browse-ervaring te verbeteren. Door op 'Alles accepteren' te klikken, stemt u in met ons gebruik van browseropslag.",
  "cookieConsentAcceptAll": "Alles accepteren",
  "cookieConsentAcceptNecessary": "Alleen noodzakelijke",
  "cookieConsentReject": "Alles weigeren",
  "cookieConsentLearnMore": "Meer informatie",
  "cookieConsentNecessary": "Noodzakelijke opslag omvat taalherkenning om inhoud in uw voorkeurstaal te leveren.",
  "cookieConsentAnalytics": "We gebruiken momenteel geen analytische tracking op deze website.",
  "cookieConsentPreferences": "Voorkeursopslag onthoudt uw instellingen zoals thema en gebruikersvoorkeuren om uw ervaring te personaliseren.",
  "cookieConsentMarketing": "We gebruiken momenteel geen marketing tracking of advertenties op deze website.",
  "brewhubWidgetTitle": "BrewHub",
  "brewhubWidgetDescription": "Professioneel platform voor softwareontwikkelingscursussen en -instructie. Toegang tot begeleide, live training met productieklasse tools en workflows om uw ontwikkelingsvaardigheden te verbeteren.",
  "brewhubWidgetCTA": "Training Cursussen",
  "brewhubComingSoonTitle": "Beschikbaar",
  "brewhubComingSoonDescription": "BrewHub is nu beschikbaar. Bezoek brewhub.needletails.com voor professionele cursussen en training in softwareontwikkeling.",
  "brewhubFeature1Title": "Expertcursussen",
  "brewhubFeature1Description": "Krijg toegang tot professionele softwareontwikkelingscursussen gegeven door experts uit de industrie.",
  "brewhubFeature2Title": "Live training",
  "brewhubFeature2Description": "Live training één-op-één of in kleine groepen met directe begeleiding van experts.",
  "brewhubFeature3Title": "Community",
  "brewhubFeature3Description": "Word lid van een community van ontwikkelaars en leer samen.",
  "brewhubFeature4Title": "Productietools",
  "brewhubFeature4Description": "Leer met dezelfde tools en workflows die in productieomgevingen worden gebruikt.",
  "brewhubBackToMainSite": "Ga naar BrewHub",
  "brewhubMetaTitle": "BrewHub | NeedleTails",
  "brewhubMetaDescription": "BrewHub is het platform van NeedleTails voor professionele cursussen en training in softwareontwikkeling.",
  "brewhubOgDescription": "Professionele cursussen en training in softwareontwikkeling.",
  "brewhubLogoAlt": "BrewHub-logo",
  "needletailKitTitle": "NeedleTailKit",
  "needletailKitSubtitle": "Een uitgebreide, productieklare Swift SDK voor het bouwen van veilige, end-to-end versleutelde berichtenapplicaties met beveiligingsfuncties op bedrijfsniveau.",
  "needletailKitPrivateBadge": "Privé SDK - Licentie Vereist",
  "needletailKitRequestLicense": "Licentie Aanvragen",
  "needletailKitExploreFeatures": "Functies Verkennen",
  "needletailKitFeaturesTitle": "Functies op Bedrijfsniveau",
  "needletailKitFeaturesDescription": "Gebouwd voor productie met geavanceerde beveiliging en moderne Swift-architectuur.",
  "needletailKitSecurityTitle": "Bedrijfsbeveiliging",
  "needletailKitSecurityPQ": "Post-Kwantum Cryptografie - Toekomstbestendig tegen kwantumaanvallen",
  "needletailKitSecurityDoubleRatchet": "Double Ratchet Protocol - Perfecte voorwaartse geheimhouding",
  "needletailKitSecurityE2E": "End-to-End Versleuteling - Alle berichten standaard versleuteld",
  "needletailKitSecurityDeviceVerification": "Apparaatverificatie - Cryptografische apparaatkoppeling",
  "needletailKitPlatformTitle": "Multi-Platform Ondersteuning",
  "needletailKitPlatformIOS": "iOS 18.0+ - Volledige native iOS-ondersteuning",
  "needletailKitPlatformMacOS": "macOS 15.0+ - Volledige macOS-integratie",
  "needletailKitPlatformSwift6": "Swift 6.0+ - Nieuwste taal functies",
  "needletailKitPlatformAsync": "Async/Await - Moderne gelijktijdigheid overal",
  "needletailKitTransportTitle": "Intelligent Transport",
  "needletailKitTransportMulti": "Multi-Transport Routing - Automatische padselectie",
  "needletailKitTransportP2P": "Lokaal Netwerk P2P - Directe apparaatcommunicatie",
  "needletailKitTransportDCC": "DCC Protocol - IRC-gebaseerd P2P met TLS",
  "needletailKitTransportFailover": "Automatische Failover - Naadloze transportwisseling",
  "needletailKitMessagingTitle": "Rijke Berichten",
  "needletailKitMessagingText": "Tekstberichten - Eenvoudige, veilige communicatie",
  "needletailKitMessagingMedia": "Mediaberichten - Afbeeldingen, video's, documenten",
  "needletailKitMessagingSelfDestruct": "Zelfvernietigende Berichten - Tijdelijke ondersteuning",
  "needletailKitMessagingEdit": "Berichtbewerking - Verzonden berichten bewerken",
  "needletailKitVoiceVideoTitle": "Spraak- en Videogesprekken",
  "needletailKitVoiceVideoWebRTC": "WebRTC Integratie - Hoge kwaliteit gesprekken",
  "needletailKitVoiceVideoSTUN": "STUN/TURN Ondersteuning - NAT traversie",
  "needletailKitVoiceVideoCallManagement": "Gespreksbeheer - Volledige levenscyclusbehandeling",
  "needletailKitEnterpriseTitle": "Bedrijfsgereed",
  "needletailKitEnterpriseProduction": "Productiegereed - Getest in echte applicaties",
  "needletailKitEnterpriseSupport": "Bedrijfsondersteuning - Professionele ondersteuning beschikbaar",
  "needletailKitEnterpriseCompliance": "Naleving - Gebouwd voor regelgevingsnaleving",
  "needletailKitEnterpriseScalability": "Schaalbaarheid - Ontworpen voor grootschalige implementaties",
  "needletailKitQuickStartTitle": "Quick Start",
  "needletailKitQuickStartDescription": "Get started with NeedleTailKit in minutes. Follow these simple steps to integrate secure messaging into your application.",
  "needletailKitInstallTitle": "Installation",
  "needletailKitInstallCode": "dependencies: [\n    .package(url: \"https://github.com/needletails/needle-tail-kit.git\", from: \"1.0.0\")\n]",
  "needletailKitInitializeTitle": "Initialize Session",
  "needletailKitInitializeCode": "import NeedleTailKit\n\nlet session = NeedleTailSession.shared\ntry await session.createNewUserAccount(\n    authInfo: authInfo,\n    store: store,\n    eventObserver: eventObserver\n)",
  "needletailKitSendMessageTitle": "Send Your First Message",
  "needletailKitSendMessageCode": "let contact = try await session.createContact(contact: \"bob\")\ntry await session.sendMessage(\n    messageType: .text,\n    recipient: .nickname(\"bob\"),\n    text: \"Hello, World!\"\n)",
  "needletailKitContactTitle": "Licentie Aanvragen",
  "needletailKitContactDescription": "NeedleTailKit is een propriëtaire, closed-source SDK. Neem contact met ons op om licentie-opties voor uw project te bespreken.",
  "needletailKitContactButton": "Contact voor Licentie",
  "needletailKitMetaTitle": "NeedleTailKit - Enterprise Veilige Berichten SDK | NeedleTails",
  "needletailKitMetaDescription": "Productieklare Swift SDK voor het bouwen van veilige, end-to-end versleutelde berichtenapplicaties. Post-kwantum cryptografie, multi-platform ondersteuning en beveiliging op bedrijfsniveau.",
  "needletailKitOgDescription": "Productieklare Swift SDK voor veilige berichten met beveiligingsfuncties op bedrijfsniveau.",
  "needletailKitLogoAlt": "NeedleTailKit Logo",
  "needletailKitPlatformAndroid": "Android: API 24 (Android 7.0) of later",
  "nudgeWidgetTitle": "Veilig met Nudge",
  "nudgeWidgetDescription": "Optioneel zelfgemonitord, end-to-end versleutelde berichten met volledige gegevenscontrole.",
  "nudgeWidgetCTA": "Meer Informatie",
  "nudgeWidgetLogoAlt": "Nudge Logo",
  "nudgeFeature1Title": "End-to-End Encryption",
  "nudgeFeature1Description": "Every message encrypted by default. Full privacy.",
  "nudgeFeature2Title": "Your Data, Your Rules",
  "nudgeFeature2Description": "Optional self-hosting. No external data storage.",
  "nudgeFeature3Title": "Secure Channels",
  "nudgeFeature3Description": "Private messaging built for security.",
  "nudgeFeature4Title": "Global or Self-Hosted",
  "nudgeFeature4Description": "Scale globally or run your own instance—no data persistence risk.",
  "nudgeContactButton": "Bekijk Nudge",
  "nudgeMetaTitle": "Nudge - Veilige End-to-End Versleutelde Berichten | NeedleTails",
  "nudgeMetaDescription": "Optioneel zelfgemonitorde, end-to-end versleutelde berichtenapplicatie met volledige gegevenscontrole. Veilige communicatie zonder risico's op gegevenspersistentie.",
  "nudgeOgDescription": "Optioneel zelfgemonitorde, end-to-end versleutelde berichten met volledige gegevenscontrole en beveiliging op bedrijfsniveau.",
  "nudgeMetaKeywords": "Nudge, veilige berichten, end-to-end versleuteling, versleutelde berichtenapp, optioneel zelfgemonitorde berichten, privéberichten, veilige communicatie, gegevensprivacy, berichtenbeveiliging, versleutelde chat, veilige chat-app, privacygerichte berichten",
  "brewhubMetaKeywords": "BrewHub, softwareontwikkelingscursussen, programmeercursussen, ontwikkelaarstraining, software-educatie, codeercursussen, ontwikkelingshandleidingen, technische training, software-leerplatform, programmeerhandleidingen, webontwikkelingscursussen, mobiele ontwikkelingscursussen, backend-ontwikkelingsopleiding",
  "needletailKitMetaKeywords": "NeedleTailKit, Swift SDK, end-to-end versleuteling, veilige berichten, iOS SDK, macOS SDK, Android SDK, post-quantum cryptografie",
  "heroTagline": "Wij lossen uw uitdagingen op—apps, websites en geïntegreerde softwareoplossingen.",
  "managementPageLabel": "Management",
  "managementPageTitle": "Product & Project Delivery",
  "managementPageLead": "We align vision, roadmap, and execution so your software projects stay on scope, schedule, and quality.",
  "managementCtaLead": "Ready to align your next project?",
  "consultationPageLabel": "Consultation",
  "consultationCtaLead": "Tell us about your goals and we'll outline a clear path forward."
}
