{
  "introHeaderTwo": "Você tem a visão; nós entregamos a solução. Seja um app móvel, um site moderno ou um sistema de software completo, transformamos seus desafios em produtos confiáveis e seguros. Com experiência enterprise em Mobile, Web e Servidor, construímos e integramos soluções que escalam—para você focar no seu negócio.",
  "menuItemOne": "Cursos",
  "menuItemTwo": "Consultoria",
  "menuItemThree": "Gestão",
  "getInTouch": "Entre em Contato",
  "projectsHeader": "Nosso Software",
  "projectsDescription": "Somos dedicados a fornecer uma ampla gama de software de código aberto. Para apoiar esta missão, também oferecemos alguns softwares proprietários. Convidamos você a explorar nossos projetos, que incluem opções de código aberto e proprietárias. Se você estiver interessado em contribuir ou obter uma licença para nosso software proprietário, não hesite em entrar em contato conosco.",
  "projectsOverview": "Aqui está uma lista do que fazemos e do que já fizemos",
  "businessOverviewTitle": "Especialistas em Software Swift",
  "badgeMobile": "Mobile",
  "badgeWeb": "Web",
  "badgeServer": "Servidor",
  "businessOverviewDescription": "Transformamos seus desafios de software mais difíceis em soluções prontas para produção. Seja um novo app, um site moderno ou sistemas que se integram perfeitamente, entregamos em Mobile, Web e Servidor—na linguagem certa para o seu projeto. Nossa expertise em Swift traz segurança de tipos, performance e confiabilidade; também integramos com sua stack existente. Parceiro conosco para soluções feitas para durar e escalar com seu negócio.",
  "serviceHeaderBackendDevelopment": "Backend e APIs",
  "serviceDescriptionBackendDevelopment": "Resolva desafios de escalabilidade e integração com soluções robustas no servidor. Construímos e conectamos APIs, bancos de dados e serviços para seus apps e sites rodarem com confiabilidade em qualquer escala.",
  "serviceHeaderMobileAppDevelopment": "Apps Móveis",
  "serviceDescriptionMobileAppDevelopment": "Tenha um app nativo que os usuários amam. Desenvolvemos apps iOS, Android e multiplataforma que resolvem problemas reais—no prazo e prontos para a loja.",
  "serviceHeaderTraining": "BrewHub",
  "serviceDescriptionTraining": "Capacite sua equipe com cursos profissionais de desenvolvimento de software. Treinamento ao vivo guiado com ferramentas de nível produção para você construir e manter soluções internamente.",
  "serviceHeaderWebDevelopment": "Desenvolvimento Web",
  "serviceDescriptionWebDevelopment": "Sites e aplicações web que funcionam em todo lugar. Entregamos experiências responsivas, rápidas e seguras que atraem usuários e apoiam os objetivos do seu negócio.",
  "openSourceHeader": "Código Aberto",
  "openSourceDescription": "Acreditamos no poder do código aberto. Explore nossos projetos no GitHub e contribua para a comunidade. Seu apoio nos ajuda a continuar desenvolvendo soluções inovadoras.",
  "whyChooseSwift": "Por que Escolher Swift?",
  "typeSafety": "Segurança de Tipos",
  "typeSafetyDescription": "O sistema de tipos do Swift previne erros em tempo de compilação, garantindo que suas aplicações sejam robustas e confiáveis desde o primeiro dia.",
  "performance": "Performance",
  "performanceDescription": "Baixa pegada de memória e alta performance tornam o Swift ideal para ambientes com recursos limitados e aplicações exigentes.",
  "threadSafety": "Segurança de Threads",
  "threadSafetyDescription": "Suporte integrado à concorrência garante que suas aplicações lidem com múltiplas tarefas eficientemente sem condições de corrida.",
  "ourServices": "Como Resolvemos Seus Desafios",
  "servicesDescription": "Do conceito ao lançamento e além, entregamos os apps, sites e integrações de que você precisa. Conte-nos seu desafio—desenhamos, construímos e damos suporte à solução.",
  "startYourProject": "Inicie Seu Projeto",
  "swiftNative": "Nativo",
  "support": "Suporte",
  "possibilities": "Possibilidades",
  "makingYour": "Tornando Suas",
  "ideasReality": "Ideias em Realidade",
  "swiftSoftwareSpecialists": "Especialistas em Software Swift",
  "swift": "Swift",
  "swiftServer": "Swift-Server",
  "frequentlyAskedQuestions": "Perguntas Frequentes",
  "faqDescription": "Obtenha respostas para perguntas comuns sobre nossos serviços de desenvolvimento de software",
  "faqTechnologies": "Em quais tecnologias vocês se especializam?",
  "faqTechnologiesAnswer": "Nos especializamos em desenvolvimento web moderno usando uma ampla gama de tecnologias incluindo, mas não limitado a Nuxt, Vue, Vapor e SwiftNIO. Nossa expertise em linguagens inclui TypeScript e Swift. Também trabalhamos com soluções robustas de backend, serviços em nuvem, APIs e arquitetura escalável para entregar aplicações de alta performance.",
  "faqTimeline": "Quanto tempo leva um projeto típico?",
  "faqTimelineAnswer": "Os cronogramas dos projetos variam com base na complexidade. Aplicações web simples levam 4-8 semanas, enquanto soluções empresariais complexas podem levar 3-6 meses. Fornecemos cronogramas detalhados durante a consultoria.",
  "faqSupport": "Vocês fornecem suporte e manutenção contínuos?",
  "faqSupportAnswer": "Sim, oferecemos pacotes abrangentes de suporte incluindo monitoramento 24/7, atualizações regulares, patches de segurança e melhorias de recursos para garantir que sua aplicação permaneça atual e segura.",
  "faqProcess": "Qual é o seu processo de desenvolvimento?",
  "faqProcessAnswer": "Seguimos uma abordagem colaborativa com comunicação regular com o cliente, desenvolvimento iterativo e testes contínuos. Nosso processo inclui fases de planejamento, design, desenvolvimento, testes e implantação.",
  "faqIntegration": "Vocês podem trabalhar com sistemas e APIs existentes?",
  "faqIntegrationAnswer": "Absolutamente! Temos extensa experiência integrando com sistemas existentes, APIs e bancos de dados. Podemos aprimorar, modernizar ou reconstruir completamente sua infraestrutura atual.",
  "faqSecurity": "E sobre segurança e proteção de dados?",
  "faqSecurityAnswer": "A segurança é o padrão em tudo que construímos. Implementamos práticas de desenvolvimento de software orientadas à segurança, medidas de segurança padrão da indústria, criptografia de dados e auditorias regulares de segurança para proteger seus dados e as informações de seus usuários.",
  "consultingTitle": "Seus desafios, nossa expertise",
  "consultingOverview": "Seja definindo um novo produto, modernizando sistemas legados ou escolhendo stack e arquitetura—oferecemos orientação estruturada para que suas decisões sejam informadas pela experiência e alinhadas aos seus objetivos.",
  "consultWithUs": "Fale conosco sobre sua iniciativa",
  "consultingWithUsMessage": "Compartilhe objetivos, restrições e prazo. Esboçamos opções, trade-offs e um caminho claro—incluindo escopo, tecnologia e o que é preciso para chegar lá.",
  "whatToConsultAbout": "Com o que podemos ajudar",
  "architectureDesign": "Arquitetura e design de sistemas",
  "architectureDesignDescription": "Arquiteturas escaláveis e mantíveis para sistemas novos e existentes. Ajudamos a escolher padrões, limites e abordagens de integração.",
  "technologySelection": "Tecnologia e escolha de stack",
  "technologySelectionDescription": "Avaliação objetiva de tecnologias e fornecedores conforme requisitos, habilidades da equipe e manutenibilidade de longo prazo.",
  "performanceOptimization": "Performance e escalabilidade",
  "performanceOptimizationDescription": "Tempos de resposta, throughput e uso de recursos. Aplicamos cache, balanceamento de carga, otimização de consultas e planejamento de capacidade.",
  "securityReview": "Revisão de segurança e conformidade",
  "securityReviewDescription": "Postura de segurança e alinhamento com regulamentações. Avaliamos design e implementação contra ameaças e frameworks comuns.",
  "codeReview": "Revisão de código e implementação",
  "codeReviewDescription": "Revisão especializada de qualidade de código, padrões e dívida técnica. Fornecemos feedback acionável.",
  "bestPractices": "Processo e boas práticas",
  "bestPracticesDescription": "Processo de desenvolvimento, DevOps e práticas de entrega. Ajudamos a adotar fluxos que melhoram previsibilidade, qualidade e eficiência da equipe.",
  "trainingProgramsHeader": "Programas de Treinamento",
  "trainingProgramsDescription": "Soluções de desenvolvimento profissional e treinamento",
  "trainingOverview": "Programas abrangentes de treinamento para aprimorar as habilidades da sua equipe",
  "trainingCourses": "Cursos de Treinamento",
  "vueJsDevelopment": "Desenvolvimento Vue.js",
  "vueJsDevelopmentDescription": "Aprenda práticas modernas de desenvolvimento Vue.js com Nuxt",
  "swiftBackendDevelopment": "Desenvolvimento Backend Swift",
  "swiftBackendDevelopmentDescription": "Domine o desenvolvimento backend Swift com Vapor e SwiftNIO",
  "typescriptDevelopment": "Desenvolvimento TypeScript",
  "typescriptDevelopmentDescription": "Construa aplicações robustas com TypeScript",
  "securityFirstDevelopment": "Desenvolvimento Segurança-Primeiro",
  "securityFirstDevelopmentDescription": "Implemente práticas de desenvolvimento de software orientadas à segurança",
  "productManagementExpertiseHeader": "Gestão de produto",
  "productManagementExpertiseDescription": "Gestão de produto estruturada para alinhar visão, roadmap e entrega com resultados de negócio.",
  "productManagementOverview": "Apoiamos organizações orientadas a produto com descoberta, priorização e práticas de ciclo de vida. Dos requisitos e insight de mercado à UX e planejamento de roadmap.",
  "productManagementPoints": "Disciplinas-chave",
  "requirementsGathering": "Requisitos e descoberta",
  "requirementsGatheringDescription": "Elaboração e documentação estruturadas de requisitos funcionais e não funcionais.",
  "marketResearch": "Pesquisa de mercado e usuários",
  "marketResearchDescription": "Compreensão baseada em evidências de usuários, concorrentes e fit de mercado.",
  "userExperienceDesign": "Design de experiência do usuário",
  "userExperienceDesignDescription": "Fluxos centrados no usuário, arquitetura de informação e design de interação.",
  "productStrategy": "Estratégia de produto",
  "productStrategyDescription": "Visão, posicionamento e roadmap alinhados aos objetivos de negócio.",
  "featurePrioritization": "Priorização de funcionalidades",
  "featurePrioritizationDescription": "Priorização baseada em frameworks (valor, esforço, risco). Ajudamos a decidir o que construir em seguida.",
  "stakeholderManagement": "Gestão de partes interessadas",
  "stakeholderManagementDescription": "Comunicação clara, expectativas e alinhamento com partes interessadas internas e externas.",
  "projectManagementExpertiseHeader": "Gestão de projetos",
  "projectManagementExpertiseDescription": "Disciplina de entrega para que seus projetos de software mantenham escopo, prazo e qualidade.",
  "projectManagementOverview": "Aplicamos práticas comprovadas de gestão de projetos—planejamento, acompanhamento, gestão de riscos e recursos—adaptadas ao tamanho e metodologia da sua equipe.",
  "projectManagementPoints": "Disciplinas-chave",
  "projectPlanning": "Planejamento de projeto",
  "projectPlanningDescription": "Escopo, marcos e dependências. Definimos entregas e prazos claros.",
  "resourceManagement": "Gestão de recursos",
  "resourceManagementDescription": "Planejamento e alocação de capacidade entre equipes e sprints.",
  "riskManagement": "Gestão de riscos",
  "riskManagementDescription": "Identificação, avaliação e mitigação de riscos técnicos e de projeto.",
  "qualityAssurance": "Garantia de qualidade",
  "qualityAssuranceDescription": "Critérios de qualidade, critérios de aceitação e prontidão para release.",
  "overview": "Visão Geral",
  "privacyPolicyTitle": "Política de Privacidade",
  "effectiveDate": "Data de Efetivação",
  "effectiveDateValue": "10/05/2024",
  "introduction": "Introdução",
  "informationWeDoNotCollect": "Informações que Não Coletamos",
  "informationCollectedByServers": "Informações Coletadas por Servidores e Tecnologias",
  "legalUse": "Uso Legal",
  "limitationOfLiability": "Limitação de Responsabilidade",
  "changesToPolicy": "Mudanças nesta Política de Privacidade",
  "privacyWelcomeMessage": "Bem-vindo ao NeedleTails.com. Sua privacidade é importante para nós.",
  "privacyPurpose": "Esta Política de Privacidade descreve nossas práticas em relação à coleta de informações quando você visita nosso site.",
  "personalInformation": "Não coletamos nenhuma informação pessoal de nossos usuários.",
  "informationOverview": "Embora não coletemos informações pessoais, esteja ciente de que servidores e outras tecnologias podem coletar certas informações automaticamente.",
  "legalUseOverview": "Ao usar nosso Site, você concorda em cumprir todas as leis e regulamentos locais aplicáveis.",
  "userResponsibility": "É sua responsabilidade garantir que seu uso do Site seja legal em sua jurisdição.",
  "privacyLimitationOverview": "O autor deste website não será responsabilizado por quaisquer danos ou perdas decorrentes do seu uso do Site.",
  "privacyUserAcknowledgment": "Ao usar o Site, você reconhece que o faz por sua conta e risco e que o autor não é responsável por quaisquer consequências resultantes do seu uso.",
  "privacyChangesToPolicy": "Podemos atualizar nossa Política de Privacidade de tempos em tempos. Notificaremos você sobre quaisquer mudanças publicando a nova Política de Privacidade nesta página. Você é aconselhado a revisar esta Política de Privacidade periodicamente para quaisquer mudanças.",
  "cookies": "Cookies",
  "cookiesDescription": "Cookies podem ser usados para melhorar a experiência do usuário. Estes podem incluir:",
  "sessionCookies": "Cookies de Sessão: Cookies temporários que expiram quando você fecha seu navegador.",
  "persistentCookies": "Cookies Persistentes: Cookies que permanecem em seu dispositivo por um período definido ou até serem excluídos.",
  "analytics": "Analytics",
  "analyticsDescription": "Podemos usar serviços de analytics de terceiros que coletam informações sobre o uso do website, como:",
  "pageViews": "Visualizações de Página",
  "userInteractions": "Interações do Usuário",
  "trafficSources": "Fontes de Tráfego",
  "serverLogs": "Logs do Servidor",
  "serverLogsDescription": "Servidores web podem registrar informações sobre sua visita, incluindo:",
  "ipAddress": "Endereço IP",
  "browserType": "Tipo de Navegador",
  "operatingSystem": "Sistema Operacional",
  "referringUrl": "URL de Referência",
  "pagesVisited": "Páginas Visitadas",
  "timeAndDateOfAccess": "Hora e Data de Acesso",
  "termsTitle": "Termos e Condições",
  "termsEffectiveDate": "Data de Efetivação: 10/05/2024",
  "userAgreement": "Acordo do Usuário",
  "prohibitedActivities": "Atividades Proibidas",
  "changesToTerms": "Mudanças Nestes Termos",
  "termsWelcomeMessage": "Bem-vindo aos nossos Termos e Condições.",
  "termsPurpose": "Estes termos regem seu uso de nossos serviços.",
  "userAgreementText": "Ao usar nossos serviços, você concorda com estes termos.",
  "prohibitedActivitiesOverview": "As seguintes atividades são proibidas:",
  "usingServiceForIllegalPurposes": "Usar o serviço para fins ilegais.",
  "engagingInHarassment": "Envolver-se em qualquer forma de assédio ou abuso.",
  "unauthorizedAccess": "Tentar obter acesso não autorizado aos nossos sistemas.",
  "distributingMalware": "Distribuir software malicioso ou vírus.",
  "termsLimitationOverview": "Não somos responsáveis por quaisquer danos indiretos, incidentais ou consequenciais.",
  "termsUserAcknowledgment": "Você reconhece que usa nossos serviços por sua conta e risco.",
  "termsChangesToTerms": "Podemos atualizar estes termos de tempos em tempos. Por favor, revise-os regularmente.",
  "spineTailedKitTitle": "PQSRTC",
  "spineTailedKitDescription": "O PQSRTC visa oferecer um protocolo RTC enxuto em Swift, com criptografia pós‑quântica como padrão. É um SDK baseado em WebRTC que se concentra em fornecer uma solução moderna, segura e de alta performance para aplicações de voz e vídeo em plataformas Android e Apple, com lógica compartilhada escrita em Swift.",
  "needleTailKitTitle": "NeedleTailKit",
  "needleTailIRCTitle": "NeedleTailIRC",
  "needleTailIRCDescription": "Uma biblioteca cliente IRC moderna para aplicações Swift. NeedleTailIRC fornece uma interface robusta e type-safe para conectar a servidores IRC, gerenciar canais e gerenciar comunicação em tempo real. Construída com Swift Concurrency para performance otimizada.",
  "connectionManagerKitTitle": "ConnectionManagerKit",
  "connectionManagerKitDescription": "Um framework abrangente de gerenciamento de conexões para aplicações Swift. ConnectionManagerKit simplifica conectividade de rede, pooling de conexões e gerenciamento do ciclo de vida de conexões. Perfeito para aplicações que requerem comunicação de rede confiável.",
  "postQuantumSolaceTitle": "PostQuantumSolace",
  "postQuantumSolaceDescription": "Uma biblioteca de criptografia pós-quântica para aplicações Swift. PostQuantumSolace fornece algoritmos e protocolos criptográficos resistentes à computação quântica, garantindo que suas aplicações permaneçam seguras na era da computação quântica.",
  "doubleRatchetKitTitle": "DoubleRatchetKit",
  "doubleRatchetKitDescription": "A Swift implementation of the Double Ratchet Algorithm with Post-Quantum X3DH (PQXDH) integration. Provides forward secrecy and post-compromise security for secure messaging—implements the Signal protocol specification with hybrid PQXDH (MLKEM1024 and Curve25519), header encryption, and out-of-order message support. Cross-platform: macOS 15+, iOS 18+, Android, and Linux.",
  "needleTailKitDescription": "O que é o NeedleTailKit? NTK é o SDK principal para Aplicações Cliente e Servidor NeedleTail, permitindo a criação de aplicações belas com criptografia ponta a ponta. Pode ser usado para várias aplicações além de mensagens. Interessado? Entre em contato conosco para saber mais!",
  "whiteTippedSocketsTitle": "White Tipped Sockets",
  "whiteTippedSocketsDescription": "WhiteTippedSockets é uma biblioteca WebSocket nativa para iOS e macOS, construída na API Network.framework usando Swift Concurrency. Nosso objetivo é fornecer uma solução moderna e eficiente para comunicação WebSocket, e também planejamos desenvolver um servidor totalmente funcional e escalável no futuro.",
  "swiftHlsTitle": "Swift HLS",
  "swiftHlsDescription": "HTTP Live Streaming (HLS) é uma tecnologia chave para streaming eficiente de mídia, e o SwiftHLS é projetado para facilitar isso. Utilizando o mesmo protocolo que alimenta a web, o HLS permite entrega de conteúdo via APIs REST e CDNs. Seu propósito é fornecer confiabilidade e se adapta dinamicamente às condições da rede.",
  "swiftIapTitle": "Swift IAP",
  "swiftIapDescription": "SwiftIAP é uma biblioteca abrangente de Compras In-App para aplicações iOS e macOS. Fornece uma interface moderna e segura de tipos para lidar com compras in-app, assinaturas e validação de recibos. Construída com Swift Concurrency e projetada para facilidade de uso.",
  "stompTitle": "Stomp",
  "stompDescription": "Stomp é uma biblioteca Swift para comunicação com protocolo STOMP. Fornece uma interface moderna e segura de tipos para conectar a servidores STOMP e lidar com roteamento de mensagens. Perfeita para aplicações que precisam de infraestrutura de mensagens confiável.",
  "privacy": "Política de Privacidade",
  "termsConditions": "Termos e Condições",
  "projectTitle_1": "Projetos",
  "projectHeader_1": "PQSRTC",
  "projectTitleText_1": "Solução RTC VoIP",
  "projectTitle_2": "Projetos",
  "projectHeader_2": "NeedleTailKit",
  "projectTitleText_2": "Solução de Mensagens com Criptografia Ponta a Ponta",
  "projectTitle_3": "Projetos",
  "projectHeader_3": "White Tipped Sockets",
  "projectTitleText_3": "Wrapper Swift Concorrente do Network.framework",
  "projectTitle_4": "Projetos",
  "projectHeader_4": "Swift Stomp",
  "projectTitleText_4": "Protocolo STOMP Swift Concorrente",
  "projectTitle_5": "Projetos",
  "projectHeader_5": "Swift HLS",
  "projectTitleText_5": "Projeto Swift HLS",
  "pageNotFound": "Página Não Encontrada",
  "pageNotFoundDescription": "A página que você está procurando não existe ou foi movida. Vamos colocá-lo de volta no caminho certo.",
  "goHome": "Ir para o Início",
  "goBack": "Voltar",
  "contact": "Contato",
  "contactUs": "Entre em Contato",
  "becomeASponsor": "Torne-se um Patrocinador",
  "supportOpenSourceMessage": "Apoie nossos projetos de código aberto e ajude-nos a continuar construindo software incrível.",
  "getStartedOnDigitalOcean": "Comece no Digital Ocean com um crédito de $100 por 60 dias para novos usuários.",
  "readyToGetStarted": "Pronto para Começar?",
  "letsDiscussProject": "Vamos discutir seu projeto e ver como podemos ajudar a dar vida às suas ideias com soluções alimentadas por Swift.",
  "backToTop": "Voltar ao Topo",
  "needleTailsCopyright": "NeedleTails©",
  "pointsForConsideration": "Pontos para Consideração",
  "responsiveDesign": "Design responsivo e adaptativo",
  "responsiveDesignDescription": "Layouts e componentes que se adaptam a todos os viewports e dispositivos.",
  "crossBrowserCompatibility": "Compatibilidade entre navegadores e padrões",
  "crossBrowserCompatibilityDescription": "Testes e compatibilidade nos principais navegadores e padrões.",
  "webPerformanceOptimizationDescription": "Orçamentos de performance, carregamento tardio e assets otimizados. Minimizamos tempo de carregamento e uso de recursos.",
  "userExperience": "Experiência do usuário e acessibilidade",
  "userExperienceDescription": "Arquitetura de informação clara, navegação intuitiva e acessibilidade alinhada à WCAG.",
  "securityPractices": "Segurança e proteção de dados",
  "securityPracticesDescription": "HTTPS, cabeçalhos seguros, validação de entrada e proteção contra riscos OWASP (XSS, CSRF).",
  "seoBestPractices": "SEO e descobribilidade",
  "seoBestPracticesDescription": "Estrutura semântica, meta tags e estratégia de conteúdo alinhada às boas práticas de busca.",
  "backendSolutionsHeader": "Soluções server-side",
  "backendSolutionsDescription": "Projetamos e entregamos backends de nível produção que impulsionam seu negócio. Nossa abordagem server-first garante que APIs, pipelines de dados e integrações sejam construídos para confiabilidade, conformidade e escala.",
  "backendCapabilitiesOverview": "Nossa prática server-side é baseada em Swift (Vapor, Hummingbird, SwiftNIO) e padrões cloud-native comprovados. Entregamos backends seguros e de alto desempenho—APIs REST e customizadas, sistemas orientados a eventos e integração com sua stack existente.",
  "scalability": "Escalabilidade e resiliência",
  "scalabilityDescription": "Arquiteturas pensadas para crescimento: escalabilidade horizontal, serviços stateless e padrões resilientes.",
  "security": "Segurança e conformidade",
  "securityDescription": "Segurança robusta por padrão: criptografia em repouso e em trânsito, identidade e controle de acesso, trilhas de auditoria e alinhamento com frameworks de conformidade comuns.",
  "maintainability": "Manutenibilidade e padrões",
  "maintainabilityDescription": "Bases de código limpas, modulares e bem documentadas com padrões consistentes e controle de versão.",
  "testingAndQualityAssurance": "Testes e garantia de qualidade",
  "testingAndQualityAssuranceDescription": "Estratégias de teste rigorosas: unitários, integração e contrato com automação CI/CD.",
  "monitoringAndLogging": "Monitoramento e observabilidade",
  "monitoringAndLoggingDescription": "Observabilidade pronta para produção: logging estruturado, métricas e alertas. Instrumentamos backends para visibilidade clara de saúde, performance e incidentes.",
  "nativeAppDevelopmentHeader": "Desenvolvimento de aplicativos nativos",
  "nativeAppDevelopmentDescription": "Entregamos aplicativos nativos construídos para performance, segurança e ótima experiência do usuário—em cada plataforma que seu negócio exige.",
  "nativeAppDevelopmentOverview": "Construímos apps nativos prontos para produção para todo o ecossistema Apple (iOS, iPadOS, macOS, tvOS, watchOS, visionOS) e Android. Nosso trabalho enfatiza Swift e Kotlin/Java com tipagem segura, UX adequada à plataforma, acessibilidade e segurança por design.",
  "designConsistency": "Sistemas de design e consistência",
  "designConsistencyDescription": "Sistemas de design e bibliotecas de componentes unificados em todas as plataformas.",
  "deviceFragmentation": "Cobertura de dispositivos e plataformas",
  "deviceFragmentationDescription": "Testes estruturados em matrizes de dispositivos, tamanhos de tela e versões de OS.",
  "userExperienceUX": "Experiência do usuário e acessibilidade",
  "userExperienceUXDescription": "Fluxos intuitivos, arquitetura de informação clara e acessibilidade alinhada à WCAG.",
  "distributionCompliance": "Distribuição e conformidade de lojas",
  "distributionComplianceDescription": "Preparação para App Store e Play Store: diretrizes, rótulos de privacidade e boas práticas de revisão.",
  "webDevelopmentExpertiseHeader": "Desenvolvimento de aplicações web",
  "webDevelopmentExpertiseDescription": "Construímos e mantemos aplicações web que apoiam seus objetivos de negócio—de sites de marketing e portais a aplicações web full-stack que se integram aos seus sistemas.",
  "webDevelopmentOverview": "Entregamos experiências web de nível produção: sites responsivos, SPAs e aplicações full-stack construídas com Vue.js, Nuxt e TypeScript no front e Vapor, Hummingbird ou seu backend preferido.",
  "solutionsTitle": "Nossas Soluções",
  "featuredApplications": "Aplicações em Destaque",
  "our": "Nossas",
  "featuredApps": "Apps em Destaque",
  "featuredAppsDescription": "Descubra nossas aplicações inovadoras que mostram o poder do desenvolvimento Swift e da arquitetura de software moderna.",
  "nudgeTitle": "Mensageria segura sob seu controle",
  "nudgeDescription": "Mensageria criptografada ponta a ponta com auto-hospedagem opcional. Seus dados permanecem seus—sem armazenamento terceiro, sem risco de persistência. Rode sua própria instância ou escale globalmente.",
  "islandHoppersTitle": "Island Hoppers: Seu App de Tours Definitivo para Aventuras Sem Problemas!",
  "islandHoppersDescription": "Island Hoppers é o app tudo-em-um projetado para melhorar sua experiência de viagem, seja você uma empresa organizando tours inesquecíveis ou um cliente procurando a escapada perfeita. Para empresas, nosso app otimiza todo o processo de gerenciamento de tours. Organize e personalize seus tours sem esforço, comunique-se diretamente com guias turísticos e mantenha seus clientes informados com atualizações em tempo real. Com Island Hoppers, você pode gerenciar reservas, rastrear preferências de clientes e garantir que cada detalhe seja cuidado, permitindo que você se concentre em entregar experiências excepcionais. Para clientes, Island Hoppers oferece uma diversa gama de pacotes de tours adaptados para vários tipos de grupos, incluindo famílias, mochileiros e entusiastas de festas. Navegue pela nossa seleção curada de aventuras, escolha o pacote perfeito que se adapta ao seu estilo e conecte-se com viajantes afins. Desfrute de comunicação fluida com seus guias turísticos, acesse informações essenciais e receba recomendações personalizadas para aproveitar ao máximo sua viagem. Com Island Hoppers, embarque em aventuras inesquecíveis com facilidade e confiança, sabendo que cada aspecto do seu tour está a apenas um toque de distância!",
  "streamStackTitle": "Uma Plataforma Educacional para suas Soluções de Software",
  "streamStackDescription": "Transmita, Leia, Discuta. Seja você novo na programação ou queira ler sobre diferentes soluções de software, facilitamos para você com nosso app Nuxt com backend em Vapor. Mantenha-se atualizado com as últimas tendências de codificação.",
  "welcomeToNeedleTails": "Bem-vindo ao NeedleTails - Seu Aliado em Desenvolvimento de Software",
  "accept": "Concordo e aceito",
  "cookieConsentTitle": "Usamos armazenamento do navegador",
  "cookieConsentMessage": "Usamos armazenamento do navegador para lembrar sua preferência de idioma e melhorar sua experiência de navegação. Clicando em 'Aceitar Tudo', você consente com nosso uso do armazenamento do navegador.",
  "cookieConsentAcceptAll": "Aceitar Tudo",
  "cookieConsentAcceptNecessary": "Apenas Necessários",
  "cookieConsentReject": "Rejeitar Tudo",
  "cookieConsentLearnMore": "Saiba Mais",
  "cookieConsentNecessary": "Armazenamento necessário inclui detecção de idioma para fornecer conteúdo em seu idioma preferido.",
  "cookieConsentAnalytics": "Atualmente não usamos rastreamento analítico neste site.",
  "cookieConsentPreferences": "Armazenamento de preferências lembra suas configurações como tema e preferências do usuário para personalizar sua experiência.",
  "cookieConsentMarketing": "Atualmente não usamos rastreamento de marketing ou publicidade neste site.",
  "brewhubWidgetTitle": "BrewHub",
  "brewhubWidgetDescription": "Plataforma profissional de cursos e instrução em desenvolvimento de software. Acesse treinamento guiado ao vivo com ferramentas e fluxos de trabalho de nível de produção para aprimorar suas habilidades de desenvolvimento.",
  "brewhubWidgetCTA": "Cursos de Treinamento",
  "brewhubComingSoonTitle": "Disponível",
  "brewhubComingSoonDescription": "O BrewHub já está disponível. Visite brewhub.needletails.com para cursos e treinamento profissionais em desenvolvimento de software.",
  "brewhubFeature1Title": "Cursos com especialistas",
  "brewhubFeature1Description": "Acesse cursos profissionais de desenvolvimento de software ministrados por especialistas do setor.",
  "brewhubFeature2Title": "Treinamento ao vivo",
  "brewhubFeature2Description": "Treinamento ao vivo individual ou em pequenos grupos com orientação direta de especialistas.",
  "brewhubFeature3Title": "Comunidade",
  "brewhubFeature3Description": "Junte-se a uma comunidade de desenvolvedores e aprenda junto.",
  "brewhubFeature4Title": "Ferramentas de produção",
  "brewhubFeature4Description": "Aprenda com as mesmas ferramentas e fluxos de trabalho usados em ambientes de produção.",
  "brewhubBackToMainSite": "Ir para o BrewHub",
  "brewhubMetaTitle": "BrewHub | NeedleTails",
  "brewhubMetaDescription": "O BrewHub é a plataforma da NeedleTails para cursos e treinamento profissionais em desenvolvimento de software.",
  "brewhubOgDescription": "Cursos e treinamento profissionais em desenvolvimento de software.",
  "brewhubLogoAlt": "Logotipo do BrewHub",
  "needletailKitTitle": "NeedleTailKit",
  "needletailKitSubtitle": "Um SDK Swift abrangente e pronto para produção para criar aplicativos de mensagens seguros com criptografia de ponta a ponta e recursos de segurança de nível empresarial.",
  "needletailKitPrivateBadge": "SDK Privado - Licença Necessária",
  "needletailKitRequestLicense": "Solicitar Licença",
  "needletailKitExploreFeatures": "Explorar Recursos",
  "needletailKitFeaturesTitle": "Recursos de Nível Empresarial",
  "needletailKitFeaturesDescription": "Construído para produção com segurança de ponta e arquitetura Swift moderna.",
  "needletailKitSecurityTitle": "Segurança Empresarial",
  "needletailKitSecurityPQ": "Criptografia Pós-Quântica - À prova de ataques quânticos futuros",
  "needletailKitSecurityDoubleRatchet": "Protocolo Double Ratchet - Segredo direto perfeito",
  "needletailKitSecurityE2E": "Criptografia de Ponta a Ponta - Todas as mensagens criptografadas por padrão",
  "needletailKitSecurityDeviceVerification": "Verificação de Dispositivos - Vinculação criptográfica de dispositivos",
  "needletailKitPlatformTitle": "Suporte Multiplataforma",
  "needletailKitPlatformIOS": "iOS 18.0+ - Suporte nativo completo para iOS",
  "needletailKitPlatformMacOS": "macOS 15.0+ - Integração completa do macOS",
  "needletailKitPlatformSwift6": "Swift 6.0+ - Recursos mais recentes da linguagem",
  "needletailKitPlatformAsync": "Async/Await - Concorrência moderna em todo lugar",
  "needletailKitTransportTitle": "Transporte Inteligente",
  "needletailKitTransportMulti": "Roteamento Multi-Transporte - Seleção automática de caminho",
  "needletailKitTransportP2P": "P2P de Rede Local - Comunicação direta entre dispositivos",
  "needletailKitTransportDCC": "Protocolo DCC - P2P baseado em IRC com TLS",
  "needletailKitTransportFailover": "Failover Automático - Mudança de transporte sem interrupções",
  "needletailKitMessagingTitle": "Mensagens Ricas",
  "needletailKitMessagingText": "Mensagens de Texto - Comunicação simples e segura",
  "needletailKitMessagingMedia": "Mensagens de Mídia - Imagens, vídeos, documentos",
  "needletailKitMessagingSelfDestruct": "Mensagens Auto-Destrutivas - Suporte temporário",
  "needletailKitMessagingEdit": "Edição de Mensagens - Editar mensagens enviadas",
  "needletailKitVoiceVideoTitle": "Chamadas de Voz e Vídeo",
  "needletailKitVoiceVideoWebRTC": "Integração WebRTC - Chamadas de alta qualidade",
  "needletailKitVoiceVideoSTUN": "Suporte STUN/TURN - Traversal NAT",
  "needletailKitVoiceVideoCallManagement": "Gerenciamento de Chamadas - Tratamento completo do ciclo de vida",
  "needletailKitEnterpriseTitle": "Pronto para Empresas",
  "needletailKitEnterpriseProduction": "Pronto para Produção - Testado em aplicativos reais",
  "needletailKitEnterpriseSupport": "Suporte Empresarial - Suporte profissional disponível",
  "needletailKitEnterpriseCompliance": "Conformidade - Construído para conformidade regulatória",
  "needletailKitEnterpriseScalability": "Escalabilidade - Projetado para implantações em larga escala",
  "needletailKitQuickStartTitle": "Quick Start",
  "needletailKitQuickStartDescription": "Get started with NeedleTailKit in minutes. Follow these simple steps to integrate secure messaging into your application.",
  "needletailKitInstallTitle": "Installation",
  "needletailKitInstallCode": "dependencies: [\n    .package(url: \"https://github.com/needletails/needle-tail-kit.git\", from: \"1.0.0\")\n]",
  "needletailKitInitializeTitle": "Initialize Session",
  "needletailKitInitializeCode": "import NeedleTailKit\n\nlet session = NeedleTailSession.shared\ntry await session.createNewUserAccount(\n    authInfo: authInfo,\n    store: store,\n    eventObserver: eventObserver\n)",
  "needletailKitSendMessageTitle": "Send Your First Message",
  "needletailKitSendMessageCode": "let contact = try await session.createContact(contact: \"bob\")\ntry await session.sendMessage(\n    messageType: .text,\n    recipient: .nickname(\"bob\"),\n    text: \"Hello, World!\"\n)",
  "needletailKitContactTitle": "Solicitar uma Licença",
  "needletailKitContactDescription": "NeedleTailKit é um SDK proprietário de código fechado. Entre em contato conosco para discutir opções de licenciamento para seu projeto.",
  "needletailKitContactButton": "Contatar para Licença",
  "needletailKitMetaTitle": "NeedleTailKit - SDK de Mensagens Seguras Empresariais | NeedleTails",
  "needletailKitMetaDescription": "SDK Swift pronto para produção para criar aplicativos de mensagens seguros com criptografia de ponta a ponta. Criptografia pós-quântica, suporte multiplataforma e segurança de nível empresarial.",
  "needletailKitOgDescription": "SDK Swift pronto para produção para mensagens seguras com recursos de segurança de nível empresarial.",
  "needletailKitLogoAlt": "Logo do NeedleTailKit",
  "needletailKitPlatformAndroid": "Android: API 24 (Android 7.0) ou posterior",
  "nudgeWidgetTitle": "Seguro com Nudge",
  "nudgeWidgetDescription": "Opcionalmente automonitorado, mensagens com criptografia de ponta a ponta com controle completo de dados.",
  "nudgeWidgetCTA": "Saiba Mais",
  "nudgeWidgetLogoAlt": "Logo do Nudge",
  "nudgeFeature1Title": "Criptografia ponta a ponta",
  "nudgeFeature1Description": "Toda mensagem criptografada por padrão. Privacidade total.",
  "nudgeFeature2Title": "Seus dados, suas regras",
  "nudgeFeature2Description": "Auto-hospedagem opcional. Sem armazenamento externo de dados.",
  "nudgeFeature3Title": "Canais seguros",
  "nudgeFeature3Description": "Mensageria privada construída para segurança.",
  "nudgeFeature4Title": "Global ou auto-hospedado",
  "nudgeFeature4Description": "Escale globalmente ou rode sua própria instância—sem risco de persistência de dados.",
  "nudgeContactButton": "Ver Nudge",
  "nudgeMetaTitle": "Nudge - Mensagens Seguras com Criptografia de Ponta a Ponta | NeedleTails",
  "nudgeMetaDescription": "Aplicativo de mensagens com criptografia de ponta a ponta e dados opcionalmente automonitorados com controle completo de dados. Comunicação segura sem riscos de persistência de dados.",
  "nudgeOgDescription": "Mensagens com criptografia de ponta a ponta e dados opcionalmente automonitorados com controle completo de dados e segurança de nível empresarial.",
  "nudgeMetaKeywords": "Nudge, mensagens seguras, criptografia de ponta a ponta, aplicativo de mensagens criptografadas, mensagens opcionalmente automonitoradas, mensagens privadas, comunicação segura, privacidade de dados, segurança de mensagens, chat criptografado, aplicativo de chat seguro, mensagens focadas em privacidade",
  "brewhubMetaKeywords": "BrewHub, cursos de desenvolvimento de software, cursos de programação, treinamento de desenvolvedores, educação em software, cursos de codificação, tutoriais de desenvolvimento, treinamento técnico, plataforma de aprendizado de software, tutoriais de programação, cursos de desenvolvimento web, cursos de desenvolvimento móvel, treinamento em desenvolvimento backend",
  "needletailKitMetaKeywords": "NeedleTailKit, SDK Swift, criptografia de ponta a ponta, mensagens seguras, SDK iOS, SDK macOS, SDK Android, criptografia pós-quântica",
  "heroTagline": "Resolvemos seus desafios—apps, sites e soluções de software integradas.",
  "managementPageLabel": "Gestão",
  "managementPageTitle": "Produto e Entrega de Projetos",
  "managementPageLead": "Alinhamos visão, roadmap e execução para que seus projetos de software mantenham escopo, prazo e qualidade.",
  "managementCtaLead": "Pronto para alinhar seu próximo projeto?",
  "consultationPageLabel": "Consultoria",
  "consultationCtaLead": "Conte-nos seus objetivos e traçamos um caminho claro.",
  "costSavingsBadge": "Economize",
  "costSavingsHeadline": "Reduza custos de servidor",
  "costSavingsIntro": "Em produção, a escolha do runtime afeta diretamente o que você paga por computação. Swift no servidor (Vapor, Hummingbird, SwiftNIO) costuma usar menos memória e atender mais requisições por núcleo que muitos runtimes populares. Você pode servir o mesmo tráfego em instâncias menores ou em menor número—e reduzir a conta na nuvem sem sacrificar confiabilidade.",
  "costSavingsSubhead": "Mesma carga: uma API típica servindo cerca de 1–2 milhões de requisições por mês em um servidor pequeno.",
  "costSavingsColRuntime": "Tecnologia",
  "costSavingsColMemory": "Uso de memória",
  "costSavingsColThroughput": "Capacidade de tráfego",
  "costSavingsColMonthlyCost": "Custo mensal estimado do servidor",
  "costSavingsSwift": "Swift (Vapor / SwiftNIO)",
  "costSavingsSwiftMemory": "Muito baixo (30–80 MB). Um servidor pequeno costuma bastar para tráfego moderado.",
  "costSavingsSwiftThroughput": "Alto. Um servidor atende tráfego pesado; menos servidores para escalar.",
  "costSavingsSwiftCost": "US$ 12–24/mês (instâncias mínimas muitas vezes suficientes)",
  "costSavingsNode": "Node.js",
  "costSavingsNodeMemory": "Moderado (80–150 MB por processo). Em geral é preciso um servidor um pouco maior.",
  "costSavingsNodeThroughput": "Bom. Um servidor atende tráfego sólido; pode ser preciso mais servidores conforme o tráfego cresce.",
  "costSavingsNodeCost": "US$ 24–48/mês",
  "costSavingsPython": "Python (ex.: FastAPI)",
  "costSavingsPythonMemory": "Maior (100–250 MB por worker). Muitas vezes é preciso mais RAM para vários workers.",
  "costSavingsPythonThroughput": "Bom com vários workers. Muitas vezes é preciso mais ou servidores maiores para o mesmo tráfego.",
  "costSavingsPythonCost": "US$ 24–48/mês (alguns workers)",
  "costSavingsJava": "Java (ex.: Spring Boot)",
  "costSavingsJavaMemory": "Maior (200–500 MB típico). Em geral exige um servidor maior desde o início.",
  "costSavingsJavaThroughput": "Bom em operação. Mais memória de base significa servidor maior para o mesmo tráfego.",
  "costSavingsJavaCost": "US$ 48–96/mês (instância maior tipicamente necessária)",
  "costSavingsDisclaimer": "Os números reais dependem do seu app, tráfego, uso de banco e provedor cloud. Essas cifras são ilustrativas; podemos ajudar a estimar custos para sua carga.",
  "costSavingsCta": "Parceria conosco para backends que custam menos para rodar.",
  "costSavingsWhyItMatters": "Em um ano, um runtime mais eficiente pode reduzir a conta de servidor em centenas ou milhares de dólares para a mesma carga. A comparação abaixo é um cenário realista para uma API JSON simples servindo cerca de 1–2 milhões de requisições por mês em uma pequena instância cloud.",
  "costSavingsTableHowToRead": "Uso de memória define o tamanho do servidor. Capacidade de tráfego é quantas requisições um servidor atende. Menos memória + mais capacidade costuma significar conta mensal menor para o mesmo tráfego.",
  "costSavingsColMemoryHelp": "Define tamanho mínimo do servidor; menor = servidor menor/mais barato",
  "costSavingsColThroughputHelp": "Quanto tráfego um servidor atende; maior = menos servidores necessários",
  "costSavingsProductionHeadline": "Como são backends em escala de produção",
  "costSavingsProductionIntro": "Produtos diferentes precisam de perfis de servidor diferentes. A tabela abaixo mostra tipos de carga típicos em escala—e por que um runtime eficiente (como Swift no servidor) pode reduzir custos e simplificar operações.",
  "costSavingsProductionColWorkload": "Tipo de carga",
  "costSavingsProductionColNeeds": "Escala e necessidades típicas",
  "costSavingsProductionColWhy": "Por que a eficiência do servidor importa",
  "costSavingsProductionEnterprise": "Sites corporativos e empresariais",
  "costSavingsProductionEnterpriseNeeds": "Tráfego moderado a alto; confiabilidade, conformidade e disponibilidade. APIs, conteúdo e integrações.",
  "costSavingsProductionEnterpriseWhy": "Menor custo por requisição; frota menor para a mesma capacidade. Contas previsíveis conforme o tráfego cresce.",
  "costSavingsProductionMessaging": "Mensageria segura e chat em tempo real",
  "costSavingsProductionMessagingNeeds": "Entrega em tempo real, criptografia ponta a ponta, alta concorrência. Muitas conexões por servidor.",
  "costSavingsProductionMessagingWhy": "Pouca memória por conexão; alto throughput por núcleo. Menos servidores para milhões de usuários.",
  "costSavingsProductionVideo": "Videoconferência e mídia em tempo real",
  "costSavingsProductionVideoNeeds": "Sinalização, planos de controle e coordenação. Mídia pode usar infra dedicada; APIs ainda precisam escalar.",
  "costSavingsProductionVideoWhy": "Camadas de sinalização e API eficientes reduzem custos. Mais capacidade por servidor para tráfego de controle.",
  "costSavingsProductionSocial": "Plataformas sociais e de conteúdo",
  "costSavingsProductionSocialNeeds": "Volume de requisições muito alto, feeds, metadados de mídia, distribuição global. Custo por requisição se acumula.",
  "costSavingsProductionSocialWhy": "Alto throughput e pouca memória reduzem custo por milhão de requisições. Frota menor em escala."
}
