{
  "introHeaderTwo": "Vizyon sizde; çözümü biz sunuyoruz. İster mobil uygulama, ister modern web sitesi, ister tam yığın yazılım sistemi olsun, zorluklarınızı güvenilir ve güvenli ürünlere dönüştürüyoruz. Mobil, Web ve Sunucu alanında kurumsal deneyimle ölçeklenen çözümler kuruyor ve entegre ediyoruz—siz işinize odaklanın.",
  "menuItemOne": "Kurslar",
  "menuItemTwo": "Danışmanlık",
  "menuItemThree": "Yönetim",
  "getInTouch": "İletişime Geçin",
  "projectsHeader": "Yazılımımız",
  "projectsDescription": "Size geniş bir açık kaynak yazılım yelpazesi sunmaya kendimizi adadık. Bu misyonu desteklemek için aynı zamanda bazı kapalı kaynak yazılımlar da sunuyoruz. Hem açık kaynak hem de kapalı kaynak seçeneklerini içeren projelerimizi keşfetmenizi davet ediyoruz. Katkıda bulunmaya veya kapalı kaynak yazılımımız için lisans almaya ilgi duyuyorsanız, lütfen bizimle iletişime geçmekten çekinmeyin.",
  "projectsOverview": "İşte ne yaptığımız ve yaptıklarımızın listesi",
  "businessOverviewTitle": "Swift Yazılım Uzmanları",
  "badgeMobile": "Mobil",
  "badgeWeb": "Web",
  "badgeServer": "Sunucu",
  "businessOverviewDescription": "En zor yazılım zorluklarınızı üretime hazır çözümlere dönüştürüyoruz. Yeni bir uygulama, modern bir web sitesi veya sorunsuz entegre sistemler isteyin—Mobil, Web ve Sunucu’da, projenize uygun dilde teslim ediyoruz. Swift uzmanlığımız tip güvenliği, performans ve güvenilirlik getiriyor; mevcut yığınınızla da entegre oluyoruz. İşinizle birlikte ölçeklenen, kalıcı çözümler için bizimle çalışın.",
  "serviceHeaderBackendDevelopment": "Backend ve API'ler",
  "serviceDescriptionBackendDevelopment": "Ölçeklenebilirlik ve entegrasyon zorluklarını sağlam sunucu tarafı çözümleriyle çözün. API'leri, veritabanlarını ve hizmetleri kurup bağlıyoruz; uygulamalarınız ve siteleriniz her ölçekte güvenilir çalışsın.",
  "serviceHeaderMobileAppDevelopment": "Mobil Uygulamalar",
  "serviceDescriptionMobileAppDevelopment": "Kullanıcıların sevdiği native bir uygulama edinin. Gerçek sorunları çözen iOS, Android ve çapraz platform uygulamaları geliştiriyoruz—zamanında ve mağazaya hazır.",
  "serviceHeaderTraining": "BrewHub",
  "serviceDescriptionTraining": "Ekibinizi profesyonel yazılım geliştirme kurslarıyla güçlendirin. Üretim düzeyinde araçlarla rehberli canlı eğitim; çözümleri dahili inşa edip sürdürebilirsiniz.",
  "serviceHeaderWebDevelopment": "Web Geliştirme",
  "serviceDescriptionWebDevelopment": "Her yerde çalışan web siteleri ve web uygulamaları. Kullanıcı çeken, iş hedeflerinizi destekleyen duyarlı, hızlı ve güvenli deneyimler sunuyoruz.",
  "openSourceHeader": "Açık Kaynak",
  "openSourceDescription": "Açık kaynağın gücüne inanıyoruz. GitHub'daki projelerimizi keşfedin ve topluluğa katkıda bulunun. Desteğiniz yenilikçi çözümler geliştirmeye devam etmemize yardımcı olur.",
  "whyChooseSwift": "Neden Swift Seçmelisiniz?",
  "typeSafety": "Tip Güvenliği",
  "typeSafetyDescription": "Swift'in tip sistemi derleme zamanında hataları önler, uygulamalarınızın ilk günden itibaren sağlam ve güvenilir olmasını sağlar.",
  "performance": "Performans",
  "performanceDescription": "Düşük bellek kullanımı ve yüksek performans, Swift'i kaynak kısıtlı ortamlar ve zorlu uygulamalar için ideal kılar.",
  "threadSafety": "Thread Güvenliği",
  "threadSafetyDescription": "Yerleşik eşzamanlılık desteği, uygulamalarınızın yarış koşulları olmadan birden fazla görevi verimli bir şekilde yönetmesini sağlar.",
  "ourServices": "Zorluklarınızı Nasıl Çözüyoruz",
  "servicesDescription": "Kavramdan lansmana ve ötesine, ihtiyacınız olan uygulamaları, web sitelerini ve entegrasyonları teslim ediyoruz. Zorluğunuzu anlatın—çözümü tasarlıyor, inşa ediyor ve destekliyoruz.",
  "startYourProject": "Projenizi Başlatın",
  "swiftNative": "Native",
  "support": "Destek",
  "possibilities": "Olasılıklar",
  "makingYour": "Fikirlerinizi",
  "ideasReality": "Fikirleri Gerçeğe",
  "swiftSoftwareSpecialists": "Swift Yazılım Uzmanları",
  "swift": "Swift",
  "swiftServer": "Swift-Server",
  "frequentlyAskedQuestions": "Sık Sorulan Sorular",
  "faqDescription": "Yazılım geliştirme hizmetlerimiz hakkında yaygın soruların cevaplarını alın",
  "faqTechnologies": "Hangi teknolojilerde uzmanlaşıyorsunuz?",
  "faqTechnologiesAnswer": "Nuxt, Vue, Vapor ve SwiftNIO dahil olmak üzere geniş bir teknoloji yelpazesinde modern web geliştirme konusunda uzmanlaşıyoruz. Dil uzmanlığımız TypeScript ve Swift'i içerir. Ayrıca yüksek performanslı uygulamalar sunmak için güçlü backend çözümleri, bulut hizmetleri, API'ler ve ölçeklenebilir mimari ile çalışıyoruz.",
  "faqTimeline": "Tipik bir proje ne kadar sürer?",
  "faqTimelineAnswer": "Proje süreleri karmaşıklığa göre değişir. Basit web uygulamaları 4-8 hafta sürerken, karmaşık kurumsal çözümler 3-6 ay sürebilir. Danışmanlık sırasında detaylı zaman çizelgeleri sağlıyoruz.",
  "faqSupport": "Devam eden destek ve bakım sağlıyor musunuz?",
  "faqSupportAnswer": "Evet, uygulamanızın güncel ve güvenli kalmasını sağlamak için 7/24 izleme, düzenli güncellemeler, güvenlik yamaları ve özellik geliştirmeleri içeren kapsamlı destek paketleri sunuyoruz.",
  "faqProcess": "Geliştirme süreciniz nedir?",
  "faqProcessAnswer": "Düzenli müşteri iletişimi, yinelemeli geliştirme ve sürekli test ile işbirlikçi bir yaklaşım izliyoruz. Sürecimiz planlama, tasarım, geliştirme, test ve dağıtım aşamalarını içerir.",
  "faqIntegration": "Mevcut sistemler ve API'ler ile çalışabilir misiniz?",
  "faqIntegrationAnswer": "Kesinlikle! Mevcut sistemler, API'ler ve veritabanları ile entegrasyon konusunda kapsamlı deneyime sahibiz. Mevcut altyapınızı geliştirebilir, modernleştirebilir veya tamamen yeniden inşa edebiliriz.",
  "faqSecurity": "Güvenlik ve veri koruma konusunda ne yapıyorsunuz?",
  "faqSecurityAnswer": "Güvenlik, inşa ettiğimiz her şeyde varsayılandır. Verilerinizi ve kullanıcılarınızın bilgilerini korumak için güvenlik odaklı yazılım geliştirme uygulamaları, endüstri standardı güvenlik önlemleri, veri şifreleme ve düzenli güvenlik denetimleri uyguluyoruz.",
  "consultingTitle": "Your Challenges, Our Expertise",
  "consultingOverview": "Whether you're defining a new product, modernizing legacy systems, or choosing stack and architecture—we provide structured guidance so your decisions are informed by experience and aligned with your business goals.",
  "consultWithUs": "Discuss Your Initiative",
  "consultingWithUsMessage": "Share your goals, constraints, and timeline. We'll outline options, trade-offs, and a clear path forward—including scope, technology, and what it takes to get there.",
  "whatToConsultAbout": "What We Can Help With",
  "architectureDesign": "Architecture & System Design",
  "architectureDesignDescription": "Scalable, maintainable architectures for new and existing systems. We help you choose patterns, boundaries, and integration approaches so your solution is fit for production and future growth.",
  "technologySelection": "Technology & Stack Selection",
  "technologySelectionDescription": "Objective evaluation of technologies and vendors against your requirements, team skills, and long-term maintainability. We help you select a stack that balances delivery speed, cost, and risk.",
  "performanceOptimization": "Performance & Scalability",
  "performanceOptimizationDescription": "Response times, throughput, and resource usage. We apply caching, load balancing, query optimization, and capacity planning so your systems perform under load and stay cost-effective.",
  "securityReview": "Security & Compliance Review",
  "securityReviewDescription": "Security posture and compliance alignment. We assess design and implementation against common threats and frameworks so your applications and data meet business and regulatory expectations.",
  "codeReview": "Code & Implementation Review",
  "codeReviewDescription": "Expert review of code quality, patterns, and technical debt. We provide actionable feedback so your codebase stays maintainable, testable, and aligned with best practices.",
  "bestPractices": "Process & Best Practices",
  "bestPracticesDescription": "Development process, DevOps, and delivery practices. We help you adopt workflows that improve predictability, quality, and team efficiency.",
  "trainingProgramsHeader": "Eğitim Programları",
  "trainingProgramsDescription": "Profesyonel gelişim ve eğitim çözümleri",
  "trainingOverview": "Ekibinizin becerilerini geliştirmek için kapsamlı eğitim programları",
  "trainingCourses": "Eğitim Kursları",
  "vueJsDevelopment": "Vue.js Geliştirme",
  "vueJsDevelopmentDescription": "Nuxt ile modern Vue.js geliştirme uygulamalarını öğrenin",
  "swiftBackendDevelopment": "Swift Backend Geliştirme",
  "swiftBackendDevelopmentDescription": "Vapor ve SwiftNIO ile Swift backend geliştirmeyi öğrenin",
  "typescriptDevelopment": "TypeScript Geliştirme",
  "typescriptDevelopmentDescription": "TypeScript ile güçlü uygulamalar oluşturun",
  "securityFirstDevelopment": "Güvenlik Odaklı Geliştirme",
  "securityFirstDevelopmentDescription": "Güvenlik odaklı yazılım geliştirme uygulamalarını uygulayın",
  "productManagementExpertiseHeader": "Product Management",
  "productManagementExpertiseDescription": "Structured product management to align vision, roadmap, and delivery with business outcomes.",
  "productManagementOverview": "We support product-led organizations with discovery, prioritization, and lifecycle practices. From requirements and market insight through UX and roadmap planning, we help you ship the right features at the right time and keep stakeholders aligned.",
  "productManagementPoints": "Key Disciplines",
  "requirementsGathering": "Requirements & Discovery",
  "requirementsGatheringDescription": "Structured elicitation and documentation of functional and non-functional requirements. We capture clear, actionable specs so development and stakeholders share a single source of truth.",
  "marketResearch": "Market & User Research",
  "marketResearchDescription": "Evidence-based understanding of users, competitors, and market fit. We support product decisions with research so roadmaps are grounded in real demand and usage.",
  "userExperienceDesign": "User Experience Design",
  "userExperienceDesignDescription": "User-centered flows, information architecture, and interaction design. We align UX with business goals and accessibility so products are usable and compliant.",
  "productStrategy": "Product Strategy",
  "productStrategyDescription": "Vision, positioning, and roadmap aligned with business objectives. We help define and communicate strategy so teams and stakeholders move in the same direction.",
  "featurePrioritization": "Feature Prioritization",
  "featurePrioritizationDescription": "Framework-driven prioritization (value, effort, risk). We help you decide what to build next so capacity is focused on the highest-impact work.",
  "stakeholderManagement": "Stakeholder Management",
  "stakeholderManagementDescription": "Clear communication, expectations, and alignment with internal and external stakeholders. We keep everyone informed and bought in so delivery stays on track.",
  "projectManagementExpertiseHeader": "Project Management",
  "projectManagementExpertiseDescription": "Delivery discipline so your software projects stay on scope, schedule, and quality.",
  "projectManagementOverview": "We apply proven project management practices—planning, tracking, risk and resource management—tailored to your team size and methodology. We keep projects visible and predictable so you can deliver on commitments and adapt when priorities change.",
  "projectManagementPoints": "Key Disciplines",
  "projectPlanning": "Project Planning",
  "projectPlanningDescription": "Scoped plans, milestones, and dependencies. We define clear deliverables and timelines so execution is predictable and aligned with business goals.",
  "resourceManagement": "Resource Management",
  "resourceManagementDescription": "Capacity planning and allocation across teams and sprints. We help balance workload and skills so delivery stays sustainable and on track.",
  "riskManagement": "Risk Management",
  "riskManagementDescription": "Identification, assessment, and mitigation of technical and project risks. We surface and address risks early so issues don’t derail delivery.",
  "qualityAssurance": "Quality Assurance",
  "qualityAssuranceDescription": "Quality gates, acceptance criteria, and release readiness. We ensure standards are met so releases are reliable and supportable.",
  "overview": "Genel Bakış",
  "privacyPolicyTitle": "Gizlilik Politikası",
  "effectiveDate": "Yürürlük Tarihi",
  "effectiveDateValue": "10/05/2024",
  "introduction": "Giriş",
  "informationWeDoNotCollect": "Toplamadığımız Bilgiler",
  "informationCollectedByServers": "Sunucular ve Teknolojiler Tarafından Toplanan Bilgiler",
  "legalUse": "Yasal Kullanım",
  "limitationOfLiability": "Sorumluluk Sınırlaması",
  "changesToPolicy": "Bu Gizlilik Politikasındaki Değişiklikler",
  "privacyWelcomeMessage": "NeedleTails.com'a hoş geldiniz. Gizliliğiniz bizim için önemlidir.",
  "privacyPurpose": "Bu Gizlilik Politikası, sitemizi ziyaret ettiğinizde bilgi toplama uygulamalarımızı özetlemektedir.",
  "personalInformation": "Kullanıcılarımızdan herhangi bir kişisel bilgi toplamıyoruz.",
  "informationOverview": "Kişisel bilgi toplamadığımız halde, sunucuların ve diğer teknolojilerin otomatik olarak belirli bilgiler toplayabileceğini lütfen unutmayın.",
  "legalUseOverview": "Sitemizi kullanarak, tüm yerel yasa ve düzenlemelere uymayı kabul ediyorsunuz.",
  "userResponsibility": "Sitenin kullanımının yargı yetkinizde yasal olduğundan emin olmak sizin sorumluluğunuzdadır.",
  "privacyLimitationOverview": "Bu web sitesinin yazarı, Sitenin kullanımınızdan kaynaklanan herhangi bir hasar veya kayıp için sorumlu tutulamaz.",
  "privacyUserAcknowledgment": "Siteyi kullanarak, bunu kendi riskinizle yaptığınızı ve yazarın kullanımınızdan kaynaklanan herhangi bir sonuçtan sorumlu olmadığını kabul ediyorsunuz.",
  "privacyChangesToPolicy": "Gizlilik Politikamızı zaman zaman güncelleyebiliriz. Yeni Gizlilik Politikasını bu sayfada yayınlayarak değişiklikler hakkında sizi bilgilendireceğiz. Herhangi bir değişiklik için bu Gizlilik Politikasını periyodik olarak gözden geçirmeniz önerilir.",
  "cookies": "Çerezler",
  "cookiesDescription": "Kullanıcı deneyimini geliştirmek için çerezler kullanılabilir. Bunlar şunları içerebilir:",
  "sessionCookies": "Oturum Çerezleri: Tarayıcınızı kapattığınızda sona eren geçici çerezler.",
  "persistentCookies": "Kalıcı Çerezler: Cihazınızda belirli bir süre veya silinene kadar kalan çerezler.",
  "analytics": "Analitik",
  "analyticsDescription": "Web sitesi kullanımı hakkında bilgi toplayan üçüncü taraf analitik hizmetleri kullanabiliriz, örneğin:",
  "pageViews": "Sayfa Görüntülemeleri",
  "userInteractions": "Kullanıcı Etkileşimleri",
  "trafficSources": "Trafik Kaynakları",
  "serverLogs": "Sunucu Günlükleri",
  "serverLogsDescription": "Web sunucuları ziyaretiniz hakkında bilgi günlüğe kaydedebilir, örneğin:",
  "ipAddress": "IP Adresi",
  "browserType": "Tarayıcı Türü",
  "operatingSystem": "İşletim Sistemi",
  "referringUrl": "Yönlendiren URL",
  "pagesVisited": "Ziyaret Edilen Sayfalar",
  "timeAndDateOfAccess": "Erişim Zamanı ve Tarihi",
  "termsTitle": "Şartlar ve Koşullar",
  "termsEffectiveDate": "Yürürlük Tarihi: 10/05/2024",
  "userAgreement": "Kullanıcı Sözleşmesi",
  "prohibitedActivities": "Yasaklanan Faaliyetler",
  "changesToTerms": "Bu Şartlardaki Değişiklikler",
  "termsWelcomeMessage": "Şartlar ve Koşullarımıza hoş geldiniz.",
  "termsPurpose": "Bu şartlar hizmetlerimizin kullanımını yönetir.",
  "userAgreementText": "Hizmetlerimizi kullanarak bu şartları kabul ediyorsunuz.",
  "prohibitedActivitiesOverview": "Aşağıdaki faaliyetler yasaktır:",
  "usingServiceForIllegalPurposes": "Hizmeti yasa dışı amaçlar için kullanmak.",
  "engagingInHarassment": "Herhangi bir taciz veya istismar biçiminde bulunmak.",
  "unauthorizedAccess": "Sistemlerimize yetkisiz erişim elde etmeye çalışmak.",
  "distributingMalware": "Zararlı yazılım veya virüs dağıtmak.",
  "termsLimitationOverview": "Dolaylı, tesadüfi veya sonuçsal hasarlardan sorumlu değiliz.",
  "termsUserAcknowledgment": "Hizmetlerimizi kendi riskinizle kullandığınızı kabul ediyorsunuz.",
  "termsChangesToTerms": "Bu şartları zaman zaman güncelleyebiliriz. Lütfen düzenli olarak gözden geçirin.",
  "spineTailedKitTitle": "PQSRTC",
  "spineTailedKitDescription": "PQSRTC, Swift’te yalın bir RTC protokolü sunmayı hedefler ve varsayılan olarak post‑kuantum şifreleme kullanır. WebRTC tabanlı bir SDK olarak, Swift ile yazılmış ortak mantığı kullanarak hem Android hem de Apple platformlarında çalışan ses ve video uygulamaları için modern, güvenli ve yüksek performanslı çözümler sunar.",
  "needleTailKitTitle": "NeedleTailKit",
  "needleTailIRCTitle": "NeedleTailIRC",
  "needleTailIRCDescription": "Swift uygulamaları için modern bir IRC istemci kütüphanesi. NeedleTailIRC, IRC sunucularına bağlanma, kanal yönetimi ve gerçek zamanlı iletişim yönetimi için sağlam, tip güvenli bir arayüz sağlar. Optimal performans için Swift Concurrency ile inşa edilmiştir.",
  "connectionManagerKitTitle": "ConnectionManagerKit",
  "connectionManagerKitDescription": "Swift uygulamaları için kapsamlı bir bağlantı yönetimi çerçevesi. ConnectionManagerKit, ağ bağlantısını, bağlantı havuzlamasını ve bağlantı yaşam döngüsü yönetimini basitleştirir. Güvenilir ağ iletişimi gerektiren uygulamalar için mükemmeldir.",
  "postQuantumSolaceTitle": "PostQuantumSolace",
  "postQuantumSolaceDescription": "Swift uygulamaları için post-kuantum kriptografi kütüphanesi. PostQuantumSolace, kuantum hesaplama dirençli kriptografik algoritmalar ve protokoller sağlar, uygulamalarınızın kuantum hesaplama çağında güvende kalmasını sağlar.",
  "needleTailKitDescription": "NeedleTailKit nedir? NTK, güzel uçtan uca şifreli uygulamalar oluşturmayı sağlayan NeedleTail İstemci ve Sunucu Uygulamalarının temel SDK'sıdır. Mesajlaşma dışındaki çeşitli uygulamalar için kullanılabilir. İlgileniyor musunuz? Daha fazla bilgi için bizimle iletişime geçin!",
  "whiteTippedSocketsTitle": "White Tipped Sockets",
  "whiteTippedSocketsDescription": "WhiteTippedSockets, Swift Concurrency kullanarak Network.framework API üzerine inşa edilmiş iOS ve macOS için yerel bir WebSocket kütüphanesidir. Amacımız WebSocket iletişimi için modern, verimli bir çözüm sunmak ve gelecekte tam işlevsel, ölçeklenebilir bir sunucu geliştirmeyi de planlıyoruz.",
  "swiftHlsTitle": "Swift HLS",
  "swiftHlsDescription": "HTTP Live Streaming (HLS), verimli medya akışı için önemli bir teknolojidir ve SwiftHLS bunu kolaylaştırmak için tasarlanmıştır. Web'i güçlendiren aynı protokolü kullanarak, HLS REST API'leri ve CDN'ler aracılığıyla içerik dağıtımına izin verir. Amacı güvenilirlik sağlamak ve ağ koşullarına dinamik olarak uyum sağlamaktır.",
  "swiftIapTitle": "Swift IAP",
  "swiftIapDescription": "SwiftIAP, iOS ve macOS uygulamaları için kapsamlı bir Uygulama İçi Satın Alma kütüphanesidir. Uygulama içi satın almaları, abonelikleri ve makbuz doğrulamasını işlemek için modern, tip güvenli bir arayüz sağlar. Swift Concurrency ile oluşturulmuş ve kullanım kolaylığı için tasarlanmıştır.",
  "stompTitle": "Stomp",
  "stompDescription": "Stomp, STOMP protokolü iletişimi için bir Swift kütüphanesidir. STOMP sunucularına bağlanmak ve mesaj yönlendirmeyi işlemek için modern, tip güvenli bir arayüz sağlar. Güvenilir mesajlaşma altyapısına ihtiyaç duyan uygulamalar için mükemmeldir.",
  "privacy": "Gizlilik Politikası",
  "termsConditions": "Şartlar ve Koşullar",
  "projectTitle_1": "Projeler",
  "projectHeader_1": "PQSRTC",
  "projectTitleText_1": "RTC VoIP Çözümü",
  "projectTitle_2": "Projeler",
  "projectHeader_2": "NeedleTailKit",
  "projectTitleText_2": "Uçtan Uca Şifreli Mesajlaşma Çözümü",
  "projectTitle_3": "Projeler",
  "projectHeader_3": "White Tipped Sockets",
  "projectTitleText_3": "Swift Concurrent Network.framework Sarmalayıcısı",
  "projectTitle_4": "Projeler",
  "projectHeader_4": "Swift Stomp",
  "projectTitleText_4": "Swift Concurrent STOMP Protokolü",
  "projectTitle_5": "Projeler",
  "projectHeader_5": "Swift HLS",
  "projectTitleText_5": "Swift HLS Projesi",
  "pageNotFound": "Sayfa Bulunamadı",
  "pageNotFoundDescription": "Aradığınız sayfa mevcut değil veya taşınmış. Sizi tekrar yola çıkaralım.",
  "goHome": "Ana Sayfaya Git",
  "goBack": "Geri Git",
  "contact": "İletişim",
  "contactUs": "Bizimle İletişime Geçin",
  "becomeASponsor": "Sponsor Olun",
  "supportOpenSourceMessage": "Açık kaynak projelerimizi destekleyin ve harika yazılımlar geliştirmeye devam etmemize yardımcı olun.",
  "getStartedOnDigitalOcean": "Yeni kullanıcılar için 100$'lık 60 günlük kredi ile Digital Ocean'da başlayın.",
  "readyToGetStarted": "Başlamaya Hazır mısınız?",
  "letsDiscussProject": "Projenizi tartışalım ve Swift destekli çözümlerle fikirlerinizi hayata geçirmenize nasıl yardımcı olabileceğimizi görelim.",
  "backToTop": "Yukarı Çık",
  "needleTailsCopyright": "NeedleTails©",
  "pointsForConsideration": "Dikkat Edilecek Noktalar",
  "responsiveDesign": "Responsive & Adaptive Design",
  "responsiveDesignDescription": "Layouts and components that adapt to all viewports and devices. We deliver consistent, high-quality experiences on desktop, tablet, and mobile so your web product works everywhere your users are.",
  "crossBrowserCompatibility": "Cross-Browser & Standards Compliance",
  "crossBrowserCompatibilityDescription": "Testing and compatibility across major browsers and standards. We ensure consistent behavior and appearance so your application works reliably for every user, regardless of browser or device.",
  "webPerformanceOptimizationDescription": "Performance budgets, lazy loading, and optimized assets. We minimize load times and resource usage through efficient code, caching, and CDN strategies so your site feels fast and remains cost-effective at scale.",
  "userExperience": "User Experience & Accessibility",
  "userExperienceDescription": "Clear information architecture, intuitive navigation, and WCAG-aligned accessibility. We design and implement UX that drives engagement and meets enterprise usability and compliance expectations.",
  "securityPractices": "Security & Data Protection",
  "securityPracticesDescription": "HTTPS, secure headers, input validation, and protection against OWASP-top risks including XSS and CSRF. We harden web applications so your data and your users stay secure in production.",
  "seoBestPractices": "SEO & Discoverability",
  "seoBestPracticesDescription": "Semantic structure, meta tags, and content strategy aligned with search best practices. We optimize for discoverability and ranking so your web presence supports your business and marketing goals.",
  "backendSolutionsHeader": "Server-Side Solutions",
  "backendSolutionsDescription": "We design and deliver production-grade backends that power your business. Our server-first approach ensures APIs, data pipelines, and integrations are built for reliability, compliance, and scale—so your applications perform under real-world load and security requirements.",
  "backendCapabilitiesOverview": "Our server-side practice is built on Swift (Vapor, Hummingbird, SwiftNIO) and proven cloud-native patterns. We deliver secure, high-performance backends—REST and custom APIs, event-driven systems, and seamless integration with your existing stack. From architecture through deployment and observability, we own the full lifecycle so your teams can focus on product, not infrastructure.",
  "scalability": "Scalability & Resilience",
  "scalabilityDescription": "Architectures designed for growth: horizontal scaling, stateless services, and resilient patterns. We apply microservices, serverless, and queue-based designs so your backend handles traffic spikes and data growth without rework.",
  "security": "Security & Compliance",
  "securityDescription": "Robust security by default: encryption at rest and in transit, identity and access control, audit trails, and alignment with common compliance frameworks. We harden backends so your data and your users stay protected.",
  "maintainability": "Maintainability & Standards",
  "maintainabilityDescription": "Clean, modular, and well-documented codebases with consistent patterns and version control. We adopt and document coding standards so your team can maintain and extend the system with confidence.",
  "testingAndQualityAssurance": "Testing & Quality Assurance",
  "testingAndQualityAssuranceDescription": "Rigorous testing strategies: unit, integration, and contract tests with CI/CD automation. We maintain high quality and regression safety so releases are predictable and low-risk.",
  "monitoringAndLogging": "Monitoring & Observability",
  "monitoringAndLoggingDescription": "Production-ready observability: structured logging, metrics, and alerting. We instrument backends so you have clear visibility into health, performance, and incidents—and can respond before users are affected.",
  "nativeAppDevelopmentHeader": "Native Application Development",
  "nativeAppDevelopmentDescription": "We deliver native applications built for performance, security, and great user experience—on every platform your business requires.",
  "nativeAppDevelopmentOverview": "We build production-ready native apps for the full Apple ecosystem (iOS, iPadOS, macOS, tvOS, watchOS, visionOS) and Android. Our work emphasizes type-safe Swift and Kotlin/Java, platform-appropriate UX, accessibility, and security-by-design. From MVPs to large-scale deployments, we handle architecture, store readiness, and ongoing support so your apps stay performant, compliant, and maintainable.",
  "designConsistency": "Design Systems & Consistency",
  "designConsistencyDescription": "Unified design systems and component libraries across platforms. We ensure consistent branding, interaction patterns, and accessibility so your product feels cohesive on every device.",
  "deviceFragmentation": "Device & Platform Coverage",
  "deviceFragmentationDescription": "Structured testing across device matrices, screen sizes, and OS versions. We validate behavior and performance so your app works reliably for all target users, including edge cases.",
  "userExperienceUX": "User Experience & Accessibility",
  "userExperienceUXDescription": "Intuitive flows, clear information architecture, and WCAG-aligned accessibility. We design and implement UX that serves all users and supports usability and compliance goals.",
  "distributionCompliance": "Distribution & Store Compliance",
  "distributionComplianceDescription": "App Store and Play Store readiness: guidelines, privacy labels, and review best practices. We prepare and maintain your apps for public and private distribution channels.",
  "webDevelopmentExpertiseHeader": "Web Application Development",
  "webDevelopmentExpertiseDescription": "We build and maintain web applications that support your business goals—from marketing sites and portals to full-stack web apps that integrate with your existing systems.",
  "webDevelopmentOverview": "We deliver production-grade web experiences: responsive sites, SPAs, and full-stack applications built with Vue.js, Nuxt, and TypeScript on the front end, and Vapor, Hummingbird, or your preferred backend. Our work covers corporate sites, customer portals, internal tools, and public-facing apps—with a focus on performance, security, SEO, and maintainability so your web presence scales with your organization.",
  "solutionsTitle": "Çözümlerimiz",
  "featuredApplications": "Öne Çıkan Uygulamalar",
  "our": "Bizim",
  "featuredApps": "Öne Çıkan Uygulamalar",
  "featuredAppsDescription": "Swift geliştirme ve modern yazılım mimarisinin gücünü gösteren yenilikçi uygulamalarımızı keşfedin.",
  "nudgeTitle": "Secure Messaging You Control",
  "nudgeDescription": "End-to-end encrypted messaging with optional self-hosting. Your data stays yours—no third-party storage, no persistence risk. Run your own instance or scale globally.",
  "islandHoppersTitle": "Island Hoppers: Sorunsuz Maceralar için Nihai Tur Uygulamanız!",
  "islandHoppersDescription": "Island Hoppers, unutulmaz turlar düzenleyen bir şirket olsun veya mükemmel kaçamak arayan bir müşteri olsun, seyahat deneyiminizi geliştirmek için tasarlanmış all-in-one uygulamadır. Şirketler için uygulamamız tüm tur yönetim sürecini optimize eder. Turlarınızı zahmetsizce organize edin ve özelleştirin, tur rehberleriyle doğrudan iletişim kurun ve müşterilerinizi gerçek zamanlı güncellemelerle bilgilendirin. Island Hoppers ile rezervasyonları yönetebilir, müşteri tercihlerini takip edebilir ve her detayın halledildiğinden emin olabilirsiniz, böylece olağanüstü deneyimler sunmaya odaklanabilirsiniz. Müşteriler için Island Hoppers, aileler, sırt çantalı gezginler ve parti meraklıları dahil olmak üzere çeşitli grup türlerine uyarlanmış çeşitli tur paketleri sunar. Küratörlü macera seçimimizi gözden geçirin, tarzınıza uygun mükemmel paketi seçin ve benzer düşünen gezginlerle bağlantı kurun. Tur rehberlerinizle sorunsuz iletişimin keyfini çıkarın, temel bilgilere erişin ve yolculuğunuzdan en iyi şekilde yararlanmak için kişiselleştirilmiş öneriler alın. Island Hoppers ile, turunuzun her yönünün sadece bir dokunuş uzaklıkta olduğunu bilerek kolaylık ve güvenle unutulmaz maceralara çıkın!",
  "streamStackTitle": "Yazılım Çözümleriniz için Eğitim Platformu",
  "streamStackDescription": "Akış, Oku, Tartış. İster programlamaya yeni olun ister farklı yazılım çözümleri hakkında okumak isteyin, Vapor destekli Nuxt uygulamamızla sizin için kolaylaştırıyoruz. En son kodlama trendlerini takip edin.",
  "welcomeToNeedleTails": "NeedleTails'e Hoş Geldiniz - Yazılım Geliştirme Müttefikiniz",
  "accept": "Kabul ediyorum ve kabul ediyorum",
  "cookieConsentTitle": "Tarayıcı depolaması kullanıyoruz",
  "cookieConsentMessage": "Dil tercihinizi hatırlamak ve gezinme deneyiminizi geliştirmek için tarayıcı depolaması kullanıyoruz. 'Tümünü Kabul Et'e tıklayarak tarayıcı depolaması kullanımımızı kabul etmiş olursunuz.",
  "cookieConsentAcceptAll": "Tümünü Kabul Et",
  "cookieConsentAcceptNecessary": "Sadece Gerekli",
  "cookieConsentReject": "Tümünü Reddet",
  "cookieConsentLearnMore": "Daha Fazla Bilgi",
  "cookieConsentNecessary": "Gerekli depolama, tercih ettiğiniz dilde içerik sağlamak için dil algılamasını içerir.",
  "cookieConsentAnalytics": "Şu anda bu web sitesinde analitik takibi kullanmıyoruz.",
  "cookieConsentPreferences": "Tercih depolaması, deneyiminizi kişiselleştirmek için tema ve kullanıcı tercihleri gibi ayarlarınızı hatırlar.",
  "cookieConsentMarketing": "Şu anda bu web sitesinde pazarlama takibi veya reklam kullanmıyoruz.",
  "brewhubWidgetTitle": "BrewHub",
  "brewhubWidgetDescription": "Profesyonel yazılım geliştirme kursları ve eğitim platformu. Geliştirme becerilerinizi geliştirmek için üretim seviyesi araçlar ve iş akışlarıyla rehberli, canlı eğitime erişin.",
  "brewhubWidgetCTA": "Eğitim Kursları",
  "brewhubComingSoonTitle": "Mevcut",
  "brewhubComingSoonDescription": "BrewHub artık kullanılabilir. Profesyonel yazılım geliştirme kursları ve eğitim için brewhub.needletails.com adresini ziyaret edin.",
  "brewhubFeature1Title": "Uzman Kurslar",
  "brewhubFeature1Description": "Sektör uzmanları tarafından verilen profesyonel yazılım geliştirme kurslarına erişin.",
  "brewhubFeature2Title": "Canlı Eğitim",
  "brewhubFeature2Description": "Uzman rehberliğinde bire bir veya küçük grup canlı eğitimi.",
  "brewhubFeature3Title": "Topluluk",
  "brewhubFeature3Description": "Bir geliştirici topluluğuna katılın ve birlikte öğrenin.",
  "brewhubFeature4Title": "Üretim Araçları",
  "brewhubFeature4Description": "Üretim ortamlarında kullanılan aynı araç ve iş akışlarıyla öğrenin.",
  "brewhubBackToMainSite": "BrewHub'a Git",
  "brewhubMetaTitle": "BrewHub | NeedleTails",
  "brewhubMetaDescription": "BrewHub, NeedleTails'in profesyonel yazılım geliştirme kursları ve eğitim platformudur.",
  "brewhubOgDescription": "Profesyonel yazılım geliştirme kursları ve eğitim platformu.",
  "brewhubLogoAlt": "BrewHub Logosu",
  "needletailKitTitle": "NeedleTailKit",
  "needletailKitSubtitle": "Kurumsal düzeyde güvenlik özelliklerine sahip güvenli, uçtan uca şifreli mesajlaşma uygulamaları oluşturmak için kapsamlı, üretime hazır bir Swift SDK.",
  "needletailKitPrivateBadge": "Özel SDK - Lisans Gerekli",
  "needletailKitRequestLicense": "Lisans İste",
  "needletailKitExploreFeatures": "Özellikleri Keşfet",
  "needletailKitFeaturesTitle": "Kurumsal Düzeyde Özellikler",
  "needletailKitFeaturesDescription": "En son teknoloji güvenlik ve modern Swift mimarisi ile üretim için inşa edilmiştir.",
  "needletailKitSecurityTitle": "Kurumsal Güvenlik",
  "needletailKitSecurityPQ": "Post-Kuantum Kriptografi - Kuantum saldırılarına karşı gelecek güvencesi",
  "needletailKitSecurityDoubleRatchet": "Double Ratchet Protokolü - Mükemmel ileri gizlilik",
  "needletailKitSecurityE2E": "Uçtan Uca Şifreleme - Tüm mesajlar varsayılan olarak şifrelenir",
  "needletailKitSecurityDeviceVerification": "Cihaz Doğrulama - Kriptografik cihaz bağlantısı",
  "needletailKitPlatformTitle": "Çoklu Platform Desteği",
  "needletailKitPlatformIOS": "iOS 18.0+ - Tam yerel iOS desteği",
  "needletailKitPlatformMacOS": "macOS 15.0+ - Tam macOS entegrasyonu",
  "needletailKitPlatformSwift6": "Swift 6.0+ - En son dil özellikleri",
  "needletailKitPlatformAsync": "Async/Await - Her yerde modern eşzamanlılık",
  "needletailKitTransportTitle": "Akıllı Taşıma",
  "needletailKitTransportMulti": "Çoklu Taşıma Yönlendirme - Otomatik yol seçimi",
  "needletailKitTransportP2P": "Yerel Ağ P2P - Doğrudan cihaz iletişimi",
  "needletailKitTransportDCC": "DCC Protokolü - TLS ile IRC tabanlı P2P",
  "needletailKitTransportFailover": "Otomatik Yedekleme - Kesintisiz taşıma değişimi",
  "needletailKitMessagingTitle": "Zengin Mesajlaşma",
  "needletailKitMessagingText": "Metin Mesajları - Basit, güvenli iletişim",
  "needletailKitMessagingMedia": "Medya Mesajları - Görüntüler, videolar, belgeler",
  "needletailKitMessagingSelfDestruct": "Kendini Yok Eden Mesajlar - Geçici destek",
  "needletailKitMessagingEdit": "Mesaj Düzenleme - Gönderilen mesajları düzenleme",
  "needletailKitVoiceVideoTitle": "Ses ve Görüntülü Aramalar",
  "needletailKitVoiceVideoWebRTC": "WebRTC Entegrasyonu - Yüksek kaliteli aramalar",
  "needletailKitVoiceVideoSTUN": "STUN/TURN Desteği - NAT geçişi",
  "needletailKitVoiceVideoCallManagement": "Arama Yönetimi - Tam yaşam döngüsü işleme",
  "needletailKitEnterpriseTitle": "Kurumsal Hazır",
  "needletailKitEnterpriseProduction": "Üretime Hazır - Gerçek uygulamalarda test edilmiştir",
  "needletailKitEnterpriseSupport": "Kurumsal Destek - Profesyonel destek mevcuttur",
  "needletailKitEnterpriseCompliance": "Uyumluluk - Düzenleyici uyumluluk için inşa edilmiştir",
  "needletailKitEnterpriseScalability": "Ölçeklenebilirlik - Büyük ölçekli dağıtımlar için tasarlanmıştır",
  "needletailKitQuickStartTitle": "Quick Start",
  "needletailKitQuickStartDescription": "Get started with NeedleTailKit in minutes. Follow these simple steps to integrate secure messaging into your application.",
  "needletailKitInstallTitle": "Installation",
  "needletailKitInstallCode": "dependencies: [\n    .package(url: \"https://github.com/needletails/needle-tail-kit.git\", from: \"1.0.0\")\n]",
  "needletailKitInitializeTitle": "Initialize Session",
  "needletailKitInitializeCode": "import NeedleTailKit\n\nlet session = NeedleTailSession.shared\ntry await session.createNewUserAccount(\n    authInfo: authInfo,\n    store: store,\n    eventObserver: eventObserver\n)",
  "needletailKitSendMessageTitle": "Send Your First Message",
  "needletailKitSendMessageCode": "let contact = try await session.createContact(contact: \"bob\")\ntry await session.sendMessage(\n    messageType: .text,\n    recipient: .nickname(\"bob\"),\n    text: \"Hello, World!\"\n)",
  "needletailKitContactTitle": "Lisans İste",
  "needletailKitContactDescription": "NeedleTailKit, özel mülkiyetli, kapalı kaynak bir SDK'dır. Projeniz için lisanslama seçeneklerini görüşmek üzere bizimle iletişime geçin.",
  "needletailKitContactButton": "Lisans İçin İletişime Geç",
  "needletailKitMetaTitle": "NeedleTailKit - Kurumsal Güvenli Mesajlaşma SDK | NeedleTails",
  "needletailKitMetaDescription": "Güvenli, uçtan uca şifreli mesajlaşma uygulamaları oluşturmak için üretime hazır Swift SDK. Post-kuantum kriptografi, çoklu platform desteği ve kurumsal düzeyde güvenlik.",
  "needletailKitOgDescription": "Kurumsal düzeyde güvenlik özelliklerine sahip güvenli mesajlaşma için üretime hazır Swift SDK.",
  "needletailKitLogoAlt": "NeedleTailKit Logosu",
  "needletailKitPlatformAndroid": "Android: API 24 (Android 7.0) veya üzeri",
  "nudgeWidgetTitle": "Nudge ile Güvenli",
  "nudgeWidgetDescription": "İsteğe bağlı kendi kendini izleyen, uçtan uca şifreli mesajlaşma, tam veri kontrolü.",
  "nudgeWidgetCTA": "Daha Fazla Bilgi",
  "nudgeWidgetLogoAlt": "Nudge Logosu",
  "nudgeFeature1Title": "End-to-End Encryption",
  "nudgeFeature1Description": "Every message encrypted by default. Full privacy.",
  "nudgeFeature2Title": "Your Data, Your Rules",
  "nudgeFeature2Description": "Optional self-hosting. No external data storage.",
  "nudgeFeature3Title": "Secure Channels",
  "nudgeFeature3Description": "Private messaging built for security.",
  "nudgeFeature4Title": "Global or Self-Hosted",
  "nudgeFeature4Description": "Scale globally or run your own instance—no data persistence risk.",
  "nudgeContactButton": "Nudge'u İncele",
  "nudgeMetaTitle": "Nudge - Güvenli Uçtan Uca Şifreli Mesajlaşma | NeedleTails",
  "nudgeMetaDescription": "İsteğe bağlı kendi kendini izleyen, uçtan uca şifreli mesajlaşma uygulaması, tam veri kontrolü. Veri kalıcılığı riski olmadan güvenli iletişim.",
  "nudgeOgDescription": "İsteğe bağlı kendi kendini izleyen, uçtan uca şifreli mesajlaşma, tam veri kontrolü ve kurumsal düzeyde güvenlik.",
  "nudgeMetaKeywords": "Nudge, güvenli mesajlaşma, uçtan uca şifreleme, şifreli mesajlaşma uygulaması, isteğe bağlı kendi kendini izleyen mesajlaşma, özel mesajlaşma, güvenli iletişim, veri gizliliği, mesajlaşma güvenliği, şifreli sohbet, güvenli sohbet uygulaması, gizlilik odaklı mesajlaşma",
  "brewhubMetaKeywords": "BrewHub, yazılım geliştirme kursları, programlama kursları, geliştirici eğitimi, yazılım eğitimi, kodlama kursları, geliştirme eğitimleri, teknik eğitim, yazılım öğrenme platformu, programlama eğitimleri, web geliştirme kursları, mobil geliştirme kursları, backend geliştirme eğitimi",
  "needletailKitMetaKeywords": "NeedleTailKit, Swift SDK, uçtan uca şifreleme, güvenli mesajlaşma, iOS SDK, macOS SDK, Android SDK, kuantum sonrası kriptografi",
  "heroTagline": "Zorluklarınızı çözüyoruz—uygulamalar, web siteleri ve entegre yazılım çözümleri.",
  "managementPageLabel": "Management",
  "managementPageTitle": "Product & Project Delivery",
  "managementPageLead": "We align vision, roadmap, and execution so your software projects stay on scope, schedule, and quality.",
  "managementCtaLead": "Ready to align your next project?",
  "consultationPageLabel": "Consultation",
  "consultationCtaLead": "Tell us about your goals and we'll outline a clear path forward."
}
